import rat from "@/assets/public/chinese_japanese/Property 1=мышка.svg";
import ox from "@/assets/public/chinese_japanese/Property 1=бык.svg";
import tiger from "@/assets/public/chinese_japanese/Property 1=тигр.svg";
import rabbit from "@/assets/public/chinese_japanese/Property 1=заяц-1.svg";
import dragon from "@/assets/public/chinese_japanese/Property 1=дракон.svg";
import snake from "@/assets/public/chinese_japanese/Property 1=заяц.svg";
import horse from "@/assets/public/chinese_japanese/Property 1=лошадка.svg";
import sheep from "@/assets/public/chinese_japanese/Property 1=овен.svg";
import monkey from "@/assets/public/chinese_japanese/Property 1=обезьян.svg";
import rooster from "@/assets/public/chinese_japanese/Property 1=петух.svg";
import dog from "@/assets/public/chinese_japanese/Property 1=собака.svg";
import pig from "@/assets/public/chinese_japanese/Property 1=свин.svg";


export const chineseSigns = {
        rat: {
            ru: "Крыса",
            en:
                "rat",
            image:
            rat,
            description:
                "Крыса в китайском гороскопе символизирует сообразительность, находчивость и обаяние. Люди, рожденные под этим знаком, обладают острым умом и быстрым мышлением, что делает их отличными стратегами и решателями проблем. Крысы обычно адаптивны и умеют находить выход из самых сложных ситуаций. Они обладают обаянием и легко заводят новые знакомства, что помогает им в общении с различными людьми. Крысы могут быть энергичными и амбициозными, стремясь к достижению своих целей. Однако иногда их желание преуспеть может привести к излишней конкуренции и коварству. Для Крыс важно научиться быть более терпимыми и честными в своих намерениях. Крысы успешны в профессиях, требующих ловкости и коммуникаций, таких как бизнес, маркетинг и журналистика."
        }
        ,
        ox: {
            ru: "Бык",
            en:
                "ox",
            image:
            ox,
            description:
                "Бык в китайском гороскопе символизирует силу, упорство и надёжность. Люди, рожденные под этим знаком, обычно обладают твердым и решительным характером. Они трудолюбивы, терпеливы и способны упорно идти к своим целям, не отвлекаясь на мелочи. Быки ценят порядок и стабильность, и часто становятся опорой для своих близких. Они честны, прямолинейны и предпочитают действовать, а не говорить. Однако иногда Быки могут быть упрямыми и непреклонными, что может вызывать трудности в общении. Важно для них научиться проявлять гибкость и терпимость. Быки часто достигают успеха в профессиях, требующих настойчивости и терпения, таких как строительство, сельское хозяйство и инженерия.",
        }
        ,
        tiger: {
            ru: "Тигр",
            en:
                "tiger",
            image:
            tiger,
            description:
                "Тигр в китайском гороскопе символизирует силу, смелость и независимость. Люди, рожденные под этим знаком, обладают ярким и динамичным характером. Они энергичны, харизматичны и всегда стремятся к приключениям и новым вызовам. Тигры – прирожденные лидеры, уверенные в себе и способные вдохновлять окружающих. Их решительность и жажда справедливости делают их борцами за правду. Однако Тигры могут быть импульсивными и нетерпеливыми, что иногда приводит к конфликтам. Им важно научиться сдерживать свои эмоции и действовать более взвешенно. Тигры часто добиваются успеха в профессиях, требующих смелости и инициативы, таких как бизнес, политика и спорт.",
        }
        ,
        rabbit: {
            ru: "Кролик",
            en:
                "rabbit",
            image:
            rabbit,
            description:
                "Кролик в китайском гороскопе символизирует изящество, дипломатичность и чувствительность. Люди, рожденные под этим знаком, обладают мягким и добрым характером. Они вежливы, тактичны и стремятся избегать конфликтов, предпочитая гармонию и мир. Кролики ценят уют и комфорт, как в личной жизни, так и в окружении. Они обладают хорошим вкусом и часто проявляют себя в искусстве и дизайне. Однако их чувствительность делает их уязвимыми к стрессу и критике. Им важно учиться быть более уверенными и решительными. Кролики успешны в профессиях, требующих внимания к деталям и общения, таких как преподавание, психология и искусство.",
        }
        ,
        dragon: {
            ru: "Дракон",
            en:
                "dragon",
            description:
                "Дракон в китайском гороскопе символизирует силу, удачу и благородство. Люди, рожденные под этим знаком, обладают харизматичной и уверенной натурой. Они энергичны, амбициозны и стремятся к великим достижениям. Драконы часто являются прирожденными лидерами, вдохновляющими окружающих своим энтузиазмом и решительностью. Благодаря своей мудрости и щедрости они привлекают внимание и пользуются уважением. Однако их стремление к совершенству может сделать их нетерпимыми к ошибкам и недостаткам других. Для Драконов важно развивать терпимость и смирение. Они успешны в профессиях, требующих лидерства и творчества, таких как бизнес, политика и искусство.",
            image:
            dragon,
        }
        ,
        snake: {
            ru: "Змея",
            en:
                "snake",
            description:
                "Змея в китайском гороскопе символизирует мудрость, интуицию и тайну. Люди, рожденные под этим знаком, обладают глубоким мышлением и аналитическим складом ума. Они проницательны, умны и часто имеют философский взгляд на жизнь. Змеи обладают сильной интуицией и способны видеть суть вещей, что помогает им принимать обдуманные решения. Их очарование и магнетизм привлекают окружающих, однако они могут быть замкнутыми и скрытными. Иногда их склонность к анализу может привести к излишней подозрительности и недоверию. Им важно развивать доверие и открытость в отношениях. Змеи успешны в профессиях, требующих глубокого анализа и стратегии, таких как наука, исследовательская деятельность и психология.",
            image:
            snake,
        }
        ,
        horse: {
            ru: "Лошадь",
            en:
                "horse",
            description:
                "Лошадь в китайском гороскопе символизирует энергию, свободу и страсть. Люди, рожденные под этим знаком, обладают независимым и динамичным характером. Они полны энтузиазма, любят приключения и стремятся к новым впечатлениям. Лошади часто бывают общительными и легко заводят друзей, привлекая к себе людей своей харизмой и оптимизмом. Они трудолюбивы и целеустремленны, способны преодолевать трудности и добиваться успеха в своих начинаниях. Однако их стремление к свободе иногда делает их нетерпимыми к ограничениям и правилам. Лошадям важно учиться контролировать свои импульсы и быть более терпеливыми. Они успешны в профессиях, связанных с активной деятельностью и коммуникацией, таких как спорт, путешествия и бизнес.",
            image:
            horse,
        }
        ,
        goat: {
            ru: "Коза",
            en:
                "goat",
            description:
                "Коза в китайском гороскопе символизирует креативность, чувствительность и душевную гармонию. Люди, рожденные под этим знаком, обладают изящным и творческим характером. Они мягкосердечные, добрые и стремятся к гармонии во всех сферах жизни. Козы обладают тонким вкусом и эстетическим чутьем, что позволяет им создавать красоту вокруг себя. Они часто являются вдохновленными художниками, музыкантами или писателями. Козы также известны своей чуткостью к эмоциям других и могут быть прекрасными слушателями и советчиками. Однако их чувствительность иногда делает их слишком уязвимыми перед внешними воздействиями. Для Коз важно научиться управлять своими эмоциями и развивать уверенность в себе. Они успешны в профессиях, требующих творческого мышления и интуиции, таких как искусство, дизайн и психология.",
            image:
            sheep,
        }
        ,
        monkey: {
            ru: "Обезьяна",
            en:
                "monkey",
            description:
                "Обезьяна в китайском гороскопе символизирует общительность, остроумие и подвижность. Люди, рожденные под этим знаком, обладают ярким и обаятельным характером. Они креативны, сообразительны и обладают живым умом, что делает их отличными переговорщиками и общественными лидерами. Обезьяны обычно привлекают внимание окружающих своим обаянием и остроумием. Они способны адаптироваться к трудным ситуациям и быстро находить из них выход. Однако их подвижный характер может иногда приводить к недостатку терпения и ответственности. Для Обезьян важно научиться сосредотачиваться на конкретных целях и доводить начатое дело до конца. Обезьяны успешны в профессиях, требующих творчества и коммуникаций, таких как медиа, развлекательная индустрия и маркетинг.",
            image:
            monkey,
        }
        ,
        rooster: {
            ru: "Петух",
            en:
                "rooster",
            description:
                "Петух в китайском гороскопе символизирует смелость, гордость и независимость. Люди, рожденные под этим знаком, обладают ярким и энергичным характером. Они амбициозны, уверены в себе и стремятся к достижению высоких целей. Петухи часто выделяются в толпе своим харизматичным и уверенным поведением. Это сильные личности, готовые защищать свои убеждения до конца. Однако иногда их гордыня и независимость могут привести к конфликтам с окружающими. Для Петухов важно научиться управлять своими эмоциями и быть более терпимыми к мнению других. Петухи успешны в профессиях, требующих лидерства и инициативы, таких как бизнес, политика и искусство.",
            image:
            rooster,
        }
        ,
        dog: {
            ru: "Собака",
            en:
                "dog",
            description:
                "Собака в китайском гороскопе символизирует верность, честность и преданность. Люди, рожденные под этим знаком, обладают добрым и отзывчивым характером. Они преданные друзья и надежные партнеры, готовые помочь в трудную минуту. Собаки обладают чувством долга и ответственности, что делает их надежными и уважаемыми членами общества. Они склонны к справедливости и часто выступают в защиту слабых и угнетенных. Однако иногда их чрезмерная преданность может привести к наивности и доверчивости. Для Собак важно научиться устанавливать границы и защищать свои интересы. Собаки успешны в профессиях, требующих доброты и заботы, таких как медицина, образование и благотворительность.",
            image:
            dog,
        }
        ,
        pig: {
            ru: "Свинья",
            en:
                "pig",
            description:
                "Свинья в китайском гороскопе символизирует доброту, изобретательность и щедрость. Люди, рожденные под этим знаком, обладают дружелюбным и открытым характером. Они часто выделяются своим доброжелательным и общительным поведением, что делает их популярными среди окружающих. Свиньи обладают большой креативностью и часто проявляют себя в искусстве и ремеслах. Они также щедры и готовы поделиться своими ресурсами с другими. Однако иногда их доверчивость и наивность могут сделать их уязвимыми перед манипуляциями со стороны других. Для Свиней важно научиться быть более осторожными в своих решениях. Свиньи успешны в профессиях, требующих креативности и чувства юмора, таких как развлекательная индустрия, дизайн и реклама.",
            image:
            pig,
        }
    }
;

import water from "@/assets/public/chinese_japanese/chinese_elements/Property 1=вода.svg";
import fire from "@/assets/public/chinese_japanese/chinese_elements/Property 1=огонь.svg";
import tree from "@/assets/public/chinese_japanese/chinese_elements/Property 1=дерево.svg";
import earth from "@/assets/public/chinese_japanese/chinese_elements/Property 1=земля.svg";
import metal from "@/assets/public/chinese_japanese/chinese_elements/Property 1=сталь.svg";

export const chineseElements = {
    water: {
        ru: "Вода",
        en: "water",
        description: "Вода в китайском гороскопе символизирует глубокие эмоции, интуицию и душевную чувствительность. Люди, рожденные под влиянием стихии Воды, часто обладают характером, близким к воде: они могут быть глубоко чувственными, интуитивными и эмоционально отзывчивыми. Вода также символизирует переменчивость и способность к адаптации. Люди, связанные с этой стихией, часто обладают гибким умом и легко приспосабливаются к изменяющимся обстоятельствам. Вода в китайском гороскопе также ассоциируется с семьей, чувствами и интимностью. Люди, рожденные под этой стихией, обычно ценят близкие отношения и часто выступают в роли эмоциональной опоры для своих близких. Они могут быть чуткими и заботливыми партнерами, стремясь создать гармонию и уют в своей семье.",
        image: water,
    },
    fire: {
        ru: "Огонь",
        en: "fire",
        description: "Огонь в китайском гороскопе символизирует страсть, энергию и динамику. Люди, связанные с этой стихией, обычно обладают ярким характером и стремятся к активной жизненной позиции. Они обладают внутренним огнем, который побуждает их к творчеству и достижению целей. Как пламя, они могут быть эмоциональными и страстными в своих стремлениях. Огонь также символизирует общение и общественную активность. Люди этой стихии обычно общительны и с легкостью заводят новые знакомства. Им присущи энтузиазм и энергия, которые помогают им вдохновлять окружающих. Однако при избытке огня они могут быть импульсивными и недисциплинированными. Для них важно научиться контролировать свои эмоции и направлять их в конструктивное русло, чтобы достичь успеха в жизни.",
        image: fire,
    },
    metal: {
        ru: "Металл",
        en: "metal",
        description: "Металл в китайском гороскопе символизирует силу, уверенность и решительность. Люди, связанные с этой стихией, обычно обладают ярко выраженными лидерскими качествами и стремятся к достижению высоких стандартов. Они как золото, которое проходит через огонь и становится ковким и прочным. Они обычно ценят порядок и дисциплину и часто принимают ответственные решения. Металл также ассоциируется с интеллектом и мудростью. Люди этой стихии обычно обладают аналитическим складом ума и способностью к стратегическому мышлению. Они стремятся к знаниям и развитию, чтобы стать успешными в своей области. Однако при избытке металла они могут стать слишком строгими и непреклонными, что может препятствовать сотрудничеству и развитию отношений. Для них важно научиться проявлять гибкость и толерантность, чтобы добиться баланса между силой и компромиссом.",
        image: metal,
    },
    tree: {
        ru: "Дерево",
        en: "tree",
        description: "Дерево в китайском гороскопе символизирует рост, стабильность и жизненную силу. Люди, связанные с этой стихией, обычно обладают твердым и стойким характером, подобно могучим деревьям, укорененным в земле. Они стремятся к постоянному развитию, как внутреннему, так и внешнему. Им присуща надежность, упорство и способность преодолевать трудности. Как и деревья, они могут быть защитой и опорой для окружающих, готовы поддержать и помочь в сложных ситуациях. Эти люди обычно ценят гармонию с природой и стремятся к балансу в жизни.",
        image: tree,
    },
    earth: {
        ru: "Земля",
        en: "earth",
        description: "Земля в китайском гороскопе символизирует стабильность, надежность и практичность. Люди, связанные с этой стихией, обычно обладают земными качествами, такими как терпение, целеустремленность и прагматичность. Они часто выступают в роли опоры для окружающих, подобно неподвижному фундаменту, на котором строятся дома. Земля также символизирует плодородие. Люди этой стихии обычно трудолюбивы и способны преодолевать трудности, достигая своих целей медленно, но верно. Они ценят стабильность и уверенность в будущем, стремясь создать прочные основы для своей жизни. Однако при избытке земли они могут стать чересчур консервативными и упрямыми. Для них важно найти баланс между практичностью и гибкостью, чтобы достичь гармонии в жизни.",
        image: earth,
    },
};
