import bereza from "@/assets/public/druids/Property 1=береза.svg";
import buk from "@/assets/public/druids/Property 1=бук.svg";
import grab from "@/assets/public/druids/Property 1=граб.svg";
import dub from "@/assets/public/druids/Property 1=дуб.svg";
import zhasmin from "@/assets/public/druids/Property 1=жасмин.svg";
import iva from "@/assets/public/druids/Property 1=Ива.svg";
import inzhir from "@/assets/public/druids/Property 1=инжир.svg";
import kedr from "@/assets/public/druids/кедр.svg";
import kashtan from "@/assets/public/druids/каштан.svg";
import kiparis from "@/assets/public/druids/Property 1=кипарис.svg";
import klen from "@/assets/public/druids/Property 1=клен.svg";
import lipa from "@/assets/public/druids/Property 1=липа.svg";
import maslina from "@/assets/public/druids/Property 1=маслина.svg";
import oreh from "@/assets/public/druids/Property 1=орех.svg";
import oreshnik from "@/assets/public/druids/Property 1=орешник.svg";
import pihta from "@/assets/public/druids/Property 1=пихта.svg";
import ryabina from "@/assets/public/druids/Property 1=рябина.svg";
import sosna from "@/assets/public/druids/Property 1=сосна.svg";
import topol from "@/assets/public/druids/Property 1=тополь.svg";
import yablonya from "@/assets/public/druids/Property 1=яблоня.svg";
import vyaz from "@/assets/public/druids/Property 1=вяз.svg";
import yasen from "@/assets/public/druids/Property 1=ясень.svg";

export const druidsSigns = {
        birch:
            {
                ru: "Береза",
                en:
                    "birch",
                description:
                    "Люди, рожденные под знаком Березы в гороскопе Друидов, обладают рядом характеристик, которые связывают их с символикой этого древа. Береза ассоциируется с новым началом и обновлением, что отражает характеристики людей этого знака. Они часто обладают творческими способностями и стремятся к гармонии с природой, проникая в тайны мира вокруг них. Эмоциональность и чувствительность также являются типичными чертами для людей Березы, что делает их интуитивными и способными ощущать энергии и настроения окружающих. Вместе с тем, как и береза, они могут быть уязвимыми и подверженными колебаниям настроения. Однако их стремление к гармонии и мягкость помогают им находить баланс в жизни и в отношениях с окружающими. В целом, люди, рожденные под знаком Березы, могут быть вдохновленными и влиятельными, привнося в мир свою уникальную энергию и восприятие.",
                image:
                bereza,
            }
        ,
        beech: {
            ru: "Бук",
            en:
                "beech",
            description:
                "Люди, рожденные под этим знаком, обладают выдающейся силой духа, стойкостью и целеустремленностью, как само дерево бук, символизирующее устойчивость и глубокие корни. Они обладают ярко выраженной лидерской индивидуальностью и непоколебимой волей, готовы преодолевать любые препятствия на пути к своим целям. Они часто вдохновляют окружающих своим энтузиазмом и преданностью своим убеждениям. Это творческие и организаторские личности, способные воплощать свои идеи в жизнь и вдохновлять других на сотрудничество. Они ценят порядок и дисциплину, стремясь к эффективности и результативности во всем, что делают. В то же время люди этого знака могут быть немного склонны к упрямству и независимости, иногда отстаивая свою точку зрения слишком настойчиво. Однако их честность и преданность делу обычно вызывают уважение и доверие окружающих.",
            image:
            buk,
        }
        ,
        hornbeam: {
            ru: "Граб",
            en:
                "hornbeam",
            description:
                "Граб в друидическом гороскопе символизирует силу, преобразование и возрождение. Люди, рожденные под этим знаком, обладают необычной способностью адаптироваться к переменам и преодолевать препятствия. Как дерево граб, они могут преодолевать трудности, перерастая их в новые возможности для роста и развития. Грабовые люди обычно обладают сильным характером и уверенностью в себе, что помогает им преодолевать любые трудности на своем пути. Они часто являются вдохновителями и лидерами, способными вдохновлять других на смелые поступки и новые достижения. Влияние Граба также придает им способность к преобразованию и саморазвитию, что помогает им постоянно совершенствоваться как личности. Люди этого знака могут быть амбициозными и настойчивыми в достижении своих целей, но при этом часто сохраняют гибкость мышления и способность адаптироваться к изменяющимся обстоятельствам. В отношениях они часто являются страстными и преданными партнерами, готовыми поддерживать своих близких в трудные времена и радоваться успехам вместе.",
            image:
            grab,
        }
        ,
        oak: {
            ru: "Дуб",
            en:
                "oak",
            description:
                "Дуб – символ силы и стойкости в друидском гороскопе. Люди, рожденные под этим знаком, обладают мощным и устойчивым характером, способным противостоять любым испытаниям с достоинством и решимостью. Они как дубы, корни которых уходят глубоко в землю, укрепляются благодаря силе своих убеждений и ценностей. Люди этого знака обычно обладают богатым жизненным опытом и глубоким пониманием жизненных истин. Они являются авторитетами и лидерами в своем окружении, способными давать мудрые советы и руководить другими справедливо и мудро. Дубы также ассоциируются с защитой и надежностью. Люди этого знака обычно служат опорой и защитой для своих близких, готовыми отстаивать их интересы и защищать от любых угроз. Символически Дуб ассоциируется с ростом и процветанием. Представители этого знака стремятся к постоянному развитию и личностному росту, стремясь к достижению своего полного потенциала и гармонии с собой и миром вокруг. Они готовы принимать перемену как неотъемлемую часть своего жизненного пути и использовать ее в своих интересах.",
            image:
            dub,
        }
        ,
        jasmine: {
            ru: "Жасмин",
            en:
                "jasmine",
            description:
                "Жасмин в друидическом гороскопе символизирует изящество, чувственность и внутреннюю красоту. Люди, рожденные под этим знаком, часто обладают изысканным вкусом и тонкими эстетическими предпочтениями. Они стремятся к гармонии во всем, как внутри себя, так и в окружающем мире. Жасминовые люди обычно обладают прекрасным чувством стиля и умением создавать уют и красоту в своем окружении. Они могут быть искусными художниками, музыкантами или дизайнерами, способными воплотить свою внутреннюю гармонию во внешнем мире. В их сердцах горит пламя страсти и романтики, они ценят красоту как внешнюю, так и внутреннюю. Люди этого знака обычно обладают обширным воображением и часто стремятся к самовыражению через творчество. Они могут быть эмоциональными и восприимчивыми к окружающим энергиям, что делает их отличными слушателями и эмпатичными друзьями. Влияние Жасмина также может придавать им внутренний покой и спокойствие, помогая им находить красоту и в радостях, и в горестях жизни.",
            image:
            zhasmin,
        }
        ,
        willow: {
            ru: "Ива",
            en:
                "willow",
            description:
                "Ива – символ гибкости и эмоциональной глубины в друидском гороскопе. Люди, рожденные под этим знаком, обладают чувственным и восприимчивым характером, способным глубоко переживать мир вокруг себя. Они как ивы, могут изгибаться под влиянием чувств и эмоций, но сохраняют свою силу и устойчивость. Ивы также символизируют интуицию и внутреннее видение. Они могут предчувствовать будущие события и принимать мудрые решения, опираясь на свою интуицию. Ивы также ассоциируются с творчеством и воображением. Люди этого знака обычно обладают богатым внутренним миром и способностью видеть красоту и вдохновение вокруг себя, выражать свои чувства и мысли через искусство, музыку или слово. Символически, Ива также ассоциируется с гармонией и согласием. Представители этого знака обычно стремятся к гармонии внутри себя и в своих отношениях с окружающим миром. Они готовы находить компромиссы и решать конфликты с мудростью и состраданием. В друидской астрологии Ива также считается символом регенерации и обновления. Люди этого знака способны проходить через периоды личностного роста и преображения, становясь сильнее и мудрее с каждым новым этапом своего пути.",
            image:
            iva,
        }
        ,
        fig: {
            ru: "Инжир",
            en:
                "fig",
            description:
                "Инжир в друидическом гороскопе символизирует плодородие, изобилие и гармонию. Люди, рожденные под этим знаком, обычно обладают изобретательным мышлением и творческим потенциалом. Они как дерево инжира, щедро делятся своими талантами и ресурсами с окружающими, способствуя процветанию и обогащению всех вокруг. Инжировые люди часто обладают способностью к сотрудничеству и могут успешно работать в команде, добиваясь общих целей. Влияние Инжира также придает им чувство внутренней уверенности и спокойствия, что позволяет им преодолевать трудности с легкостью и сохранять гармонию в отношениях с окружающими. Люди этого знака обычно ценят связь с природой и стремятся к балансу между духовным и материальным. Они могут быть щедрыми и великодушными, готовыми помогать тем, кто нуждается в поддержке или помощи. В отношениях они обычно являются заботливыми и внимательными партнерами, готовыми поддерживать своих близких в трудные моменты и радоваться их успехам.",
            image:
            inzhir,
        }
        ,
        rowan: {
            ru: "Кедр",
            en:
                "rowan",
            description:
                "Кедр – символ мудрости и устойчивости в друидском гороскопе. Люди, рожденные под этим знаком, обладают глубоким внутренним знанием и мудростью. Они как кедры, укорененные в своих убеждениях и ценностях, прочно стоят перед испытаниями жизни. Кедры также символизируют спокойствие и внутренний покой. Люди этого знака обычно обладают уравновешенным характером и способностью сохранять эмоциональное равновесие даже в самых трудных ситуациях. Они могут служить источником поддержки и стабильности для окружающих благодаря своему спокойствию и мудрости. Кедры также обладают развитым шестым чувством и способностью чувствовать энергии и ауры окружающих. Они могут предчувствовать будущие события и принимать мудрые решения, опираясь на свою интуицию. Символически, Кедр также ассоциируется с защитой и благополучием. Представители этого знака обычно заботятся о благополучии своих близких и готовы предложить защиту и поддержку в трудные моменты. В друидской астрологии Кедр также считается символом роста и развития. Люди этого знака стремятся к постоянному самосовершенствованию и личностному росту, стремясь к достижению своего полного потенциала и духовной гармонии.",
            image:
            kedr,
        }
        ,
        chestnut: {
            ru: "Каштан",
            en:
                "chestnut",
            description:
                "Знак Каштана в друидическом гороскопе символизирует силу, стойкость и уверенность в себе. Люди, рожденные под этим знаком, обладают сильным характером и решительностью в достижении своих целей. Они как дерево каштана, укорененное глубоко в земле, не поддаются легко ветрам перемен и трудностям жизни. Каштановые люди часто являются лидерами, способными вести других за собой своим примером и решительными действиями. Они обладают высокой энергией и страстью к жизни, что помогает им преодолевать препятствия и достигать успеха в различных сферах. Кроме того, они обычно обладают сильным чувством справедливости и могут выступать в защиту тех, кто находится в беде или нуждается в помощи. Влияние Каштана также придает им стабильность и надежность в отношениях с окружающими, делая их заслуженно уважаемыми членами общества. Люди этого знака обычно стремятся к самореализации и готовы преодолевать любые трудности на пути к своим целям.",
            image:
            kashtan,
        }
        ,
        cypress: {
            ru: "Кипарис",
            en:
                "cypress",
            description:
                "Кипарис – символ стойкости и глубокой мудрости в друидском гороскопе. Люди, рожденные под этим знаком, обладают сильным характером и устойчивостью к жизненным испытаниям. Они как кипарисы, стоят непоколебимо, преодолевая любые трудности с достоинством и силой. Люди этого знака обладают способностью к преобразованию и росту даже в самых сложных ситуациях. Они готовы принять перемены как неотъемлемую часть своего жизненного пути и использовать их в своих интересах. Кипарисы обладают глубокой мудростью и интуицией, что помогает им принимать мудрые решения и извлекать уроки из прошлого опыта. Они могут служить источником поддержки и советов для окружающих благодаря своей способности видеть дальше поверхностных явлений и анализировать ситуации с умом. Символически, Кипарис также ассоциируется с защитой и надежностью. Люди этого знака обычно являются надежными и преданными друзьями, готовыми оказать поддержку и защиту своим близким в любых обстоятельствах. В друидской астрологии Кипарис также считается символом гармонии и равновесия. Представители этого знака стремятся к гармонии внутри себя и в своих отношениях с миром, стремясь к душевному и эмоциональному благополучию.",
            image:
            kiparis,
        }
        ,
        maple: {
            ru: "Клен",
            en:
                "maple",
            description:
                "Клен – символ гороскопа Друидов, представляющий собой символ стойкости, гибкости и преображения. Люди, рожденные под этим знаком, обладают сильным характером и готовностью адаптироваться к переменам. Они подобны клену, который меняет свою окраску с изменением сезонов, и они также способны адаптироваться к новым обстоятельствам. Клены обладают творческим мышлением и способностью находить новые пути решения проблем. Они стремятся к гармонии и красоте во всем, что делают, и способны преобразовывать свое окружение своей энергией и вдохновением. Однако иногда клены могут быть слишком изменчивыми и иметь трудности с принятием окончательных решений. Для достижения баланса им важно научиться находить стабильность внутри себя и доверять своей интуиции в процессе принятия решений.",
            image:
            klen,
        }
        ,
        linden: {
            ru: "Липа",
            en:
                "linden",
            description:
                "Липа – символ гармонии и равновесия в друидском гороскопе. Люди, рожденные под этим знаком, обладают мирным и уравновешенным характером, стремясь к гармонии в своей жизни и отношениях с окружающим миром. Липы символизируют мудрость и духовное познание. Люди этого знака обычно обладают глубоким пониманием жизни и ее тайн, стремясь к духовному совершенствованию и самопознанию. Они могут быть источником вдохновения и мудрых советов для окружающих благодаря своей мудрости и интуиции. Люди этого знака обычно обладают добрым и отзывчивым сердцем, готовым помогать другим и делиться своей любовью и заботой. Они могут быть надежными друзьями и заботливыми партнерами, готовыми поддержать и защитить тех, кто им нуждается. Символически, Липа также ассоциируется с ростом и процветанием. Представители этого знака стремятся к постоянному развитию и личностному росту, стремясь к достижению своего полного потенциала и гармонии с собой и миром вокруг. Они готовы принимать перемену как неотъемлемую часть своего жизненного пути и использовать ее в своих интересах.",
            image:
            lipa,
        }
        ,
        olive: {
            ru: "Маслина",
            en:
                "olive",
            description:
                "Люди, рожденные под этим знаком, обладают спокойствием и уравновешенностью, как само дерево маслины, символизирующее мудрость и долголетие. Они обладают сильным внутренним миром и глубокими эмоциями, но при этом остаются стойкими и надежными в сложных ситуациях. Люди Маслины часто проявляют терпение и выдержку, стремясь к гармонии и миру вокруг себя. Их умение прислушиваться к своей интуиции и анализировать ситуации помогает им принимать мудрые решения. Они ценят красоту и гармонию в жизни, склонны к изучению искусства и философии. Люди этого знака способны принимать жизненные вызовы с достоинством и спокойствием, всегда оставаясь верными своим принципам и ценностям. В отношениях они преданы и заботливы, стремясь к гармонии и взаимопониманию.",
            image:
            maslina,
        }
        ,
        walnut: {
            ru: "Орех",
            en:
                "walnut",
            description:
                "Знак Ореха в друидическом гороскопе символизирует глубокую мудрость и крепость духа. Люди, рожденные под этим знаком, обладают сильным характером и часто являются непоколебимыми лидерами. Они обладают уникальной способностью видеть скрытые аспекты ситуаций и понимать тайны мира. Орех представляет также стойкость и устойчивость: его корни крепко укоренены в земле, что символизирует связь с предками и традициями. Люди, рожденные под этим знаком, обычно обладают высокими нравственными принципами и стремятся к гармонии с окружающим миром. Они могут быть терпеливыми и внимательными слушателями, часто выступая в роли советчиков и наставников для других. Жизненная сила и энергия Ореха дают людям этого знака силу преодолевать трудности и достигать своих целей.",
            image:
            oreh,
        }
        ,
        hazelnut: {
            ru: "Орешник",
            en:
                "hazelnut",
            description:
                "Орешник – символ гороскопа Друидов, представляющий собой силу, упорство и рост. Люди, рожденные под этим знаком, обладают выдающейся целеустремленностью и готовы преодолевать любые препятствия на пути к своим целям. Как орешки, они тверды снаружи, но у них также есть мягкое, уязвимое ядро, которое они защищают с осторожностью. Орешники часто отличаются проницательным умом и умением принимать решения в сложных ситуациях. Они стремятся к гармонии и справедливости, готовы выступать в защиту слабых и бороться за свои убеждения. Однако иногда они могут проявлять упрямство и неуступчивость, что может вызывать конфликты во взаимоотношениях. Чтобы достичь успеха, орешники должны научиться находить баланс между своей амбициозностью и готовностью к сотрудничеству с другими.",
            image:
            oreshnik,
        }
        ,
        spruce: {
            ru: "Пихта",
            en:
                "spruce",
            description:
                "В гороскопе друидов Пихта символизирует мудрость, долговечность и защиту. Люди, рожденные под этим знаком, обладают глубокими знаниями и стойким характером. Они часто выделяются своей мудростью и способностью давать дельные советы окружающим. Пихты обычно обладают уверенностью и надежностью. Они способны создавать надежные фундаменты для себя и своих близких, обеспечивая защиту и стабильность. Их умение принимать мудрые решения помогает им руководить ситуацией и вести других за собой. Эти люди часто являются опорой для своего окружения и общества. Они стремятся к защите традиций и ценностей, принимая на себя роль хранителей мудрости предков. Их способность к пониманию глубоких аспектов жизни делает их ценными советниками и наставниками для других. Однако иногда Пихтам не хватает гибкости и открытости к новым идеям. Их склонность к консервативности иногда может мешать им адаптироваться к изменяющимся условиям и использовать новые возможности. Пихтам нужно научиться быть более гибкими и открытыми к новым возможностям, чтобы успешно адаптироваться к современным реалиям и развиваться.",
            image:
            pihta,
        }
        ,
        mountain_ash: {
            ru: "Рябина",
            en:
                "mountain_ash",
            description:
                "Рябина – символ гороскопа Друидов, представляющий собой символ защиты, прозорливости и вдохновения. Люди, рожденные под этим знаком, обладают сильным чувством ответственности и заботы о других. Они как рябина, оберегают своих близких и помогают им преодолевать трудности. Рябины обычно обладают острым умом и интуицией, что помогает им видеть скрытые аспекты ситуаций и принимать правильные решения. Они способны вдохновлять окружающих своей мудростью и добротой, являясь источником поддержки и вдохновения для тех, кто их окружает. Однако иногда рябины могут быть слишком защитническими и подвержены переживаниям из-за несчастий окружающих. Для достижения баланса им важно научиться уделять внимание собственным потребностям и не забывать о себе в стремлении помогать другим.",
            image:
            ryabina,
        }
        ,
        pine: {
            ru: "Сосна",
            en:
                "pine",
            description:
                "Сосна – символ силы и выносливости в друидском гороскопе. Люди, рожденные под этим знаком, обладают стойким и упорным характером, способным преодолевать любые препятствия на пути к своим целям. Они как сосны, стремятся к высотам и не позволяют никаким трудностям сбить с толку. Люди этого знака обычно обладают глубоким пониманием природных циклов и любовью к окружающей среде. Они могут находить вдохновение и силу в природе, и стремятся сохранять ее красоту и баланс. Сосны также ассоциируются с мудростью и внутренним покоем. Люди этого знака обычно обладают мудрым и спокойным характером, способным находить решения на основе размышлений и самоанализа. Они могут служить источником мудрых советов и поддержки для окружающих благодаря своему внутреннему покою и стабильности. Символически, Сосна также ассоциируется с защитой и надежностью. Представители этого знака обычно являются верными и преданными друзьями, готовыми стать опорой и защитой для тех, кто в них нуждается. В друидской астрологии Сосна также считается символом роста и развития. Люди этого знака стремятся к постоянному самосовершенствованию и личностному росту, стремясь к достижению своего полного потенциала и гармонии с собой и окружающим миром.",
            image:
            sosna,
        }
        ,
        poplar: {
            ru: "Тополь",
            en:
                "poplar",
            description:
                "Тополь – символ гибкости и обновления в друидском гороскопе. Люди, рожденные под этим знаком, обладают подвижным и адаптивным характером, способным легко приспосабливаться к изменяющимся обстоятельствам. Они как тополи, готовы изгибаться под ветром перемен, сохраняя свою силу и устойчивость. Тополи обладают творческим потенциалом и стремлением к самовыражению, умеют находить новые и нестандартные подходы к решению проблем и достижению своих целей. Тополи также ассоциируются с духовным ростом и преображением. Люди этого знака стремятся к развитию своего внутреннего мира и духовному совершенствованию. Они могут проходить через периоды личностного роста и преображения, становясь сильнее и мудрее с каждым новым этапом своего пути. Символически, Тополь также ассоциируется с благополучием и защитой. Представители этого знака обычно окружены заботой и поддержкой своих близких, а также обладают способностью обеспечивать комфорт и безопасность для себя и дорогих им людей. В друидской астрологии Тополь также считается символом жизненной силы и энергии. Люди этого знака обычно обладают живым и энергичным характером, способным вдохновлять и мотивировать окружающих своим оптимизмом и жизненной энергией.",
            image:
            topol,
        }
        ,
        apple_tree: {
            ru: "Яблоня",
            en:
                "apple_tree",
            description:
                "Яблоня – это знак гороскопа Друидов, символизирующий любовь, красоту и плодородие. Люди, рожденные под этим знаком, отличаются мягкостью характера, добротой и щедростью. Яблони стремятся к гармонии и миру во всем, что их окружает. Они ценят стабильность и безопасность, как в личной жизни, так и в профессиональной сфере, часто являются хранителями семейных традиций и ценностей, передавая их из поколения в поколение. Они умеют слушать и понимать других, что делает их отличными посредниками и советчиками. В общении они проявляют терпимость и уважение к мнению окружающих, избегая конфликтов и недоразумений. Профессионально Яблони часто выбирают области, связанные с заботой о других, такие как медицина, образование или социальная работа. Они также хорошо проявляют себя в творческих профессиях, где могут реализовать свою тягу к красоте и эстетике. Их трудолюбие и ответственность помогают им достигать успехов в выбранной сфере.",
            image:
            yablonya,
        }
        ,
        elm: {
            ru: "Вяз",
            en:
                "elm",
            description:
                "Знак Вяз в друидском гороскопе символизирует глубокую связь с природой и внутреннюю мудрость. Люди, рожденные под этим знаком, обычно обладают спокойным и уравновешенным характером. Они могут проводить много времени в одиночестве, наслаждаясь природой и медитируя, чтобы обрести внутренний покой и ясность мысли. Вязы обладают сильным интуитивным восприятием и могут предчувствовать будущее. Они обычно следуют своей внутренней мудрости и интуиции в принятии решений, часто принимая правильные и мудрые выборы. Символически, Вяз также ассоциируется с упорством и выносливостью. Люди этого знака готовы преодолевать трудности и препятствия на пути к достижению своих целей. Они могут быть целеустремленными и настойчивыми в достижении успеха, невзирая на сложности. В друидской астрологии Вяз также считается символом преданности и защиты. Представители этого знака обычно готовы отстаивать своих близких и помогать им в трудные моменты. Они часто являются надежными друзьями и партнерами, готовыми поддержать и защитить своих близких в любых обстоятельствах.",
            image:
            vyaz,
        }
        ,
        ash: {
            ru: "Ясень",
            en:
                "ash",
            description:
                "Ясень в друидическом гороскопе представляет собой символ мудрости, гармонии и прозрения. Люди, рожденные под этим знаком, обладают глубоким интеллектом и часто являются мыслителями и философами. Они обладают уникальной способностью видеть глубже обычного и понимать скрытые аспекты жизни. Ясеневые люди стремятся к гармонии во всем, как внутри себя, так и в своих отношениях с окружающими. Они могут быть дипломатичными и толерантными, способными находить компромиссы и решать конфликты мирным путем. Влияние Ясеня также придает им силу воли и стойкость, что помогает им преодолевать трудности и достигать своих целей. Люди этого знака обычно ценят знания и образование, стремятся к саморазвитию и духовному росту. Они могут быть вдумчивыми и задумчивыми, но в то же время открытыми для новых идей и опыта. В отношениях они часто являются надежными и преданными партнерами, способными на долгосрочные и глубокие связи.",
            image:
            yasen,
        }
        ,
    }
;
