import astra from "@/assets/public/floral/астра.svg";
import besmert from "@/assets/public/floral/бессмертник.svg";
import veresk from "@/assets/public/floral/вереск.svg";
import mimoza from "@/assets/public/floral/Property 1=мимоза.svg";
import podsolnuh from "@/assets/public/floral/Property 1=подссолнух.svg";
import portulak from "@/assets/public/floral/Property 1=портулак.svg";
import roza from "@/assets/public/floral/Property 1=роза.svg";
import romashka from "@/assets/public/floral/Property 1=ромашка.svg";
import oduvanchik from "@/assets/public/floral/Property 1=одуванчик.svg";
import delfinium from "@/assets/public/floral/Property 1=дельфиниум.svg";
import orhidea from "@/assets/public/floral/Property 1=орхидея.svg";
import gvozdika from "@/assets/public/floral/Property 1=гвоздика.svg";
import omela from "@/assets/public/floral/Property 1=омела.svg";
import pion from "@/assets/public/floral/Property 1=пион.svg";
import georgin from "@/assets/public/floral/Property 1=георгин.svg";
import tylpan from "@/assets/public/floral/Property 1=тюльпан.svg";
import gladiolus from "@/assets/public/floral/Property 1=гладиолус.svg";
import magnolia from "@/assets/public/floral/Property 1=магнолия.svg";
import siren from "@/assets/public/floral/Property 1=сирень.svg";
import gorechavka from "@/assets/public/floral/Property 1=горечавка.svg";
import gortenzia from "@/assets/public/floral/Property 1=гортензия.svg";
import kameliya from "@/assets/public/floral/камелия.svg";
import kolokolchik from "@/assets/public/floral/Property 1=колокольчик.svg";
import krasavka from "@/assets/public/floral/Property 1=красавка.svg";
import kuvshinka from "@/assets/public/floral/Property 1=кувшинка.svg";
import landish from "@/assets/public/floral/Property 1=ландыш.svg";
import lilia from "@/assets/public/floral/Property 1=лилия.svg";
import lotos from "@/assets/public/floral/Property 1=лотус.svg";
import mak from "@/assets/public/floral/Property 1=мак.svg";
import margaritka from "@/assets/public/floral/Property 1=маргаритка.svg";
import naperstyanka from "@/assets/public/floral/Property 1=наперстянка.svg";
import fialka from "@/assets/public/floral/Property 1=фиалка.svg";
import frezia from "@/assets/public/floral/Property 1=фрезия.svg";
import chertopoloh from "@/assets/public/floral/Property 1=чертополох.svg";
import shipovnik from "@/assets/public/floral/Property 1=шиповник.svg";
import edelveis from "@/assets/public/floral/Property 1=эдельвейс.svg";

export const floralSigns = {
    aster: {
        ru: "Астра",
        en: "aster",
        description:
            "Астра в цветочном гороскопе символизирует загадочность, возвышенность и гармонию. Люди, рожденные под этим знаком, обладают тонким восприятием мира. Они, как астры, восхищают своими таинственными качествами и способностью проникать в глубины человеческой души. Люди этого знака часто обладают креативным мышлением и умением видеть красоту в самых необычных вещах. Астры могут проявлять себя в различных сферах искусства или дизайна, стремясь выразить свои чувства и эмоции через творчество. Эти люди готовы исследовать тайны мира и стремятся к самопознанию и духовному развитию. Астры обычно обладают тонким чувством юмора и умеют поднять настроение окружающим своей легкостью и оптимизмом. Важной чертой этого знака является их способность к восприятию красоты в простых моментах жизни. Они умеют находить радость и вдохновение в окружающем мире и стремятся к тому, чтобы их жизнь отражала эти качества. Астры обычно ценят гармонию и покой и стремятся к созданию спокойной и умиротворенной атмосферы в своей жизни.",
        image: astra,
    },
    immortelle: {
        ru: "Бессмертник",
        en: "immortelle",
        description:
            "Люди, рожденные под этим знаком, обладают уникальной выносливостью и стойкостью. Как и само растение, символизирующее долголетие и жизненную силу, они умеют преодолевать трудности и сохранять оптимизм в любой ситуации. Их отличает внутренний свет и способность вдохновлять окружающих. Люди Бессмертника часто проявляют необыкновенную жизненную энергию и энтузиазм. Они активны, целеустремленны и настойчивы в достижении своих целей. Их природное обаяние и доброжелательность привлекают людей, делая их душой компании. Они умеют поддерживать гармонию и мир вокруг себя. В отношениях люди этого знака преданы и заботливы, всегда готовы поддержать своих близких в трудную минуту. Их искренность и открытость делают их надежными друзьями и партнерами. Они ценят честность и прямоту, предпочитая честные и глубокие связи. Несмотря на внешнюю силу и энергию, люди Бессмертника могут быть чувствительными и ранимыми. Им важно ощущать признание и поддержку со стороны близких. Они стремятся к гармонии и стабильности в жизни, умея находить радость в простых вещах и дарить ее другим.",
        image: besmert,
    },
    heather: {
        ru: "Вереск",
        en: "heather",
        description:
            "Вереск в цветочном гороскопе символизирует силу духа, выносливость и самоутверждение. Люди, рожденные под этим знаком, обладают стойкостью, уверенны в себе, могут преодолевать любые трудности. Они, как вереск, расцветают среди невзгод, даря окружающим надежду и оптимизм. Люди этого знака – целеустремленные и решительные в достижении своих целей. Они часто обладают харизмой и обаянием, знают, как привлечь к себе внимание окружающих, умеют вдохновлять и мотивировать других, распространяя свою энергию и уверенность. Вереск обладает тонким чувством эстетики и может находить красоту в самых обычных вещах, делая свою жизнь полной ярких красок и впечатлений. Важной чертой этого знака является способность к самовыражению и творчеству. Они ценят красоту и изысканность во всех ее проявлениях и стремятся к тому, чтобы их жизнь отражала эти качества. Вереск обычно обладает изысканным вкусом и чувством стиля, умеет создать уют и красоту в своем доме и в своих отношениях.",
        image: veresk,
    },
    mimosa: {
        ru: "Мимоза",
        en: "mimosa",
        description:
            "Люди, рожденные под этим знаком, отличаются чувствительностью и ранимостью, как и само растение мимоза, известное своей нежной природой. Они обладают тонкой душевной организацией и высокой эмоциональной восприимчивостью, что делает их очень чуткими к настроениям и эмоциям окружающих. Люди Мимозы часто проявляют доброту и сострадание, стремясь помочь тем, кто нуждается в поддержке. Их природная деликатность и тактичность позволяют им избегать конфликтов и находить подход к самым разным людям. Они ценят гармонию и мир в отношениях, всегда стремясь к взаимопониманию и согласию. В профессиональной сфере люди этого знака могут проявлять творческие способности и интуицию, что делает их отличными художниками, музыкантами или писателями. В личных отношениях люди Мимозы преданны и заботливы, всегда стремятся создать атмосферу любви и комфорта для своих близких. Однако из-за своей чувствительности они могут легко обидеться и нуждаются в поддержке и понимании со стороны партнеров. Их доброта и искренность делают их незаменимыми друзьями и верными партнерами, готовыми поддерживать и вдохновлять своих близких в любой ситуации.",
        image: mimoza,
    },
    sunflower: {
        ru: "Подсолнух",
        en: "sunflower",
        description:
            "Подсолнух в цветочном гороскопе символизирует радость, оптимизм и солнечность. Люди, рожденные под этим знаком, обладают яркой энергией и жизнелюбием, способны поднять настроение окружающим. Они, как подсолнухи, всегда стремятся к свету и источают тепло и радость своим присутствием. Люди этого знака обычно харизматичны и обладают позитивным отношением к жизни. Они умеют видеть светлые стороны в любой ситуации и готовы идти вперед с уверенностью и оптимизмом. Подсолнухи обладают способностью вдохновлять и мотивировать других, распространяя на них свою энергию и радость. Эти люди обычно имеют открытый и дружелюбный характер, ценят дружбу и общение с людьми, готовы поддержать и помочь своим близким и друзьям в любой ситуации. Подсолнухи обладают чувством справедливости и готовы бороться за свои убеждения, подобно тому, как подсолнухи всегда поворачиваются к солнцу. Важной чертой этого знака является способность к творчеству и самовыражению. Они могут проявлять себя в различных сферах искусства или науки, стремясь выразить свои мысли и чувства через творчество. Подсолнухи обычно ценят красоту во всех ее проявлениях и умеют находить вдохновение в окружающем мире.",
        image: podsolnuh,
    },
    portulaca: {
        ru: "Портулак",
        en: "portulaca",
        description:
            "Портулак в цветочном гороскопе символизирует оптимизм и радость. Люди, рожденные под этим знаком, обладают необычайной жизненной энергией и способностью преодолевать любые трудности. Люди этого знака обычно отличаются оптимизмом и позитивным отношением к жизни. Они верят в себя и в свои силы, всегда находя способы преодолеть препятствия и достичь поставленных целей. Портулаки обладают огромной силой воли и упорством, которые помогают им не унывать даже в самые сложные времена. Эти люди часто являются источником вдохновения и мотивации для окружающих, умеют поддержать и поднять настроение своим примером. Они могут быть энергичными лидерами, готовыми вести других к успеху и достижению общих целей. Портулаки также обладают яркими творческими способностями и могут проявлять себя в различных сферах искусства или науки. Важной чертой этого знака является их способность к адаптации и гибкости. Они легко приспосабливаются к новым обстоятельствам и быстро находят решения в любой ситуации. Портулаки обладают хорошим чувством юмора и умеют видеть светлую сторону жизни, что делает их приятными собеседниками и компаньонами.",
        image: portulak,
    },
    rose: {
        ru: "Роза",
        en: "rose",
        description:
            "Роза в цветочном гороскопе – символ красоты, страсти и элегантности. Люди, рожденные под этим знаком, обладают изысканным вкусом и утонченным чувством стиля. Они, как розы, привлекают внимание своей аристократичностью, создавая вокруг себя атмосферу роскоши и романтики. Люди этого знака – сильные и уверенные в себе личности. Они готовы преодолевать трудности и добиваться успеха в своих начинаниях, несмотря на препятствия. Розы обладают изысканным вкусом и могут проявлять себя в различных сферах искусства или бизнеса, стремясь к достижению высоких результатов. Эти люди часто обладают харизмой и обаянием, способны привлечь к себе внимание окружающих. Розы могут находить красоту в самых обыденных вещах, делая свою жизнь полной ярких красок и впечатлений. Важной чертой этого знака является способность к самовыражению и творчеству. Они ценят красоту и элегантность во всех ее проявлениях и стремятся к тому, чтобы их жизнь отражала эти качества. Розы обычно обладают изысканным вкусом и чувством стиля.",
        image: roza,
    },
    chamomile: {
        ru: "Ромашка",
        en: "chamomile",
        description:
            "Ромашка в цветочном гороскопе символизирует нежность, искренность и чистоту сердца. Люди, рожденные под этим знаком, обладают добротой и состраданием к окружающим, излучают тепло и доброту, готовы оказать поддержку и помощь тем, кто в ней нуждается. Они часто становятся надежными друзьями и верными союзниками, готовыми поддержать в трудную минуту и поделиться своей радостью в хорошие времена. Ромашки ценят простоту и искренность в отношениях, стремятся к гармонии и миролюбию. Эти люди обычно обладают мягким и спокойным нравом, умеют находить общий язык с разными людьми и избегают конфликтов, предпочитая разрешать разногласия мирным путем. Ромашки — тонкие эмпаты и часто становятся опорой для тех, кто испытывает болезнь или горе. Важной чертой этого знака является его способность к восприятию красоты в простых вещах и событиях. Ромашки ценят каждый момент жизни и умеют находить радость в мелочах. Они обладают хорошим чувством юмора и умеют делиться своей радостью с окружающими.",
        image: romashka,
    },
    dandelion: {
        ru: "Одуванчик",
        en: "dandelion",
        description:
            "Одуванчик в цветочном гороскопе символизирует оптимизм, жизнерадостность и способность преодолевать трудности. Люди, рожденные под этим знаком, обладают легкостью и непосредственностью, часто привносят радость в жизнь окружающих. Они, как одуванчики, расцветают даже среди неблагоприятных условий, даря окружающим свою энергию и оптимизм. Люди этого знака умеют видеть позитив в любой ситуации и могут вдохновлять других своим примером. Одуванчики обладают тонким чувством юмора и способны поднять настроение даже в самые серые дни. Эти люди часто спонтанны, любят приключения. Они готовы идти вперед, несмотря ни на что, и исследовать новые горизонты. Одуванчики ценят свободу и независимость, стремясь к самовыражению и самореализации в различных сферах жизни. Важной чертой этого знака является способность к адаптации и выживанию. Они умеют находить выход из любой ситуации.",
        image: oduvanchik,
    },
    delphinium: {
        ru: "Дельфиниум",
        en: "delphinium",
        description:
            "Дельфиниум в цветочном гороскопе символизирует гармонию, возвышенность и вдохновение. Люди, рожденные под этим знаком, обладают изысканным вкусом и тонким эстетическим восприятием. Они, как дельфиниумы, изящны и красивы, вдохновляют окружающих своей элегантностью и утонченностью. Люди этого знака обычно имеют гармоничный и спокойный характер, ценят красоту и изящество во всех ее проявлениях и стремятся к созданию уютной и эстетически привлекательной обстановки в своем окружении. Дельфиниумы обладают изысканным вкусом и могут проявлять себя в различных сферах искусства или дизайна, стремясь выразить свои чувства и эмоции через творчество. Они могут быть идеалистами и борцами за права человека, стремясь к созданию лучшего мира для всех. Дельфиниумы обычно обладают тонким чувством юмора и умеют находить радость в малых вещах, что делает их приятными компаньонами и собеседниками. Важной чертой этого знака является способность к восприятию красоты в простых моментах жизни. Они умеют находить радость и вдохновение в окружающем мире и стремятся к тому, чтобы их жизнь отражала эти качества. Дельфиниумы обычно ценят гармонию и покой и стремятся к созданию спокойной и умиротворенной атмосферы в своей жизни.",
        image: delfinium,
    },
    orchid: {
        ru: "Орхидея",
        en: "orchid",
        description:
            "Орхидея в цветочном гороскопе символизирует изысканность, загадочность и элегантность. Люди, рожденные под этим знаком, обладают утонченным вкусом и тонким эстетическим восприятием. Они, как орхидеи, привлекают внимание своей красотой и аристократичностью, создавая атмосферу загадки и роскоши. Люди этого знака часто обладают харизмой и обаянием, способными привлечь к себе внимание окружающих. Они могут быть прекрасными компаньонами и собеседниками, способными разделить свои мысли и чувства с окружающими. Орхидеи обладают тонким чувством эстетики и могут находить красоту в самых обычных вещах, делая свою жизнь полной ярких красок и впечатлений. Эти люди обычно имеют изысканный стиль и стремятся к созданию прекрасного во всех сферах жизни. Они ценят красоту и изысканность во всех ее проявлениях и стремятся к тому, чтобы их жизнь отражала эти качества. Орхидеи обладают тонким чувством эмпатии и могут легко почувствовать настроение и эмоции окружающих.Важной чертой этого знака является их способность к самовыражению и творчеству. Они стремятся к тому, чтобы их жизнь была наполнена красотой и гармонией, и делают все возможное, чтобы достичь этого. Орхидеи обычно ценят уют и красоту в своем доме и в своих отношениях, создавая идеальную обстановку для себя и своих близких.",
        image: orhidea,
    },
    carnation: {
        ru: "Гвоздика",
        en: "carnation",
        description:
            "Гвоздика в цветочном гороскопе символизирует стойкость, утонченность и изысканность. Люди, рожденные под этим знаком, обладают сильным духом и элегантным стилем. Они, как гвоздики, выделяются своей изящностью и утонченностью, знают, как притягивать внимание и вдохновлять окружающих своим обаянием. Люди этого знака обычно имеют сильную волю и решительность в достижении своих целей. Эти люди часто обладают харизмой и обаянием, способны привлечь к себе внимание окружающих. Они умеют создавать гармонию в отношениях и быть центром внимания в любой компании. Гвоздики обладают тонким чувством эстетики и могут находить красоту в самых обыденных вещах, делая свою жизнь полной ярких красок и впечатлений. Важной чертой этого знака является их способность к самовыражению и творчеству. Они ценят красоту и изысканность во всех ее проявлениях, обладают изысканным вкусом и чувством стиля, способны создать уют и красоту в своем доме и в своих отношениях.",
        image: gvozdika,
    },
    mistletoe: {
        ru: "Омела",
        en: "mistletoe",
        description:
            "Люди, рожденные под этим знаком, обладают магнетизмом и загадочностью, как и само растение, символизирующее мистику и чары. Они часто обладают сильной интуицией и могут легко читать эмоции и намерения окружающих, что делает их отличными советчиками и психологами. Люди Омелы выделяются своим обаянием и умением находить общий язык с самыми разными людьми. Они часто становятся центром внимания благодаря своей харизме и внутреннему свету. Их природное обаяние и дипломатичность помогают им избегать конфликтов и сглаживать острые углы в общении. В личных отношениях люди этого знака проявляют нежность и заботу, стремятся к глубокому эмоциональному контакту. Они ценят искренность и открытость, предпочитая честные и доверительные отношения. Омелы умеют поддерживать своих близких и дарить им чувство защищенности и комфорта. Несмотря на свою внешнюю мягкость, люди Омелы могут быть весьма решительными и целеустремленными, когда дело касается их целей и убеждений. Их способность видеть суть вещей и проникать в глубину ситуаций помогает им принимать взвешенные и мудрые решения. Внутренняя сила и устойчивость людей Омелы делают их надежными друзьями и партнерами, которые всегда готовы прийти на помощь и поддержать в трудную минуту.",
        image: omela,
    },
    peony: {
        ru: "Пион",
        en: "peony",
        description:
            "Пион в цветочном гороскопе символизирует изобилие, состоятельность и благополучие. Люди, рожденные под этим знаком, обладают теплотой и добротой, способными создавать гармонию и уют вокруг себя. Они, как пионы, расцветают в обществе, даря своим близким и окружающим свет и тепло. Люди этого знака обычно обладают стабильным характером и чувством ответственности. Они готовы поддержать своих близких в трудные моменты и стремятся к созданию уютной и благоприятной обстановки в семье и дома. Пионы обладают изысканным вкусом и могут проявлять себя в различных сферах искусства или дизайна, стремясь к выражению своей индивидуальности и креативности. Эти люди обычно ценят гармонию и покой и стремятся к созданию спокойной и умиротворенной атмосферы в своей жизни. Они готовы поддержать своих близких в трудные моменты и делают все возможное, чтобы обеспечить им комфорт и благополучие. Пионы обладают тонким чувством эмпатии и могут легко почувствовать настроение и эмоции окружающих. Важной чертой этого знака является их способность к самовыражению и творчеству",
        image: pion,
    },
    dahlia: {
        ru: "Георгин",
        en: "dahlia",
        description:
            "Георгины в цветочном гороскопе символизируют стойкость, прочность и элегантность. Люди, рожденные под этим знаком, обладают сильным характером, высокой степенью самодисциплины и решительностью в достижении своих целей, могут преодолевать трудности с достоинством и уверенностью. Они стремятся к совершенству во всем, что делают, и готовы вкладывать в это все свои усилия. Георгины также отличаются своей элегантностью и изысканным вкусом. Они ценят красоту и гармонию в окружающем мире и стремятся к тому, чтобы их жизнь отражала эти качества. Георгины также обладают теплым и добрым сердцем, готовы помогать другим в трудные моменты, поддерживать своих близких и защищать их интересы. Важной чертой георгинов является их умение находить радость и красоту в мелочах. Они ценят каждый момент жизни и стараются делать его особенным и запоминающимся. Георгины обладают тонким чувством юмора и умеют делиться своей радостью с окружающими. Они стремятся к гармонии в отношениях и умеют создавать атмосферу взаимопонимания и уважения.",
        image: georgin,
    },
    tulip: {
        ru: "Тюльпан",
        en: "tulip",
        description:
            "Тюльпан в цветочном гороскопе символизирует элегантность, изысканность и чувство прекрасного. Люди, рожденные под этим знаком, обладают прекрасным вкусом и тонким чувством стиля. Они, как тюльпаны, привлекают внимание своей красотой и грацией, умело подчеркивая свою уникальность. Люди этого знака часто обладают харизмой и обаянием, умеют привлечь к себе внимание окружающих. Они обычно ценят красоту во всех ее проявлениях и стремятся к гармонии и изяществу в своей жизни. Тюльпаны обладают творческим потенциалом и могут проявлять себя в различных сферах искусства или дизайна. Эти люди обычно обладают сильным характером и решительностью в достижении своих целей. Они умеют выделяться из толпы и преуспевать благодаря своей целеустремленности и настойчивости. Тюльпаны также обладают отличными организаторскими способностями и часто занимают лидирующие позиции в своей области деятельности. Важной чертой этого знака является способность к восприятию красоты в различных формах и проявлениях. Они ценят эстетику и гармонию в окружающем мире и стремятся к тому, чтобы их жизнь отражала эти качества. Тюльпаны обычно имеют хороший вкус и чувство стиля, способны создавать уют и красоту в своем доме и в своих отношениях.",
        image: tylpan,
    },
    gladiolus: {
        ru: "Гладиолус",
        en: "gladiolus",
        description:
            "Гладиолус в цветочном гороскопе символизирует силу, стойкость и стремление к достижению целей. Люди, рожденные под этим знаком, уверенны и решительны, способны преодолевать любые препятствия на пути к успеху. Они, как гладиолусы, возвышаются над трудностями, достигая больших высот. Люди этого знака обычно имеют сильный характер и четкие жизненные принципы. Они готовы добиваться своих целей, несмотря ни на что, и стремятся к достижению лучших результатов во всем, что они делают. Эти люди часто являются лидерами и источником вдохновения для окружающих. Они способны мотивировать и поддерживать других, помогая им раскрыть потенциал и достичь целей. Гладиолусы обладают тонким чувством справедливости и могут стать защитниками тех, кто нуждается в помощи. Важной чертой этого знака является настойчивость и целеустремленность. Они готовы работать упорно, чтобы достичь успеха, и не останавливаются на достигнутом. Гладиолусы ценят силу и выносливость, как в физическом, так и в духовном плане, и стремятся к постоянному развитию и самосовершенствованию.",
        image: gladiolus,
    },
    magnolia: {
        ru: "Магнолия",
        en: "magnolia",
        description:
            "Знак Магнолия в цветочном гороскопе символизирует изысканность, чувственность и гармонию. Люди, рожденные под этим знаком, обладают тонким вкусом и чувством красоты. Они обожают искусство и музыку, стремятся к эстетическому совершенству во всем. Магнолии умеют создавать уют и гармонию вокруг себя, они ценят красоту не только в природе, но и в окружающем мире. Эти люди обладают изысканным вкусом и могут быть талантливыми дизайнерами или художниками. Они нежны и чутки, имеют глубокий внутренний мир и стремятся к духовному развитию. Магнолии часто вдохновляют окружающих своим утонченным вкусом и чувством прекрасного. Люди, рожденные под знаком Магнолии, обладают уникальным обаянием и способностью приносить свет и радость в жизнь других. Они стремятся к гармонии во всех сферах своей жизни и способны создавать прекрасные отношения с окружающими благодаря своей эмпатии и заботе.",
        image: magnolia,
    },
    lilac: {
        ru: "Сирень",
        en: "lilac",
        description:
            "Сирень в цветочном гороскопе символизирует нежность, таинственность и загадочность. Люди, рожденные под этим знаком, обладают деликатностью и чувственностью, способны проникнуть в самые глубины души. Люди этого знака обычно имеют изысканный вкус и тонкое чувство красоты, отличаются умением создавать мистическую атмосферу вокруг себя. Они ценят эстетику и изящество во всех проявлениях, обладают тонким восприятием мира и могут проявлять себя в различных сферах искусства или дизайна, стремясь выразить свои чувства и эмоции через творчество. Эти люди часто имеют глубокий внутренний мир. Они могут быть интуитивными и вдохновленными, способными разгадать загадки жизни и обрести внутренний покой. Сирени обычно обладают утонченным чувством юмора и могут привнести свойственную им легкость и веселость в любую ситуацию. Важной чертой этого знака является способность к самовыражению и творчеству. Они ценят красоту и гармонию во всех ее проявлениях и стремятся к тому, чтобы их жизнь отражала эти качества.",
        image: siren,
    },
    gentian: {
        ru: "Горечавка желтая",
        en: "gentian",
        description:
            "Люди, рожденные под этим знаком, отличаются уникальной стойкостью и целеустремленностью. Горечавка, символизирующая выносливость и надежду, отражает их способность преодолевать жизненные трудности с упорством и оптимизмом. Они обладают глубоким внутренним миром, часто проявляют интуицию и чувствительность к окружающим. Люди Горечавки Желтой стремятся к справедливости и честности, нередко выступая за права других и поддерживая тех, кто нуждается в помощи. Их природная мудрость и умение анализировать ситуацию делают их отличными советчиками и надежными друзьями. Они ценят искренность и открытость, как в личных, так и в профессиональных отношениях. Несмотря на внешнюю стойкость, люди этого знака могут быть эмоциональными и нуждаются в поддержке близких. Их преданность и верность делают их незаменимыми партнерами в любви и дружбе. Люди Горечавки Желтой находят радость в помощи другим и стремятся к гармонии и миру вокруг себя.",
        image: gorechavka,
    },
    hydrangea: {
        ru: "Гортензия",
        en: "hydrangea",
        description:
            "Гортензия в цветочном гороскопе символизирует изобилие, душевное богатство и гармонию. Люди, рожденные под этим знаком, обладают яркими эмоциями и тонким восприятием мира вокруг. Они часто олицетворяют красоту и изящество, стремясь к гармонии внутри себя и в своих отношениях с окружающими. Гортензии обладают творческим потенциалом и часто проявляют себя в искусстве, литературе или музыке. Они умеют находить красоту в мелочах и ценят каждый момент жизни. Люди этого знака обладают сильным чувством справедливости и могут стать отличными защитниками слабых. Они преданы своим идеалам и стремятся к их осуществлению, проявляя высокий уровень эмпатии и заботы о других. Гортензии способны приносить радость и уют в свои отношения, создавая атмосферу взаимопонимания и поддержки.Гортензии обладают непревзойденным чувством стиля и умением привносить красоту в свой облик и окружающую обстановку. Они стремятся к гармонии и балансу в жизни, умело сочетая материальное благополучие с духовным развитием.",
        image: gortenzia,
    },
    camellia: {
        ru: "Камелия",
        en: "camellia",
        description:
            "Камелия в цветочном гороскопе символизирует изысканность, грацию и загадочность. Люди, рожденные под этим знаком, обладают утонченным вкусом и чувством стиля. Они, как камелии, притягивают внимание своей элегантностью и изяществом, создавая атмосферу роскоши и романтики. Люди этого знака часто являются центром внимания в любой компании и умеют создавать гармонию в отношениях. Камелии могут проявлять себя в различных сферах искусства или бизнеса, стремясь к достижению высоких результатов. У Камелии гармоничный характер, они прекрасные компаньоны и собеседники, способные разделить свои мысли и чувства с окружающими. Важной чертой этого знака является способность к восприятию красоты в простых моментах жизни. Они умеют находить радость и вдохновение в окружающем мире и стремятся к тому, чтобы их жизнь отражала эти качества. Камелии обычно ценят гармонию и покой и стремятся к созданию спокойной и умиротворенной атмосферы в своей жизни.",
        image: kameliya,
    },
    bellflower: {
        ru: "Колокольчик",
        en: "bellflower",
        description:
            "Колокольчики в цветочном гороскопе символизируют нежность, скромность и изящество. Люди, рожденные под этим знаком, — обладатели глубокого внутреннего мира. Они, как колокольчики, расцветают непритязательно, но своей красотой и милым обаянием способны очаровать окружающих. Колокольчики обычно излучают нежность и мягкость как в своих поступках, так и в своем общении с другими. Они склонны к сдержанности и избегают конфликтных ситуаций, предпочитая сохранять мир и гармонию в отношениях. Люди этого знака обычно добры и отзывчивы, готовы прийти на помощь тем, кто в ней нуждается, не ожидая ничего взамен. Одной из важных черт этого знака является творческий потенциал и чувство прекрасного. Колокольчики могут проявлять себя в искусстве, музыке или литературе, стремясь выразить свои эмоции и внутренний мир через творчество. Они ценят красоту во всех ее проявлениях и умеют создавать гармонию в своем окружении. Люди этого знака обычно обладают глубоким внутренним миром и часто проводят время в одиночестве, наслаждаясь своей компанией и богатым внутренним миром. Они могут быть мечтателями и романтиками, ценящими тишину и уединение. Колокольчики часто обладают хорошим чувством юмора и умеют поднять настроение окружающим своей легкостью и оптимизмом.",
        image: kolokolchik,
    },
    foxglove: {
        ru: "Красавка",
        en: "foxglove",
        description:
            "Люди, рожденные под этим знаком, обладают особым магнетизмом и притягательностью. Как и само растение красавка, они таинственны и загадочны, что делает их чрезвычайно интересными для окружающих. Эти люди часто наделены природным обаянием и привлекательностью, способны очаровывать и привлекать внимание. Люди Красавки обладают сильной интуицией и чувствительностью. Они способны проникать в суть вещей и понимать скрытые мотивы окружающих. Их аналитический ум и проницательность делают их отличными стратегами. В профессиональной сфере они часто проявляют себя как талантливые и креативные личности, способные находить нестандартные решения. В личных отношениях люди этого знака преданы и глубоко эмоциональны. Они стремятся к глубоким и насыщенным связям, ценя искренность и доверие. Их партнеры могут рассчитывать на поддержку и понимание, ведь Красавки умеют создавать атмосферу уюта и тепла. Они готовы бороться за справедливость и свои идеалы, проявляя удивительную стойкость и выдержку. Их внутренний мир богат и многогранен, что делает их интересными собеседниками и верными друзьями.",
        image: krasavka,
    },
    buttercup: {
        ru: "Кувшинка",
        en: "buttercup",
        description:
            "Кувшинка в цветочном гороскопе символизирует нежность, чистоту и надежность. Люди, рожденные под этим знаком, обладают деликатным нравом и утонченным восприятием окружающего мира. Они как кувшинки, раскрывают свою красоту и привлекательность, создавая атмосферу умиротворения и спокойствия. Люди этого знака обычно отличаются нежностью и состраданием к окружающим. Они готовы прийти на помощь тем, кто в ней нуждается, не ожидая ничего взамен. Кувшинки обладают теплым сердцем и способностью внимательно слушать и понимать других, что делает их отличными друзьями и надежными союзниками. Эти люди обычно имеют мягкий и дружелюбный характер, обладают развитым чувством эстетики и могут быть талантливыми художниками или дизайнерами. Важной чертой этого знака является способность к восприятию красоты в простых моментах жизни. Они умеют находить радость в мелочах и ценят каждый момент, стремясь сделать его особенным и запоминающимся. Кувшинки обладают тонким чувством юмора и умеют поднять настроение окружающим своей легкостью и оптимизмом.",
        image: kuvshinka,
    },
    lily_of_the_valley: {
        ru: "Ландыш",
        en: "lily_of_the_valley",
        description:
            "Ландыши в цветочном гороскопе олицетворяют нежность, чистоту и возвышенность. Люди, рожденные под этим знаком, обладают деликатным нравом и тонким восприятием красоты. Ландыши умеют приспосабливаться и выживать в любых условиях, расцветая даже в самых суровых и непригодных для жизни местах. Люди этого знака обычно отличаются мягкими, интуитивными натурами, которые часто обращаются к своему внутреннему миру для нахождения вдохновения и решений. Они могут быть глубоко эмоциональными и чувственными, стремясь к гармонии в своих отношениях. Ландыши обладают изысканным вкусом и чувством стиля, ценят красоту во всех ее проявлениях. Они обычно очень заботятся о благополучии своих близких. Ландыши ценят глубокие эмоциональные связи и готовы отдавать себя полностью тем, кто находится рядом с ними. В жизни они часто идут по внутреннему голосу и интуиции, что помогает им обнаружить свое истинное предназначение и принимать правильные решения.",
        image: landish,
    },
    lily: {
        ru: "Лилия",
        en: "lily",
        description:
            "Лилия – это знак цветочного гороскопа, символизирующий нежность, чистоту и изящество. Люди, рожденные под этим знаком, обладают утонченным вкусом, развитым чувством прекрасного и природной элегантностью. Они притягивают внимание своей обаятельностью и внутренним светом, часто становясь центром внимания в обществе. Лилии отличаются высокой чувствительностью и эмпатией, умеют сопереживать и поддерживать других. Они тонко ощущают настроения и эмоции окружающих, что делает их отличными советчиками и верными друзьями. В то же время, эти люди могут быть скрытными и загадочными, не всегда раскрывая свои истинные чувства и мысли. Они предпочитают держать часть своей души в тайне, что добавляет им очарования и таинственности. В профессиональной сфере Лилии часто тянутся к искусству и творчеству, где могут реализовать свои таланты и обогатить мир красотой. Они могут быть успешными художниками, дизайнерами, музыкантами или писателями. В личной жизни Лилии ищут глубокие и искренние отношения. Они готовы отдавать много тепла и заботы своим близким, ожидая взамен такой же искренности и любви.",
        image: lilia,
    },
    lotus: {
        ru: "Лотос",
        en: "lotus",
        description:
            "Лотос в цветочном гороскопе символизирует чистоту и духовное просветление. Люди, рожденные под этим знаком, обладают глубокой мудростью и способностью видеть красоту в душе. Они, как лотосы, возвышаются над повседневными заботами, стремясь к духовному совершенству и гармонии. Люди этого знака обычно имеют уравновешенный характер и спокойную натуру. Они готовы идти своим путем, несмотря на трудности, и стремятся к самопознанию и развитию, освобождению от материальных уз и обретению внутреннего покоя. Эти люди способны вдохновлять и мотивировать других к духовному росту и самопознанию. Лотосы обладают тонким чувством эмпатии и могут легко почувствовать настроение и эмоции окружающих. Важной чертой этого знака является способность к глубокому пониманию жизненных истин и духовных ценностей. Лотосы ценят моменты покоя и медитации, стремясь к гармонии с собой и миром.",
        image: lotos,
    },
    poppy: {
        ru: "Мак",
        en: "poppy",
        description:
            "Люди, рожденные под этим знаком, обладают яркой индивидуальностью и притягательностью, как и само растение мак, известное своей красотой и изяществом. Они излучают жизненную энергию и оптимизм, что делает их центром внимания в любой компании. Люди Мака отличаются сильным характером и уверенностью в себе. В профессиональной сфере они проявляют себя как талантливые и креативные специалисты, способные вдохновлять и вести за собой других. В личных отношениях люди этого знака страстны и эмоциональны. Они отдаются чувствам без остатка, стремясь к глубоким и насыщенным связям. Однако из-за своей страстной натуры они могут быть ревнивы и требовательны, нуждаясь в постоянном подтверждении чувств. Люди Мака любят быть в центре внимания и часто оказываются душой компании. Их искренность и открытость привлекают к ним людей, и они легко заводят новые знакомства. Несмотря на внешнюю жизнерадостность, люди Мака могут быть чувствительными и уязвимыми. Им важно ощущать поддержку и понимание со стороны близких. Их внутренняя сила и оптимизм помогают им справляться с жизненными трудностями и находить радость в каждом дне.",
        image: mak,
    },
    daisy: {
        ru: "Маргаритка",
        en: "daisy",
        description:
            "Маргаритка в цветочном гороскопе символизирует простоту, нежность и чистоту сердца. Люди, рожденные под этим знаком, обладают добротой и чувством сострадания к окружающим. Они как маргаритки, раскрывают свою красоту без притязательности, принося радость и уют своим близким и друзьям. Люди этого знака обычно отличаются скромностью и простотой, стремясь к гармонии в своих отношениях и окружении. Они ценят искренность и доброту в людях, часто проявляя свою заботу и внимание к другим. Маргаритки обладают теплым сердцем и готовностью прийти на помощь, когда это необходимо. Эти люди обычно имеют мягкий и дружелюбный характер, стремятся к миру и гармонии в своей жизни, избегая конфликтов и раздоров. Маргаритки также обладают развитым чувством сострадания и могут стать опорой для тех, кто нуждается в поддержке и понимании. Важной чертой этого знака является способность к нахождению радости в простых моментах жизни. Они ценят каждый момент и умеют находить красоту и удовлетворение в мелочах. Маргаритки обладают легким чувством юмора и умеют делиться своей радостью с окружающими.",
        image: margaritka,
    },
    digitalis: {
        ru: "Наперстянка",
        en: "digitalis",
        description:
            "Люди, рожденные под этим знаком, обладают уникальной способностью преодолевать трудности и препятствия на своем пути. Наперстянки обычно очень практичные и рациональные, привержены здравому смыслу и логике. Они умеют видеть суть вещей и принимать обдуманные решения, основанные на фактах и анализе. Однако за этой серьезной и сдержанной внешностью Наперстянок скрывается теплое и доброе сердце. Они ценят близкие отношения и глубокие эмоциональные связи с семьей и друзьями, всегда готовы прийти на помощь тем, кто в них нуждается. В любви Наперстянки проявляются как верные и преданные партнеры, готовые поддержать своего возлюбленного в любых жизненных ситуациях. Они ценят стабильность и надежность в отношениях, стремясь создать крепкую и долговечную семейную жизнь. В профессиональной сфере Наперстянки проявляют себя как трудолюбивые и целеустремленные работники. Они часто выбирают карьеру, связанную с практичными навыками и реальными результатами, такие как инженерия, архитектура, финансы или управление. Они готовы вкладывать много усилий в свою работу, чтобы достичь поставленных целей и обеспечить себе и своим близким комфортное будущее.",
        image: naperstyanka,
    },
    violet: {
        ru: "Фиалка",
        en: "violet",
        description:
            "Фиалка в цветочном гороскопе символизирует нежность, скромность и чувствительность. Люди, рожденные под этим знаком, обладают глубокой эмпатией к окружающим. Они, подобно фиалкам, расцветают невзрачно, но притягивают внимание своей неподдельной и душевной красотой. Люди этого знака обычно скромны и уклончивы, предпочитают избегать конфликтов и лишних споров. Они ценят гармонию в отношениях и стремятся к созданию спокойной и уютной атмосферы вокруг себя. Фиалки обладают невероятной глубиной души и способны видеть красоту даже в малейших деталях. Эти люди обычно имеют мягкий и добрый характер, часто становятся опорой для тех, кто испытывает болезнь или горе, готовы выслушать и поддержать своих близких в трудные моменты. Фиалки обладают развитым чувством сострадания и готовы помочь тем, кто в них нуждается. Важной чертой этого знака является способность к творчеству и самовыражению. Они могут проявлять себя в различных сферах искусства или литературы, находя в этом удовлетворение и радость. Фиалки обычно ценят гармонию и красоту во всех ее проявлениях и стремятся к созданию утонченной и изысканной атмосферы в своей жизни.",
        image: fialka,
    },
    freesia: {
        ru: "Фрезия",
        en: "freesia",
        description:
            "Фрезия в цветочном гороскопе символизирует изысканность, чувственность и изящество. Люди, рожденные под этим знаком, как фрезии, притягивают внимание своей элегантностью и гармонией, создавая атмосферу романтики и красоты. Фрезии обладают тонким чувством эстетики и могут проявлять себя в различных сферах искусства или дизайна, стремясь к выражению своей индивидуальности и креативности. Эти люди обычно обладают харизмой и обаянием, способны привлечь к себе внимание окружающих. Они могут быть прекрасными компаньонами и собеседниками, поддержать беседу на различные темы и поделиться своими мыслями и чувствами. Фрезии – высококлассные эмпаты, умеют легко чувствовать настроение и эмоции окружающих. Важной чертой этого знака является способность к самовыражению и творчеству. Они стремятся к тому, чтобы их жизнь была наполнена эстетикой и гармонией, и делают все возможное, чтобы достичь этого. Фрезии обычно ценят уют и красоту в своем доме и в своих отношениях, создавая идеальную обстановку для себя и своих близких.",
        image: frezia,
    },
    thistle: {
        ru: "Чертополох",
        en: "thistle",
        description:
            "Люди, рожденные под этим знаком, обладают уникальной внутренней силой и стойкостью. Как и сам чертополох, они умеют защищаться от жизненных невзгод и сохранять оптимизм даже в трудные времена. Их отличает независимость и умение постоять за себя, что делает их непреклонными в достижении своих целей. Люди Чертополоха часто проявляют решительность и инициативу, не боятся брать на себя ответственность и действовать в сложных ситуациях. Их уверенность в себе и природное обаяние привлекают окружающих, делая их настоящими лидерами. Они ценят честность и прямоту, предпочитая говорить то, что думают. В отношениях люди этого знака могут быть требовательными, но при этом преданными и надежными партнерами. Они стремятся к глубокой эмоциональной связи и искренности в отношениях. Чертополохи часто проявляют заботу о близких и готовы защищать их интересы. Несмотря на свою внешнюю жесткость, люди Чертополоха обладают тонкой душевной организацией и могут быть чувствительными к критике. Они нуждаются в поддержке и признании своих усилий, что помогает им сохранять баланс и внутреннюю гармонию.",
        image: chertopoloh,
    },
    rose_hip: {
        ru: "Шиповник",
        en: "rose_hip",
        description:
            "Шиповник в цветочном гороскопе символизирует силу, выносливость и жизненную энергию. Люди, рожденные под этим знаком, обладают необузданной страстью к жизни и готовностью преодолевать любые препятствия. Они, как шиповник, являются символом жизненной силы и непоколебимости, несмотря на трудности. Люди этого знака обычно обладают сильным характером и уверенностью в себе. Они целеустремленны и настойчивы, готовы преодолеть любые трудности на пути к успеху. Шиповник обладает неиссякаемой энергией и упорством, что помогает ему добиваться выдающихся результатов в своей деятельности. Эти люди обычно имеют яркую индивидуальность и стремятся к самореализации в различных сферах жизни. Они часто проявляют себя как лидеры и организаторы, способные мотивировать и вдохновлять окружающих своим примером. Шиповник также обладает развитым чувством ответственности и часто берет на себя роль защитника тех, кто в них нуждается. Важной чертой этого знака является способность к адаптации и гибкости. Они легко приспосабливаются к переменам и быстро находят решения в любой ситуации. Шиповник ценит справедливость и готов бороться за свои убеждения, несмотря на препятствия, которые могут встретиться на его пути.",
        image: shipovnik,
    },
    edelweiss: {
        ru: "Эдельвейс",
        en: "edelweiss",
        description:
            "Эдельвейс в цветочном гороскопе символизирует стойкость и духовную силу. Люди, рожденные под этим знаком, обладают яркой индивидуальностью и неповторимым характером, умеют возвышаться над обыденностью. Они, как эдельвейсы, расцветают в самых непредсказуемых условиях, даря своим близким вдохновение и поддержку. Люди этого знака не боятся стоять на своем пути и следовать за своими убеждениями, несмотря на препятствия. Эти люди часто являются лидерами и источником вдохновения для окружающих. Они способны мотивировать и поддерживать других, помогая им раскрыть потенциал и преодолеть страхи. Эдельвейсы обладают тонким чувством эмпатии и могут легко понять чувства и настроение окружающих. Важной чертой этого знака является их способность к самовыражению и творчеству. Они стремятся к тому, чтобы их жизнь была наполнена смыслом и уникальностью, и делают все возможное, чтобы достичь этого. Эдельвейсы ценят свободу и независимость, стремясь к самореализации и самопознанию во всем, что они делают.",
        image: edelveis,
    },
};
