import rat from "@/assets/public/chinese_japanese/Property 1=мышка.svg";
import ox from "@/assets/public/chinese_japanese/Property 1=бык.svg";
import tiger from "@/assets/public/chinese_japanese/Property 1=тигр.svg";
import rabbit from "@/assets/public/chinese_japanese/Property 1=заяц-1.svg";
import dragon from "@/assets/public/chinese_japanese/Property 1=дракон.svg";
import snake from "@/assets/public/chinese_japanese/Property 1=заяц.svg";
import horse from "@/assets/public/chinese_japanese/Property 1=лошадка.svg";
import sheep from "@/assets/public/chinese_japanese/Property 1=овен.svg";
import monkey from "@/assets/public/chinese_japanese/Property 1=обезьян.svg";
import rooster from "@/assets/public/chinese_japanese/Property 1=петух.svg";
import dog from "@/assets/public/chinese_japanese/Property 1=собака.svg";
import pig from "@/assets/public/chinese_japanese/Property 1=свин.svg";

export const japaneseSigns = {
        rat: {
            ru: "Крыса",
            en:
                "rat",
            description:
                "В японском гороскопе Крыса символизирует сообразительность, изобретательность и амбициозность. Люди, рожденные под этим знаком, обычно обладают острым умом и быстрым мышлением, легко находят выход из сложных ситуаций и способны приспособиться к любым изменениям. Крысы обладают большими амбициями и стремятся к достижению высоких целей. Они обычно являются энергичными и настойчивыми личностями, готовыми рисковать и брать на себя ответственность за свои поступки. Крысы часто бывают творчески одаренными и могут проявлять себя в различных областях, таких как искусство, литература или научные исследования. Однако иногда их стремление к успеху и славе может приводить к излишней амбициозности и желанию достичь своих целей любой ценой. Для Крыс важно научиться контролировать свои амбиции и учитывать интересы окружающих. Крысы успешны в профессиях, где требуется интеллект и быстрота ума, таких как наука, бизнес и информационные технологии.",
            image:
            rat,
        }
        ,
        ox: {
            ru: "Бык",
            en:
                "ox",
            description:
                "В японском гороскопе Бык символизирует надежность, стабильность и упорство. Люди, рожденные под этим знаком, обычно обладают твердым и устойчивым характером, они способны преодолевать любые трудности и добиваться поставленных целей методично и настойчиво. Быки обычно являются трудолюбивыми и практичными личностями, готовыми к тому, чтобы засучить рукава и приступить к работе. Они обладают большим чувством ответственности и готовы брать на себя лидерскую роль в семье и обществе. Быки обычно принципиальны и честны в своих отношениях с другими людьми, они ценят надежность и стабильность во всех аспектах жизни. Однако иногда их склонность к консерватизму и недоверию к нововведениям может приводить к недооценке возможностей и упущению шансов на развитие. Быкам нужно учиться быть более открытыми к новым идеям и готовыми к переменам. Быки успешны в профессиях, где требуется стабильность и трудолюбие, таких как финансы, сельское хозяйство и инженерия",
            image:
            ox,
        }
        ,
        tiger: {
            ru: "Тигр",
            en:
                "tiger",
            description:
                "В японском гороскопе Тигр символизирует мощь, силу и стойкость. Люди, рожденные под этим знаком, обычно обладают сильным и независимым характером, готовы смело встречать вызовы жизни и демонстрировать свою решимость в достижении поставленных целей. Тигры обычно являются энергичными и амбициозными личностями, которые не боятся рисковать и брать на себя ответственность за свои поступки. Они обладают выдающимися лидерскими качествами и способны вдохновлять других на достижение высоких результатов. Тиграм также свойственно обостренное чувство справедливости, они готовы защищать слабых и угнетенных. Однако иногда их склонность к авторитаризму может приводить к конфликтам с окружающими. Тиграм важно научиться быть более терпимыми к мнению других людей. Тигры успешны в профессиях, где требуется решимость и упорство, таких как спорт, бизнес и политика.",
            image:
            tiger,
        }
        ,
        rabbit: {
            ru: "Кролик",
            en:
                "rabbit",
            description:
                "В японском гороскопе Кролик символизирует мягкость, чуткость и интуицию. Люди, рожденные под этим знаком, обычно обладают деликатным и чувствительным характером, они способны чувствовать эмоции других людей и поддерживать гармоничные отношения в коллективе. Кролики обычно являются дружелюбными и миролюбивыми личностями, которые предпочитают избегать конфликтов и стремятся к мирному сосуществованию. Они обладают хорошей интуицией и часто полагаются на свое внутреннюю чуйку при принятии решений. Кролики также обладают высокими творческими способностями и могут проявлять себя в различных областях искусства и культуры. Однако иногда их склонность к избеганию конфликтов и стремление к гармонии может приводить к излишней пассивности и нежеланию решать проблемы. Для Кроликов важно научиться быть более уверенными в себе и активно выражать свои мнения и желания. Кролики успешны в профессиях, где требуется чуткость и творческий подход, таких как искусство, психология и образование.",
            image:
            rabbit,
        }
        ,
        dragon: {
            ru: "Дракон",
            en:
                "dragon",
            description:
                "В японском гороскопе Дракон символизирует мощь, благородство и мудрость. Люди, рожденные под этим знаком, обладают сильным характером и стремлением к духовному совершенствованию. Они обычно вдохновляют других своими высокими идеалами и могут играть роль лидера в обществе. Драконы глубоко думают и часто способны предвидеть будущее, что делает их ценными советчиками и наставниками. Они обладают стойкостью и решимостью в достижении своих целей, и их сила притягивает к себе внимание и уважение. Однако иногда их могущество и власть могут приводить к изоляции от окружающих, поэтому для Драконов важно находить баланс между своими амбициями и социальными связями. Драконы успешны в профессиях, требующих креативности и авторитета, таких как политика, бизнес и искусство.",
            image:
            dragon,
        }
        ,
        snake: {
            ru: "Змея",
            en:
                "snake",
            description:
                "В японском гороскопе Змея символизирует мудрость, интуицию и тайны. Люди, рожденные под этим знаком, обычно обладают тонким чувством интуиции и глубоким пониманием мира. Они способны проникать в тайны и раскрывать скрытые аспекты жизни. Змеи могут быть загадочными и мистическими, они обычно предпочитают держать свои мысли и чувства в секрете, что делает их интригующими и притягательными личностями. Они обладают тонким чувством красоты и гармонии и могут проявлять себя как творческие души, стремящиеся к созданию искусства и красоты в мире. Однако иногда их склонность к загадкам и секретам может приводить к недопониманию и дистанцированию от окружающих. Змеям нужно научиться находить баланс между своей интуицией и открытостью к общению с другими. Змеи успешны в профессиях, где требуется аналитический склад ума и интеллектуальные способности, таких как научные исследования, психология и философия.",
            image:
            snake,
        }
        ,
        horse: {
            ru: "Лошадь",
            en:
                "horse",
            description:
                "В японском гороскопе Лошадь символизирует страсть, свободу и энергию. Люди, рожденные под этим знаком, обычно обладают огромным запасом энергии и стремлением к приключениям. Они ценят свободу и независимость и готовы идти вперед, чтобы исследовать мир и достичь новых высот. Лошади обладают сильным характером и могут преодолевать любые препятствия на пути к своим целям. Они часто выделяются в толпе своим дерзким и отважным поведением, что делает их привлекательными и влиятельными личностями. Однако иногда их стремление к приключениям и свободе может привести к неосторожным поступкам и рискованным решениям. Лошадям важно научиться контролировать свою энергию и принимать более обдуманные решения. Лошади успешны в профессиях, требующих активности и предпринимательского духа, таких как спорт, путешествия и медиабизнес.",
            image:
            horse,
        }
        ,
        goat: {
            ru: "Коза",
            en:
                "goat",
            description:
                "В японском гороскопе Коза символизирует красоту, гармонию и мечтательность. Люди, рожденные под этим знаком, обладают изысканным вкусом и чувством стиля, они ценят красоту во всех ее проявлениях. Козы обычно являются творческими душами, стремящимися к самовыражению и самореализации. Они могут быть вдохновленными художниками, музыкантами или поэтами, и создают произведения искусства, которые приносят радость и вдохновение другим. Козы также обладают утонченным чувством гармонии и могут находить радость в простых удовольствиях жизни, таких как прогулки на природе или медитация. Однако иногда их мечтательность и стремление к гармонии может привести к отрыву от реальности и избеганию проблем. Для них важно научиться находить баланс между мечтами и действиями, чтобы достичь своих целей. Козы успешны в профессиях, где требуется креативность и воображение, таких как дизайн, мода и музыка.",
            image:
            sheep,
        }
        ,
        monkey: {
            ru: "Обезьяна",
            en:
                "monkey",
            description:
                "В японском гороскопе Обезьяна символизирует остроумие и беспечность. Люди, рожденные под этим знаком, обычно обладают быстрым умом и отличным чувством юмора. Они способны быстро адаптироваться к проблемам и находить выход из сложных ситуаций. Обезьяны могут быть обаятельными и веселыми, они умеют заставлять окружающих смеяться и создавать атмосферу радости и веселья вокруг себя. Они обладают большим запасом энергии и могут быть очень активными и энергичными. Однако иногда их беспечный нрав и стремление к развлечениям могут приводить к необдуманным поступкам и забыванию о последствиях. Обезьянам необходимо учиться быть более ответственными и серьезными в своих поступках, чтобы избежать конфликтов и проблем. Обезьяны успешны в профессиях, где требуется быстрота ума и коммуникативные навыки, таких как медиа, развлекательная индустрия и образование.",
            image:
            monkey,
        }
        ,
        rooster: {
            ru: "Петух",
            en:
                "rooster",
            description:
                "В японском гороскопе Петух символизирует честность, решимость и доблесть. Люди, рожденные под этим знаком, обычно обладают прямолинейным и честным характером, они всегда говорят правду и стоят за свои убеждения. Петухи могут быть очень целеустремленными и настойчивыми в достижении желаемого, они готовы преодолевать любые трудности на пути к успеху. Они обладают высокими моральными принципами и стремятся к справедливости во всех сферах жизни. Петухи обычно являются отважными и решительными личностями, готовыми защищать свои убеждения и бороться за правду. Они могут быть бодрыми и энергичными, всегда готовыми взять на себя ответственность и руководство. Однако иногда их прямолинейность и желание быть всегда правыми может приводить к конфликтам с окружающими. Для Петухов важно научиться быть более терпимыми и уважительными к точке зрения других людей. Петухи успешны в профессиях, где требуется смелость и решительность, таких как правоохранительные органы, политика и военная служба.",
            image:
            rooster,
        }
        ,
        dog: {
            ru: "Собака",
            en:
                "dog",
            description:
                "В японском гороскопе Собака символизирует верность, преданность и дружелюбие. Люди, рожденные под этим знаком, обычно обладают надежным и добросовестным характером, они всегда готовы помочь и поддержать своих друзей и близких. Собаки обычно являются верными и преданными партнерами, готовыми отдать всю свою любовь и заботу своим близким. Они обладают высокими моральными принципами и всегда следуют своим убеждениям, не поддаваясь на влияние внешних факторов. Собаки могут быть очень дружелюбными и общительными, они легко находят общий язык с людьми и умеют создавать теплую и дружественную атмосферу вокруг себя. Они обладают сильным чувством справедливости и готовы защищать слабых и уязвимых. Однако иногда их чувство долга и ответственности может приводить к излишней серьезности и замкнутости. Собакам важно научиться расслабляться и находить равновесие между работой и отдыхом. Собаки успешны в профессиях, где требуется честность и надежность, таких как медицина, образование и социальная работа.",
            image:
            dog,
        }
        ,
        boar: {
            ru: "Кабан",
            en:
                "boar",
            description:
                "В японском гороскопе Кабан символизирует силу, стойкость и надежность. Люди, рожденные под этим знаком, обычно обладают мощным физическим и эмоциональным здоровьем, они готовы преодолевать любые трудности и испытания на своем пути. Кабаны обладают высокой степенью выносливости и упорства, они неустанны в достижении своих целей и готовы трудиться на благо своей семьи и близких. Это надежные и ответственные лидеры, способные принимать решения в сложных ситуациях и вести людей к успеху. Кабаны обладают большим чувством справедливости и честности, они всегда следуют своим принципам и готовы защищать слабых и уязвимых. Однако иногда их склонность к самоуверенности и упрямству может приводить к конфликтам с окружающими. Для Кабанов важно научиться быть более гибкими и открытыми к чужому мнению. Кабаны успешны в профессиях, где требуется сила воли и решительность, таких как военная служба, строительство и управление.",
            image:
            pig,
        }
        ,
    }
;
