import zemlya from "@/assets/public/maya/Property 1=земля.svg";
import kremen from "@/assets/public/maya/Property 1=камень.svg";
import burya from "@/assets/public/maya/Property 1=ураган.svg";
import solnze from "@/assets/public/maya/Property 1=солнце.svg";
import krokodil from "@/assets/public/maya/Property 1=кроко.svg";
import veter from "@/assets/public/maya/Property 1=ветер.svg";
import noch from "@/assets/public/maya/Property 1=ночь.svg";
import zmeya from "@/assets/public/maya/Property 1=змей.svg";
import cherep from "@/assets/public/maya/Property 1=череп.svg";
import olen from "@/assets/public/maya/Property 1=олень.svg";
import zvezda from "@/assets/public/maya/Property 1=звезда.svg";
import voda from "@/assets/public/maya/Property 1=вода.svg";
import sobaka from "@/assets/public/maya/Property 1=собака.svg";
import obezyana from "@/assets/public/maya/Property 1=обезьяна.svg";
import trostnik from "@/assets/public/maya/Property 1=трава.svg";
import yaguar from "@/assets/public/maya/ягуар.svg";
import lestnica from "@/assets/public/maya/лестница.svg";
import zerno from "@/assets/public/maya/зерно.svg";
import grif from "@/assets/public/maya/грифон.svg";
import orel from "@/assets/public/maya/орел.svg";

export const mayaSigns = {
    eagle: {
        ru: "Орел (Мен)",
        en: "eagle",
        description: "Знак Орел в гороскопе Майя, также известный как Мен, обладает сильным характером и властным духом. Люди, рожденные под этим знаком, обычно обладают выдающимися лидерскими качествами и стремятся к достижению высоких целей. Они умеют мобилизовать окружающих и вдохновлять на подвиги. Личности знака Орел обычно амбициозны, решительны и непоколебимы в своих убеждениях. Они готовы преодолевать любые препятствия на пути к своим целям и не останавливаются до тех пор, пока не достигнут успеха. Знак Орел также символизирует свободу и независимость, часто его представители стремятся к самореализации и свободе от ограничений. Однако иногда они могут быть немного самоуверенными и несколько властными, что может вызывать конфликты в отношениях. Знак Орел призван вдохновлять и возглавлять, олицетворяя силу и решимость в достижении целей.",
        image: orel,
    },
    vulture: {
        ru: "Гриф (Киб)",
        en: "vulture",
        description: "Знак Гриф, известный также как Киб в гороскопе Майя, характеризуется глубоким интеллектом и стремлением к духовному развитию. Люди, рожденные под этим знаком, обычно обладают острым умом, тонким чувством интуиции и глубокой мудростью. Они часто оригинальны в своих мыслях и подходах к жизни, способны видеть вещи с необычной точки зрения и находить нестандартные решения проблем. Такие личности обычно стремятся к саморазвитию и самосовершенствованию, уделяют много внимания духовным практикам и поиску глубокого смысла жизни. Они могут быть вдумчивыми и медитативными, часто предпочитают уединение для размышлений и внутреннего роста. Взгляды знака Гриф могут быть прогрессивными и даже немного эксцентричными, но это лишь отражает их стремление к новаторству и открытости к новым идеям. Они часто выступают в качестве менторов и вдохновителей, способных помочь окружающим раскрыть свой потенциал и найти свой жизненный путь.",
        image: grif,
    },
    earth: {
        ru: "Земля (Кабан)",
        en: "earth",
        description: "Знак Земля, известный также как Кабан в гороскопе Майя, характеризуется надежностью, практичностью и стабильностью. Люди, рожденные под этим знаком, обычно обладают прочным характером и уверенным взглядом на жизнь. Они часто отличаются трудолюбием, умением работать на результат и стремлением к достижению материальной стабильности. Личности знака Земля обычно ценят комфорт и уют, умеют создавать гармоничную обстановку вокруг себя и заботятся о благополучии своих близких. Они могут быть прагматичными и реалистичными, предпочитая основывать свои решения на здравом смысле и опыте. Люди этого знака также могут быть немного консервативными и преданно придерживаться традиций. Однако их надежность и стабильность делают их прекрасными партнерами и друзьями, способными поддержать в трудные времена и быть опорой для окружающих. Знак Земля символизирует прочный фундамент и устойчивость, что делает его незаменимым элементом в коллективе и в жизни в целом.",
        image: zemlya,
    },
    flint: {
        ru: "Кремень (Эцнаб)",
        en: "flint",
        description: "Знак Кремень, или Эцнаб, в гороскопе Майя характеризуется страстью, энергией и интенсивностью. Люди, рожденные под этим знаком, обычно обладают яркой индивидуальностью и эмоциональностью. Они могут быть страстными в своих увлечениях и стремлениях, часто проявляя амбиции и решимость в достижении своих целей. Личности знака Кремень обычно энергичны и динамичны, имеют склонность к приключениям и новым возможностям. Они не боятся рисковать и идти против течения, стремясь к самореализации и успеху. Однако иногда их страсть и энергия могут приводить к импульсивным решениям и необдуманным поступкам. Люди этого знака могут быть немного непредсказуемыми, но их энтузиазм и живость делают их привлекательными для окружающих. Знак Кремень также символизирует перемену и преображение, что подчеркивает их способность к саморазвитию и изменению к лучшему. Знак Кремень приносит в жизнь яркость и энергию, подстегивая к действию и достижению новых вершин.",
        image: kremen,
    },
    storm: {
        ru: "Буря (Кауак)",
        en: "storm",
        description: "Знак Буря, или Кауак, в гороскопе Майя характеризуется силой природы и внутренним преобразованием. Люди, рожденные под этим знаком, обычно обладают необычным обаянием и глубоким внутренним миром. Они могут быть эмоциональными, способными переживать как радостные, так и тяжелые моменты с большой глубиной. Личности знака Буря обычно сильны и устойчивы, готовы преодолевать любые трудности и испытания. Они часто обладают непоколебимой верой в себя и свои возможности, что помогает им преодолевать препятствия на пути к своим целям. Люди этого знака также могут быть немного загадочными и мистическими, часто обращаясь к духовным практикам и медитации для обретения внутреннего покоя и гармонии. Знак Буря символизирует перемену и обновление, что делает его представителей способными к преображению и росту как личностей. Они часто становятся источником вдохновения для окружающих, помогая им преодолевать сложности и находить смысл в жизни.",
        image: burya,
    },
    sun: {
        ru: "Солнце (Ахау)",
        en: "sun",
        description: "Знак Солнце, или Ахау, в гороскопе Майя олицетворяет свет и жизнь. Люди, рожденные под этим знаком, часто обладают яркой энергией и оптимистичным взглядом на жизнь. Они могут быть вдохновляющими и обаятельными, притягивая внимание окружающих своим теплом и доброжелательностью. Личности знака Солнце часто стремятся к самовыражению и самореализации, привнося в мир свой собственный свет и красоту. Они могут быть творческими и вдохновляющими, способными преобразовывать свои мечты в реальность. Люди этого знака обычно ценят гармонию и красоту во всем, стремясь к сбалансированной жизни и гармонии в отношениях. Однако иногда они могут слишком стремиться к вниманию и признанию. Знак Солнце символизирует силу и энергию, которые они приносят в мир, а также свет, который они несут в жизни окружающих, освещая путь к позитивным изменениям и благополучию.",
        image: solnze,
    },
    crocodile: {
        ru: "Крокодил (Имиш)",
        en: "crocodile",
        description: "Знак Крокодил, или Имиш, в гороскопе Майя характеризуется силой, выдержкой и умением приспосабливаться к переменам. Люди, рожденные под этим знаком, обычно обладают стратегическим мышлением и аналитическим умом. Они могут быть выносливыми и решительными, способными преодолевать трудности и достигать поставленных целей. Личности знака Крокодил часто имеют хорошо развитый инстинкт самосохранения и умение быстро адаптироваться к изменяющимся обстоятельствам. Они обычно обладают непререкаемой логикой и умением видеть долгосрочные перспективы, что делает их отличными лидерами и стратегами. Люди этого знака могут быть немного скрытными и осторожными в выражении своих чувств, предпочитая держать свои эмоции под контролем. Однако их умение адаптироваться и находить пути к успеху делает их незаменимыми в трудных ситуациях. Знак Крокодил символизирует силу и выносливость, которые необходимы для преодоления препятствий и достижения целей в жизни.",
        image: krokodil,
    },
    wind: {
        ru: "Ветер (Ик)",
        en: "wind",
        description: "Знак Ветер, или Ик, в гороскопе Майя символизирует свободу, переменчивость и динамичность. Люди, рожденные под этим знаком, часто обладают независимым духом и стремлением к исследованию новых горизонтов. Они могут быть умными и общительными, способными адаптироваться к различным ситуациям и быстро находить общий язык с окружающими. Личности знака Ветер обычно любят свободу и независимость, предпочитая избегать рутины и ограничений. Они могут быть немного непостоянными и изменчивыми в своих интересах, стремясь к разнообразию и новым впечатлениям. Люди этого знака обычно ценят интеллект и образование, стремясь к постоянному саморазвитию и расширению своих горизонтов. Однако иногда их стремление к свободе и приключениям может делать их немного неустойчивыми в отношениях и обязательствах. Знак Ветер символизирует постоянное движение и изменение, что делает его представителей способными к адаптации и развитию в любой сфере жизни.",
        image: veter,
    },
    night: {
        ru: "Ночь (Акбаль)",
        en: "night",
        description: "Знак Ночь, или Акбаль, в гороскопе Майя представляет глубокие тайны, интуицию и внутренний мир. Люди, рожденные под этим знаком, часто обладают глубоким внутренним миром и чувствительной натурой. Они могут быть интуитивными и эмпатичными, способными погружаться в глубины своих мыслей и чувств. Личности знака Ночь обычно обладают хорошо развитым воображением и способностью к творчеству. Они могут быть мистическими и загадочными, привлекая других своей проницательностью. Люди этого знака часто стремятся к самопознанию и пониманию глубин своей души, часто обращаясь к духовным практикам и медитациям. Они могут быть немного сдержанными и закрытыми, предпочитая скрывать свои мысли и чувства от окружающих. Однако их способность видеть за пределы видимого и погружаться в мир мечтаний и фантазий делает их уникальными и привлекательными для окружающих. Знак Ночь символизирует темные тайны и скрытые истины, которые не всегда доступны обычному взгляду, но которые могут пролить свет на глубины человеческой души.",
        image: noch,
    },
    corn: {
        ru: "Зерно (Кан)",
        en: "corn",
        description: "Знак Зерно, или Кан, в гороскопе Майя символизирует плодородие, рост и изобилие. Люди, рожденные под этим знаком, обычно обладают плодовитым умом и способностью к творчеству. Они могут быть практичными и трудолюбивыми, стремясь к достижению конкретных результатов. Личности знака Зерно обычно ценят стабильность и надежность, уделяют много внимания своей семье и близким. Они часто являются хорошими организаторами и умеют эффективно планировать свое время и ресурсы. Люди этого знака также могут быть теплыми и заботливыми, способными создавать уютную и гармоничную атмосферу вокруг себя. Однако иногда их стремление к контролю и порядку может приводить к некоторой степени жесткости или стойкости в своих убеждениях. Знак Зерно символизирует процветание и рост, что делает его представителей способными к достижению успеха и благополучия в различных сферах жизни.",
        image: zerno,
    },
    snake: {
        ru: "Змей (Чик-Чан)",
        en: "snake",
        description: "Знак Змей, или Чик-Чан, в гороскопе Майя символизирует преобразование, перемену и мудрость. Люди, рожденные под этим знаком, обычно обладают глубокими знаниями и способностью к самопреображению. Они могут быть аналитичными и наблюдательными, способными видеть скрытые аспекты ситуаций и разгадывать тайны. Личности знака Змей обычно стремятся к духовному развитию и самосовершенствованию, готовы искать истину и глубинный смысл в жизни. Они могут быть харизматичными и властными, способными вдохновлять и возглавлять других. Люди этого знака обычно обладают сильным интуитивным даром и могут предвидеть будущие события. Однако иногда их стремление к контролю и власти может приводить к конфликтам или напряженным отношениям. Знак Змей символизирует перемену и преобразование, что делает его представителей способными к приспособлению и росту в различных сферах жизни. Они могут преодолевать любые препятствия и преобразовывать трудности в возможности для личностного роста и развития.",
        image: zmeya,
    },
    scull: {
        ru: "Череп (Кими)",
        en: "scull",
        description: "Знак Череп, или Кими, в гороскопе Майя символизирует цикличность, перерождение и преодоление смерти. Люди, рожденные под этим знаком, обычно обладают глубокими мыслями и способностью к самопреображению. Это интроверты, которые стремятся к пониманию глубин своего внутреннего мира. Личности знака Череп обычно обладают сильной интуицией и чувствительностью, способны видеть скрытые аспекты жизни и разгадывать тайны Вселенной. Они могут быть творческими и креативными, проявляя свою душевную глубину через искусство и самовыражение. Люди этого знака обычно ценят духовность и внутренний рост, стремятся к преодолению своих страхов и ограничений. Однако иногда их склонность к саморефлексии может приводить к переживанию эмоциональных кризисов или душевных бурь. Знак Череп символизирует цикличность жизни и смерти, что делает его представителей способными к принятию перемен и перерождению. Они могут находить смысл в изменениях и видеть в них возможности для личностного развития и духовного роста.",
        image: cherep,
    },
    deer: {
        ru: "Олень (Маник)",
        en: "deer",
        description: "Знак Олень, или Маник, в гороскопе Майя символизирует гармонию, доброту и внутренний покой. Люди, рожденные под этим знаком, обычно обладают мягким характером и способностью к эмпатии. Они могут быть чуткими и заботливыми, готовыми помогать другим и распространять свет и доброту вокруг себя. Личности знака Олень часто стремятся к гармонии и балансу в своей жизни, уделяя внимание как духовному, так и физическому благополучию. Они обычно обладают хорошими коммуникативными навыками и способностью находить общий язык с разными людьми. Представители знака Олень также могут быть творческими и вдохновленными, стремясь к красоте и гармонии в искусстве и жизни в целом. Однако иногда их склонность к компромиссам и избеганию конфликтов может приводить к недооцениванию их собственных нужд и желаний. Знак Олень символизирует спокойствие и мудрость, что делает его представителей способными к принятию изменений. Они могут быть опорой и вдохновением для окружающих, помогая им обрести внутренний покой и равновесие.",
        image: olen,
    },
    star: {
        ru: "Звезда (Ламат)",
        en: "star",
        description: "Знак Звезда, или Ламат, в гороскопе Майя символизирует свет и яркость, благополучие и радость. Люди, рожденные под этим знаком, обычно обладают яркой личностью и способностью привлекать внимание окружающих. Они могут быть оптимистичными и веселыми, распространяя свет и радость вокруг себя. Личности знака Звезда обычно стремятся к достижению своих целей с энтузиазмом и решимостью, часто привлекая успех и процветание. Они обычно обладают хорошими коммуникативными навыками и способностью находить общий язык с разными людьми. Представители этого знака также могут быть творческими и вдохновленными, стремясь к красоте и гармонии в жизни и искусстве. Однако иногда их склонность к излишней экстравагантности и стремлению к внешнему блеску может затмить их внутреннюю глубину. Знак Звезда символизирует благополучие и светлое будущее, что делает его представителей способными к достижению успеха с яркостью и великолепием. Они могут стать источником вдохновения для окружающих, помогая им верить в себя и идти к своим мечтам.",
        image: zvezda,
    },
    water: {
        ru: "Вода (Мулук)",
        en: "water",
        description: "Знак Вода, или Мулук, в гороскопе Майя символизирует эмоциональность, гибкость и поток чувств. Люди, рожденные под этим знаком, обычно обладают глубокой эмпатией и чувствительностью к окружающим. Они могут быть интуитивными и вдумчивыми, часто прислушиваясь к своим внутренним ощущениям и инстинктам. Личности знака Вода обычно способны приспосабливаться к различным ситуациям и изменениям, подобно течению реки, готовы принимать жизненные вызовы и находить пути к преодолению трудностей. Это креативные люди с хорошим воображением, которые самовыражаются и проявляют свою эмоциональность через искусство. Люди этого знака также могут быть немного мечтательными и впечатлительными, стремясь к гармонии и красоте в мире. Однако иногда их эмоциональная уязвимость может делать их чувствительными к внешним воздействиям и конфликтам. Знак Вода символизирует поток чувств и эмоций, что делает его представителей способными к пониманию и поддержке других. Они могут стать опорой для окружающих и помочь им проявить свою внутреннюю силу и мудрость.",
        image: voda,
    },
    dog: {
        ru: "Собака (Ок)",
        en: "dog",
        description: "Знак Собака, или Ок, в гороскопе Майя символизирует верность, преданность и защиту. Люди, рожденные под этим знаком, часто обладают дружелюбным и открытым характером, готовы помогать и поддерживать своих близких. Они могут быть надежными и ответственными, стремясь к тому, чтобы быть опорой и поддержкой для своего окружения. Личности знака Собака обычно ценят честность и правдивость, готовы выступить в защиту своих убеждений и бороться за справедливость. Они могут быть также искренними и доброжелательными, готовыми поддержать друзей и близких в трудные моменты. Люди этого знака также могут проявлять склонность к самопожертвованию, готовы отдать все ради благополучия других. Однако иногда их преданность и верность могут привести к излишней наивности или уязвимости перед недобросовестными людьми. Знак Собака символизирует дружбу и защиту, что делает его представителей надежными и ценными членами общества. Они могут быть опорой для окружающих и помогать им преодолевать препятствия на пути к своим целям.",
        image: sobaka,
    },
    monkey: {
        ru: "Обезьяна (Чуэн)",
        en: "monkey",
        description: "Знак Обезьяна, или Чуэн, в гороскопе Майя символизирует ловкость, интеллект и игривость. Люди, рожденные под этим знаком, часто обладают острым умом и быстрым мышлением. Они могут быть креативными и изобретательными, способными находить нестандартные решения для различных задач. Личности знака Обезьяна обычно обладают чувством юмора и оптимизмом, что делает их привлекательными для общения и развлечения. Они могут быть общительными и обаятельными, легко завоевывая доверие окружающих. Люди этого знака также обычно ведут активный образ жизни и стремятся к разнообразию и новым впечатлениям. Однако иногда их склонность к шуткам и шалостям может сделать их поверхностными или несерьезными во взглядах на жизнь. Знак Обезьяна символизирует ловкость и интеллект, что делает его представителей способными к преодолению трудностей и достижению успеха в различных сферах жизни. Они могут быть источником вдохновения для окружающих и помочь им расслабиться и насладиться жизнью.",
        image: obezyana,
    },
    ladder: {
        ru: "Лестница (Эб)",
        en: "ladder",
        description: "Знак Лестница, или Эб, в гороскопе Майя символизирует рост, развитие и стремление к самосовершенствованию. Люди, рожденные под этим знаком, часто обладают амбициозным характером и стремлением к достижению новых высот. Они могут быть целеустремленными и настойчивыми, готовыми преодолевать любые трудности на пути к своим целям. Личности знака Лестница обычно обладают хорошими организаторскими способностями и умеют планировать свои действия так, чтобы достичь успеха. Они могут быть также идеалистическими и вдохновленными, стремясь к созданию лучшего мира для себя и других. Люди этого знака обычно ценят образование и самосовершенствование, постоянно расширяя свои знания и навыки. Однако иногда их стремление к достижению целей может делать их слишком амбициозными или чрезмерно критичными к себе и окружающим. Знак Лестница символизирует подъем и развитие, что делает его представителей способными к росту и преобразованию. Они могут стать источником вдохновения для других и помочь им преодолеть трудности на пути к своим мечтам.",
        image: lestnica,
    },
    cane: {
        ru: "Тростник (Бен)",
        en: "cane",
        description: "Знак Тростник, или Бен, в гороскопе Майя символизирует стабильность, поддержку и ресурсность. Люди, рожденные под этим знаком, обычно обладают прочным характером и надежной энергией. Они могут быть твердыми и устойчивыми, как тростник, выдерживающий ветры перемен. Личности знака Тростник обычно являются надежными и ответственными, готовыми прийти на помощь и поддержать своих близких в трудные моменты. Они обладают хорошими организаторскими навыками и умеют находить практичные решения для различных задач. Люди этого знака также могут быть прагматичными и рациональными, стремиться к стабильности и благополучию в своей жизни. Однако иногда их склонность к консерватизму и осторожности мешает им выходить за пределы привычного и искать новые возможности. Знак Тростник символизирует поддержку и защиту, что делает его представителей надежной опорой для окружающих. Они могут быть вдохновением для других, помогая им преодолевать трудности и достигать своих целей.",
        image: trostnik,
    },
    jaguar: {
        ru: "Ягуар (Иш)",
        en: "jaguar",
        description: "Знак Ягуар, или Иш, в гороскопе Майя символизирует мощь, интуицию и загадочность. Люди, рожденные под этим знаком, обычно обладают сильным внутренним духом и чувством независимости. Они могут быть стойкими и решительными, готовыми преодолевать любые препятствия на пути к своим целям. Личности знака Ягуар часто обладают глубокой интуицией и чувствительностью, способны видеть за пределами видимого и улавливать скрытые аспекты ситуаций. Они могут привлекать других своей загадочностью и таинственностью. Люди этого знака обычно обладают сильным лидерским потенциалом и могут вдохновлять и вести других за собой. Однако иногда их склонность к силе и могуществу может делать их слишком авторитарными или доминирующими в отношениях. Знак Ягуар символизирует мощь и силу духа, что делает его представителей способными к преодолению трудностей и достижению целей. Они могут стать источником вдохновения для окружающих и помочь им найти в себе силы для преодоления любых препятствий.",
        image: yaguar,
    },
};
