import bik from "@/assets/public/zoroastrian/Property 1=бык.svg";
import barsuk from "@/assets/public/zoroastrian/Property 1=барсук.svg";
import verblyd from "@/assets/public/zoroastrian/Property 1=верблюд.svg";
import ezh from "@/assets/public/zoroastrian/Property 1=еж.svg";
import lan from "@/assets/public/zoroastrian/лань.svg";
import slon from "@/assets/public/zoroastrian/слон.svg";
import kon from "@/assets/public/zoroastrian/Property 1=лощадь.svg";
import gepard from "@/assets/public/zoroastrian/Property 1=гепард.svg";
import pavlin from "@/assets/public/zoroastrian/Property 1=павлин.svg";
import lebed from "@/assets/public/zoroastrian/Property 1=лебедь.svg";
import ris from "@/assets/public/zoroastrian/Property 1=рысь.svg";
import osel from "@/assets/public/zoroastrian/Property 1=осел.svg";
import beli_medved from "@/assets/public/zoroastrian/Property 1=белый медвед.svg";
import orel from "@/assets/public/zoroastrian/Property 1=орел.svg";
import lisa from "@/assets/public/zoroastrian/лисица.svg";
import delfin from "@/assets/public/zoroastrian/Property 1=дельфин.svg";
import vepr from "@/assets/public/zoroastrian/свин.svg";
import sova from "@/assets/public/zoroastrian/Property 1=сова.svg";
import sokol from "@/assets/public/zoroastrian/Property 1=сокол.svg";
import olen from "@/assets/public/zoroastrian/Property 1=олень.svg";
import baran from "@/assets/public/zoroastrian/баран.svg";
import mangust from "@/assets/public/zoroastrian/мангуст.svg";
import volk from "@/assets/public/zoroastrian/волк.svg";
import aist from "@/assets/public/zoroastrian/Property 1=аист.svg";
import pauk from "@/assets/public/zoroastrian/паук.svg";
import zmeya from "@/assets/public/zoroastrian/Property 1=змей.svg";
import bober from "@/assets/public/zoroastrian/Property 1=бобер.svg";
import cherepaha from "@/assets/public/zoroastrian/Property 1=черепаха.svg";
import soroka from "@/assets/public/zoroastrian/Property 1=сорока.svg";
import belka from "@/assets/public/zoroastrian/Property 1=белка.svg";
import voron from "@/assets/public/zoroastrian/Property 1=ворон.svg";
import petuh from "@/assets/public/zoroastrian/Property 1=петух.svg";

export const zoroastrianSigns = {
    ox: {
        ru: "Бык",
        en: "ox",
        description:
            "В зороастрийском гороскопе Бык символизирует надежность, упорство и стабильность. Люди, рожденные под этим знаком, обладают сильным характером и устойчивостью. Они часто выделяются своей целеустремленностью и способностью работать на результат. Быки обычно обладают практичным взглядом на жизнь и умением решать повседневные задачи. Они предпочитают действовать методично и последовательно, что помогает им достигать поставленных целей. Их стойкость и выдержка делают их надежными партнерами и друзьями. Эти люди часто являются трудягами и толковыми специалистами в своей области. Они готовы вкладывать усилия в свою работу и стремятся к профессиональному совершенству. Их упорство и надежность делают их ценными членами общества, способными вносить значительный вклад в окружающий мир. Однако иногда Быкам не хватает гибкости и открытости к новым идеям. Их склонность к консервативности иногда может мешать им адаптироваться к переменам и использовать новые возможности. Важно для Быков научиться открываться к новым возможностям и принимать изменения как часть жизни. Также важно помнить, что их надежность и стабильность могут стать источником вдохновения для других, помогая им преодолевать трудности и достигать своих целей.",
        image: bik,
    }, badger: {
        ru: "Барсук",
        en: "badger",
        description:
            "В зороастрийском гороскопе Барсук символизирует тайны, скрытые способности и глубинное понимание. Люди, рожденные под этим знаком, обладают загадочной природой и интуитивным пониманием мира. Они часто выделяются своей способностью видеть за пределами поверхностных явлений и раскрывать скрытые аспекты жизни. Барсуки обычно обладают глубоким внутренним миром и тонким чутьем. Они способны разгадывать загадки и раскрывать секреты, которые скрыты от других. Их интуиция и чувствительность делают их непревзойденными наблюдателями и аналитиками. Эти люди часто являются мастерами в области психологии и духовного развития. Они стремятся к самопознанию и пониманию себя и окружающего мира на более глубоком уровне. Их способность к восприятию тонких энергий и ауры делает их ценными советниками и наставниками для окружающих. Однако иногда Барсукам не хватает общительности и коммуникабельности, чтобы успешно взаимодействовать с другими людьми. Их склонность к изоляции и уединению иногда может создавать дистанцию в отношениях с окружающими. Важно для Барсуков научиться открыться и довериться другим, чтобы находить гармонию в отношениях и получать поддержку от близких людей. Также важно помнить, что их интуиция и способность к пониманию глубоких тайн могут стать источником вдохновения для других, помогая им раскрыть свой потенциал и духовное развитие.",
        image: barsuk,
    },
    camel: {
        ru: "Верблюд",
        en: "camel",
        description:
            "В зороастрийском гороскопе Верблюд символизирует выносливость, стойкость и умеренность. Люди, рожденные под этим знаком, обладают способностью переносить трудности и преодолевать препятствия с выдержкой. Они часто выделяются своей устойчивостью и способностью сохранять спокойствие в любых ситуациях. Верблюды обычно обладают практичным взглядом на жизнь и умением рационально оценивать обстоятельства. Они предпочитают действовать осмотрительно и предусмотрительно, что помогает им избегать лишних рисков. Их выносливость и трудолюбие делают их надежными и ответственными партнерами и коллегами. Эти люди часто являются образцом умеренности и самоограничения. Они стремятся к гармонии и балансу в своей жизни, избегая чрезмерной экстравагантности и излишеств. Их способность к самоконтролю и умеренности помогает им достигать стабильности и успеха в различных областях жизни. Однако иногда Верблюдам не хватает гибкости и открытости к новым возможностям. Их склонность к консервативности иногда может мешать им адаптироваться к переменам и использовать новые идеи для решения задач. Важно для Верблюдов научиться проявлять больше гибкости и открытости к изменениям, чтобы успешно адаптироваться к современным реалиям и достигать новых высот в своей жизни. Также важно помнить, что их выносливость и умеренность могут стать источником вдохновения для других, помогая им преодолевать трудности и стремиться к лучшему.",
        image: verblyd,
    },
    hedgehog: {
        ru: "Еж",
        en: "hedgehog",
        description:
            "В зороастрийском гороскопе Еж символизирует осторожность, самозащиту и бдительность. Люди, рожденные под этим знаком, обладают хорошо развитым инстинктом самосохранения и умением защитить себя от опасностей. Они часто выделяются своей бдительностью и осторожностью в принятии решений. Ежи обычно обладают острым умом и умением быстро реагировать на изменения в окружающей среде. Они предпочитают действовать предусмотрительно и избегать потенциальных опасностей, что помогает им сохранять свою безопасность. Их бдительность и готовность к самозащите делают их непревзойденными в решении проблем. Эти люди часто являются мастерами в области анализа и планирования. Они способны предвидеть возможные последствия своих действий и принимать решения на основе обдуманного подхода. Их способность к самозащите и осторожности делает их надежными и защищенными от внешних угроз. Однако иногда Ежам не хватает гибкости и открытости к новым возможностям. Их склонность к изоляции и защите себя иногда может создавать барьеры в отношениях с другими людьми. Важно для Ежей научиться проявлять больше открытости и доверия к окружающим, чтобы создать гармоничные отношения и получить поддержку от близких. Также важно помнить, что их бдительность и осторожность могут стать источником вдохновения для других, помогая им преодолевать трудности и избегать опасностей.",
        image: ezh,
    },
    doe: {
        ru: "Лань",
        en: "doe",
        description:
            "Знак Лань в зороастрийском гороскопе представляет собой символ весны и возрождения. Лань символизирует рост, плодородие и обновление. Люди, рожденные под этим знаком, обычно обладают энергией и живостью, свойственными весеннему времени. Они могут быть энтузиастичными и полными надежд, готовыми к новым начинаниям и свежим возможностям. Личности знака Лань часто стремятся к развитию и росту как личностному, так и профессиональному. Они обычно ценят гармонию с природой и стремятся к равновесию в своей жизни. Люди этого знака также могут быть творческими и вдохновленными, обладая способностью к творчеству и самовыражению. Однако иногда их энергия и стремление к новым начинаниям могут делать их немного непостоянными или непредсказуемыми. Знак Лань символизирует возрождение и обновление, что делает его представителей способными к принятию перемен и к развитию в гармонии с окружающим миром. Они могут быть источником вдохновения и свежих идей для окружающих, помогая им преодолевать затруднения и двигаться вперед в своем развитии.",
        image: lan,
    },
    elephant: {
        ru: "Слон",
        en: "elephant",
        description:
            "В зороастрийском гороскопе знак Слон представляет мудрость, стойкость и сдержанность. Люди, рожденные под этим знаком, часто обладают мудрым и уравновешенным характером, способным принимать обдуманные решения. Они могут быть стойкими и надежными, как слоны, готовыми противостоять трудностям и преодолевать любые препятствия на пути. Личности знака Слон обычно ценят глубокие знания и интеллектуальный рост, стремясь к развитию своего ума и духа. Они могут быть также мудрыми советчиками и добрыми друзьями, готовыми помочь и поддержать своих близких в любой ситуации. Люди этого знака также могут быть творческими и вдохновленными, обладая способностью к творчеству и самовыражению. Однако иногда их склонность к сдержанности и рассудительности может делать их немного слишком консервативными или осторожными в своих действиях. Знак Слон символизирует мудрость и силу, что делает его представителей способными к принятию сложных решений и преодолению трудностей с уверенностью и решимостью. Они могут стать опорой и вдохновением для окружающих, помогая им находить свой путь к мудрости и успеху.",
        image: slon,
    },
    horse: {
        ru: "Конь",
        en: "horse",
        description:
            "КВ зороастрийском гороскопе знак Конь символизирует энергию, свободу и стремление к движению. Люди, рожденные под этим знаком, часто обладают динамичным и энергичным характером, стремясь к достижению своих целей с решимостью и настойчивостью. Они могут быть стремительными и амбициозными, готовыми преодолевать любые препятствия на пути к успеху. Личности знака Конь обычно обладают сильным чувством независимости и свободы, не любят ограничений и стремятся к свободе самовыражения. Они могут быть также исследователями и путешественниками, готовыми исследовать новые горизонты и открывать новые миры. Люди этого знака также могут быть творческими и вдохновленными, обладая способностью к творчеству и самовыражению. Однако иногда их склонность к независимости и стремлению к приключениям может делать их немного непоследовательными или неустойчивыми в своих отношениях. Знак Конь символизирует энергию и движение, что делает его представителей способными к преодолению трудностей и достижению успеха с решимостью и целеустремленностью. Они могут стать источником вдохновения для окружающих, помогая им преодолевать препятствия и двигаться вперед в своем развитии.",
        image: kon,
    },
    cheetah: {
        ru: "Гепард",
        en: "cheetah",
        description:
            "Гепард в зороастрийском гороскопе олицетворяет неутомимость, скорость и стремление к высоким целям. Люди, рожденные под этим знаком, обладают внутренним огнем, который позволяет им преодолевать любые препятствия на пути к успеху. Они часто выделяются своей непоколебимой решимостью и энергией, которая позволяет им достигать значительных результатов в кратчайшие сроки. Гепарды обладают уникальным чутьем и интуицией, что помогает им принимать быстрые и правильные решения, даже в самых сложных ситуациях. Эти люди стремятся к самосовершенствованию и постоянному росту, они не останавливаются на достигнутом и всегда ищут новые вызовы. Однако иногда им не хватает терпения и настойчивости, чтобы довести начатое до конца, поэтому важно для них научиться управлять своей энергией и фокусироваться на приоритетах. Гепарды обладают неповторимым обаянием и харизмой, которые могут привлечь к ним внимание окружающих. Они способны вдохновлять других своим примером и поддерживать их в трудные моменты. Важно для них помнить о балансе между своими собственными целями и нуждами окружающих, чтобы обеспечить гармонию в своих отношениях и в жизни в целом.",
        image: gepard,
    },
    peacock: {
        ru: "Павлин",
        en: "peacock",
        description:
            "Павлин в зороастрийском гороскопе символизирует красоту, гордость и роскошь. Люди, рожденные под этим знаком, обладают изысканным вкусом и тонким эстетическим чувством. Они стремятся к прекрасному во всех сферах жизни и часто обращают внимание на детали, создавая вокруг себя атмосферу изящества и роскоши. Павлины обладают яркой индивидуальностью и часто привлекают внимание окружающих своей харизмой и обаянием. Они горды своими достижениями и стремятся к признанию своей уникальности. Однако иногда им не хватает скромности и терпимости к мнению других, что может вызывать конфликты и недопонимание. Эти люди обладают талантом к самовыражению и часто находятся в центре внимания благодаря своему обаянию и энергии. Они часто выбирают творческую карьеру или занимаются хобби, которые позволяют им раскрыть свой потенциал и проявить свою индивидуальность. Важно для павлинов научиться управлять своим эго и быть более открытыми к мнению других, чтобы избежать конфликтов и создать гармоничные отношения как в личной, так и в профессиональной жизни.",
        image: pavlin,
    },
    swan: {
        ru: "Лебедь",
        en: "swan",
        description:
            "Лебедь в зороастрийском гороскопе символизирует грацию, чистоту и духовное прозрение. Люди, рожденные под этим знаком, обладают изысканным вкусом и тонкой душевной организацией. Они стремятся к гармонии и красоте во всем окружающем мире и обладают способностью видеть красоту даже в самых мелких деталях. Лебеди обладают неповторимой элегантностью и часто привлекают внимание окружающих своей харизмой и утонченностью. Они обладают спокойствием и внутренней гармонией, которые позволяют им легко приспосабливаться к переменам и сохранять свой покой даже в сложных ситуациях. Эти люди обычно обладают высокими моральными принципами и стремятся к духовному развитию. Они могут быть отличными друзьями и надежными союзниками, готовыми оказать поддержку в трудные моменты. Однако иногда им не хватает решительности и настойчивости, чтобы добиться своих целей, поэтому важно для них научиться проявлять больше уверенности в себе и своих способностях. Важно для лебедей научиться принимать решения с уверенностью и доверять своей интуиции, чтобы достичь истинного успеха и исполнения своих мечтаний.",
        image: lebed,
    },
    lynx: {
        ru: "Рысь",
        en: "lynx",
        description:
            "Рысь в зороастрийском гороскопе символизирует стойкость, независимость и осторожность. Люди, рожденные под этим знаком, обладают сильным характером и готовы преодолевать любые трудности на пути к своим целям. Они обладают острым умом и быстрым реакционным временем, что помогает им принимать правильные решения в сложных ситуациях. Рыси обычно предпочитают действовать независимо и самостоятельно, они не любят ограничений и стремятся к свободе во всех сферах жизни. Они обладают высокой степенью самодисциплины и могут быть очень целеустремленными в достижении своих целей. Эти люди обычно обладают чутким чутьем и интуицией, которые помогают им избегать опасностей и принимать правильные решения. Однако иногда им не хватает терпения и способности приспосабливаться к изменениям, что может затруднить достижение их целей. Важно для рысей научиться доверять своим способностям и умению работать в команде, чтобы использовать всю свою энергию в достижении общих целей. Также им важно помнить о балансе между своей независимостью и потребностью во взаимодействии с другими, чтобы обеспечить гармонию и равновесие в своей жизни.",
        image: ris,
    },
    donkey: {
        ru: "Осел",
        en: "donkey",
        description:
            "В зороастрийском гороскопе Осел символизирует упорство, надежность и трудолюбие. Люди, рожденные под этим знаком, отличаются высокой выносливостью и способностью преодолевать трудности на пути к своим целям. Они не боятся тяжелого труда и готовы упорно работать, чтобы добиться успеха. Ослы обладают простотой и непосредственностью в общении, они часто выделяются своей искренностью и чувством справедливости. Они преданные друзья и верные союзники, готовые поддержать близких в трудные моменты. Эти люди обычно обладают стабильными жизненными принципами и стремятся к достижению материальной стабильности. Они могут быть несколько консервативными и предпочитать традиционные методы решения задач. Однако иногда ослам не хватает гибкости и способности адаптироваться к переменам, что может мешать им в достижении новых высот. Важно для них научиться открыто воспринимать новые идеи и быть готовыми к изменениям, чтобы расти и развиваться. Важно помнить, что упорство и трудолюбие ослов часто вознаграждаются, их стойкость и надежность могут стать ключом к успеху и достижению целей.",
        image: osel,
    },
    polar_bear: {
        ru: "Белый медведь",
        en: "polar_bear",
        description:
            "В зороастрийском гороскопе Белый Медведь символизирует силу, мудрость и величие. Люди, рожденные под этим знаком, обладают выдающимися лидерскими качествами и способностью вдохновлять других своим примером. Они обладают мощным духом и решительностью, которые позволяют им преодолевать любые трудности на пути к своим целям. Белые Медведи часто выделяются своей мудростью и интуицией, они обладают способностью видеть далеко вперед и принимать стратегические решения. Они могут быть отличными руководителями, способными объединить людей вокруг общих целей и достичь великих результатов. Эти люди часто обладают сильным чувством справедливости и готовы защищать тех, кто нуждается в помощи. Они обладают великодушием и готовы делиться своими знаниями и опытом с окружающими. Однако иногда Белым Медведям не хватает терпения и способности к компромиссам, что может создавать напряженность в отношениях с другими. Важно для них научиться проявлять больше терпимости и понимания к мнению других, чтобы создать гармоничные отношения как в личной, так и в профессиональной жизни. Важно помнить, что мудрость и величие Белого Медведя могут стать источником вдохновения для многих, их лидерские качества и умение принимать верные решения могут помочь им преодолеть любые препятствия и достичь великих высот.",
        image: beli_medved,
    },
    eagle: {
        ru: "Орел",
        en: "eagle",
        description:
            "В зороастрийском гороскопе Орел символизирует силу, власть и возвышенность. Люди, рожденные под этим знаком, обладают амбициозным духом и стремлением к лидерству. Они обладают острым умом и проницательным взглядом, что помогает им принимать стратегические решения и вести других за собой. Орлы обычно отличаются решительностью и целеустремленностью в достижении своих целей. Они не боятся брать на себя ответственность и готовы принимать сложные решения в любых ситуациях. Их непоколебимость и смелость часто привлекают внимание окружающих и вдохновляют других своим примером. Эти люди часто обладают высокой энергией и умеют вдохновлять других своим энтузиазмом и страстью. Они стремятся к высоким целям и могут быть мощными мотиваторами для окружающих. Однако иногда Орлам не хватает терпения и уважения к мнению других, что может создавать конфликты и препятствовать сотрудничеству. Важно для них научиться проявлять больше терпимости и понимания, чтобы создать гармоничные отношения как в личной, так и в профессиональной жизни. Важно помнить, что сила и власть Орла могут стать источником вдохновения для многих, их лидерские качества и решительность могут помочь им преодолеть любые препятствия и достичь великих высот.",
        image: orel,
    },
    fox: {
        ru: "Лисица",
        en: "fox",
        description:
            "В зороастрийском гороскопе Лисица символизирует хитрость, сообразительность и ловкость. Люди, рожденные под этим знаком, обладают острым умом и интеллектом, что позволяет им находить нестандартные решения и выходить из трудных ситуаций с выгодой. Лисицы обычно обладают стратегическим мышлением и часто выделяются своими аналитическими способностями. Они умеют быстро адаптироваться к переменам и находить новые возможности даже в самых непредвиденных обстоятельствах. Эти люди часто обладают обаянием и харизмой, которые помогают им завоевывать доверие окружающих и достигать своих целей. Они могут быть отличными дипломатами и уметь убедить других в своей правоте. Однако иногда Лисицам не хватает терпения и стойкости, чтобы довести начатое до конца. Их хитрость и ловкость могут иногда привести к манипуляциям и недоверию со стороны окружающих. Важно для Лисиц научиться использовать свои способности с честностью и справедливостью, чтобы избежать конфликтов и создать долгосрочные отношения на основе доверия.",
        image: lisa,
    },
    dolphin: {
        ru: "Дельфин",
        en: "dolphin",
        description:
            "В зороастрийском гороскопе Дельфин символизирует умение общаться, игривость и защиту. Люди, рожденные под этим знаком, обладают ярким характером и способностью легко находить общий язык с окружающими. Они обладают обширным кругозором и часто являются душой компании, способными развеселить любую аудиторию. Дельфины часто выделяются своей социальной активностью и открытостью к новым знакомствам. Они обладают прекрасным чувством юмора и умением поддерживать приятную атмосферу в обществе. Эти люди обычно обладают высокой интуицией и эмпатией, что помогает им понимать потребности других и предлагать поддержку в трудные моменты. Они могут быть отличными слушателями и надежными друзьями, готовыми оказать помощь и поддержку в любой ситуации. Однако иногда Дельфинам не хватает стойкости и целеустремленности, чтобы достичь своих собственных целей. Их игривый нрав иногда может мешать им в серьезных делах и приводить к недооценке их потенциала. Важно для Дельфинов научиться балансировать между развлечениями и серьезной работой, чтобы достичь гармонии в своей жизни и реализовать свой полный потенциал.",
        image: delfin,
    },
    boar: {
        ru: "Вепрь",
        en: "boar",
        description:
            "В зороастрийском гороскопе Вепрь символизирует силу, защиту и стойкость. Люди, рожденные под этим знаком, обладают мощным характером и способностью справляться с трудностями. Они преданные и надежные, готовы защищать своих близких и друзей в любых ситуациях. Вепри обычно отличаются целеустремленностью и решительностью в достижении своих целей. Они не боятся трудностей и готовы бороться до конца за то, во что верят. Их сила воли и выносливость позволяют им преодолевать любые препятствия на пути к успеху. Эти люди обладают сильным чувством справедливости и могут быть неутомимыми защитниками своих убеждений. Они готовы бороться за то, что считают правильным, и не поддаются на уговоры или угрозы. Однако иногда Вепрям не хватает гибкости и терпимости к мнению других, что может приводить к конфликтам и разногласиям. Важно для них научиться проявлять больше дипломатии и уважения к точке зрения других людей, чтобы избежать напряженности в отношениях. Важно помнить, что сила и стойкость Вепря могут стать источником вдохновения для многих, их преданность и защитнические качества могут помочь им преодолеть любые препятствия и защитить тех, кто нуждается в помощи.",
        image: vepr,
    },
    owl: {
        ru: "Сова",
        en: "owl",
        description:
            "В зороастрийском гороскопе Сова символизирует мудрость, интуицию и загадочность. Люди, рожденные под этим знаком, обладают глубоким внутренним миром и проницательным умом. Они часто предпочитают тихую обстановку и уединение, чтобы размышлять и исследовать новые идеи. Совы обычно выделяются своей обширной эрудицией и способностью видеть скрытые аспекты ситуаций. Они часто действуют на основе интуиции и доверяют своим внутренним ощущениям, что помогает им принимать верные решения, даже в сложных ситуациях. Эти люди обладают тонким чувством справедливости и часто выступают в защиту тех, кто нуждается в помощи. Они готовы предложить свой совет и поддержку друзьям и близким, когда это необходимо. Однако иногда Совам не хватает коммуникативных навыков и открытости к новым знакомствам, что может мешать им в установлении глубоких отношений. Важно для них научиться проявлять больше общительности и открытости, чтобы расширить свой круг общения и найти единомышленников. Важно помнить, что мудрость и интуиция Совы могут стать источником вдохновения для многих, их способность видеть далеко вперед и разгадывать тайны могут помочь им преодолеть любые препятствия и достичь глубокого понимания мира.",
        image: sova,
    },
    falcon: {
        ru: "Сокол",
        en: "falcon",
        description:
            "В зороастрийском гороскопе Сокол символизирует свободу, стремление к высотам и проницательность. Люди, рожденные под этим знаком, обладают сильным духом и стремлением к независимости. Они часто выделяются своей амбициозностью и энергичностью, готовыми идти к своим целям через препятствия. Соколы обычно обладают острым умом и способностью быстро анализировать ситуации. Они обладают стратегическим мышлением и могут принимать решения даже в самых сложных ситуациях. Эти люди часто стремятся к свободе и независимости во всех аспектах своей жизни. Они не боятся брать на себя риски и идти против течения, чтобы достичь своих целей. Однако иногда Соколам не хватает терпения и способности к компромиссам, что может создавать напряженность в отношениях с окружающими. Важно для них научиться проявлять больше терпимости и уважения к мнению других людей, чтобы избежать конфликтов и создать гармоничные отношения. Важно помнить, что стремление к свободе и независимости Соколов может стать источником вдохновения для многих, их амбициозность и решительность могут помочь им преодолеть любые препятствия и достичь великих высот.",
        image: sokol,
    },
    deer: {
        ru: "Олень",
        en: "deer",
        description:
            "В зороастрийском гороскопе Олень символизирует грацию, чуткость и внутреннюю силу. Люди, рожденные под этим знаком, обладают изяществом и элегантностью во всех своих поступках. Они обладают глубоким внутренним миром и способностью чувствовать энергию мира вокруг себя. Олени часто выделяются своей чуткостью и эмпатией к другим. Они обладают уникальной способностью понимать чувства и потребности окружающих, что помогает им поддерживать гармоничные отношения с людьми. Эти люди обычно стремятся к гармонии и миру в своей жизни. Они ценят красоту и гармонию во всех ее проявлениях и часто стремятся к искусству и красоте в своем окружении. Однако иногда Оленям не хватает решительности и уверенности в себе, чтобы достичь своих целей. Их чувствительность иногда может приводить к переживаниям и затруднять принятие важных решений. Важно для Оленей научиться доверять своим инстинктам и верить в свои силы, чтобы добиться успеха в своих начинаниях. Также важно помнить, что их способность к чуткости и эмпатии может стать источником вдохновения для других, помогая создавать гармоничные и любящие отношения вокруг себя.",
        image: olen,
    },
    ram: {
        ru: "Баран",
        en: "ram",
        description:
            "В зороастрийском гороскопе Баран символизирует стойкость, решимость и плодотворность. Люди, рожденные под этим знаком, обладают сильным характером и готовностью преодолевать препятствия на пути к своим целям. Они часто выделяются своей энергичностью и целеустремленностью, неуклонно двигаясь вперед к достижению поставленных целей. Бараны обычно отличаются преданностью и надежностью. Они готовы брать на себя ответственность и выполнять свои обязанности с добросовестностью и упорством. Их работоспособность и плодотворность позволяют им добиваться успеха в различных сферах жизни. Эти люди обладают сильным чувством справедливости и могут выступать в защиту тех, кто нуждается в помощи. Они готовы оказывать поддержку и защищать интересы своих близких и друзей, когда это необходимо. Однако иногда Баранам не хватает гибкости и терпения, чтобы адаптироваться к переменам, что может создавать напряженность в отношениях с окружающими. Важно для них научиться проявлять больше терпимости и готовности к сотрудничеству, чтобы создать гармоничные отношения как в личной, так и в профессиональной жизни. Важно помнить, что стойкость и решимость Баранов могут стать источником вдохновения для многих, их упорство и преданность могут помочь им преодолеть любые препятствия и достичь великих высот.",
        image: baran,
    },
    mongoose: {
        ru: "Мангуст",
        en: "mongoose",
        description:
            "В зороастрийском гороскопе Мангуст символизирует находчивость, бдительность и острый ум. Люди, рожденные под этим знаком, обладают проницательностью и способностью быстро адаптироваться к переменам. Они часто выделяются своей находчивостью и умением находить нестандартные решения для решения проблем. Мангусты обычно обладают высоким уровнем энергии и активности. Они всегда на чеку и готовы реагировать на изменения в окружающей среде. Их бдительность и острая реакция помогают им избегать опасностей и принимать верные решения в сложных ситуациях. Эти люди обычно являются отличными коммуникаторами и обладают хорошим чувством юмора. Они легко завоевывают доверие окружающих и способны находить общий язык с людьми разного круга. Однако иногда Мангустам не хватает терпения и стойкости, чтобы завершить начатое дело. Их склонность к быстрым перемещениям и постоянной активности может приводить к разобщенности и неустойчивости. Важно для Мангустов научиться управлять своей энергией и фокусироваться на приоритетах, чтобы добиться больших успехов в своих начинаниях. Также важно помнить, что их находчивость и бдительность могут стать источником вдохновения для других, помогая им преодолевать трудности и достигать своих целей.",
        image: mangust,
    },
    wolf: {
        ru: "Волк",
        en: "wolf",
        description:
            "В зороастрийском гороскопе Волк символизирует силу, выносливость и преданность. Люди, рожденные под этим знаком, обладают дикой энергией и стремлением к свободе. Они обычно выделяются своей смелостью и решительностью, готовыми принять вызов и идти вперед даже в самых сложных ситуациях. Волки обладают сильным чувством семьи и сообщества. Они часто выступают в защиту своих близких и готовы жертвовать собой ради благополучия своей стаи. Их преданность и верность делают их отличными лидерами, способными объединять людей вокруг общих целей. Эти люди обычно обладают острым инстинктом и чувством интуиции. Они умеют четко чувствовать обстановку и принимать правильные решения в критических моментах. Их проницательность и умение видеть далеко вперед помогают им избегать опасностей и достигать успеха в своих начинаниях. Однако иногда Волкам не хватает гибкости и терпения, чтобы приспособиться к переменам в окружающем мире. Их склонность к независимости и самостоятельности иногда может создавать конфликты в отношениях с окружающими. Важно для Волков научиться проявлять больше терпимости и готовности к сотрудничеству, чтобы создать гармоничные отношения как в личной, так и в профессиональной жизни.",
        image: volk,
    },
    stork: {
        ru: "Аист",
        en: "stork",
        description:
            "В зороастрийском гороскопе Аист символизирует прозорливость, преданность и внимательность. Люди, рожденные под этим знаком, обладают ярким интеллектом и способностью видеть скрытые аспекты ситуаций. Они часто выделяются своей мудростью и интуицией, способными принимать взвешенные решения, основанные на глубоком понимании. Аисты обычно являются отличными наблюдателями и аналитиками. Они способны замечать даже мельчайшие детали и извлекать из них важные выводы. Их внимательность и чуткость позволяют им быть надежными советчиками и поддержкой для своих близких. Эти люди обладают высоким чувством ответственности и преданности. Они готовы взять на себя трудности ради тех, кого любят, и всегда стараются помочь своим друзьям и семье в трудные моменты. Однако иногда Аистам не хватает уверенности в себе и решимости, чтобы добиться своих целей. Их склонность к перфекционизму иногда может мешать им добиваться успеха в своих начинаниях. Важно для Аистов научиться доверять своим способностям и верить в себя, чтобы раскрыть свой полный потенциал. Также важно помнить, что их прозорливость и преданность могут стать источником вдохновения для других, помогая им преодолевать трудности и достигать своих целей.",
        image: aist,
    },
    spider: {
        ru: "Паук",
        en: "spider",
        description:
            "В зороастрийском гороскопе Паук символизирует творчество, упорство и трансформацию. Люди, рожденные под этим знаком, обладают креативным мышлением и способностью преобразовывать окружающий мир. Они часто выделяются своей изобретательностью и готовностью идти своим путем, не подчиняясь стандартам. Пауки обычно обладают гибкостью и адаптивностью. Они способны быстро приспосабливаться к изменяющимся обстоятельствам и находить нестандартные решения для решения проблем. Их упорство и настойчивость позволяют им преодолевать трудности и достигать целей. Эти люди часто являются вдохновителями и визионерами. Они способны видеть возможности там, где другие видят препятствия, и могут вдохновить других на достижение своих мечт. Их творческий подход к жизни помогает им создавать что-то новое и уникальное. Однако иногда Паукам не хватает стабильности и организованности, чтобы довести начатое до конца. Их склонность к переменам и неустойчивости может приводить к недовольству окружающих и затруднять достижение целей. Важно для Пауков научиться управлять своей энергией и фокусироваться на конкретных задачах, чтобы достичь большего успеха в своих начинаниях. Также важно помнить, что их творческий подход и готовность к изменениям могут стать источником вдохновения для других, помогая им преодолевать трудности и искать новые возможности.",
        image: pauk,
    },
    snake: {
        ru: "Змея",
        en: "snake",
        description:
            "В зороастрийском гороскопе Змея символизирует преобразование, мудрость и загадочность. Люди, рожденные под этим знаком, обладают способностью к переменам и глубоким внутренним преобразованиям. Они часто выделяются своей интеллектуальностью и аналитическим мышлением, способными понимать глубинные аспекты жизни. Змеи обычно обладают сильным чувством интуиции и часто доверяют своим внутренним ощущениям. Они способны видеть скрытые аспекты ситуаций и находить решения, которые не очевидны для других. Их мудрость и интеллект позволяют им принимать верные решения даже в самых сложных ситуациях. Эти люди часто стремятся к духовному развитию и самосовершенствованию. Они готовы исследовать глубины своего внутреннего мира и стремятся к пониманию высших истин. Их способность к самопреображению и развитию делает их вдохновляющими лидерами и учителями для окружающих. Однако иногда Змеям не хватает гибкости и терпения, чтобы адаптироваться к изменяющимся обстоятельствам. Их склонность к интроверсии и загадочности иногда может создавать недопонимание с окружающими. Важно для Змей научиться проявлять больше открытости и коммуникабельности, чтобы установить гармоничные отношения с окружающими. Также важно помнить, что их способность к преобразованию и мудрость могут стать источником вдохновения для других, помогая им преодолевать трудности и стремиться к саморазвитию.",
        image: zmeya,
    },
    beaver: {
        ru: "Бобер",
        en: "beaver",
        description:
            "В зороастрийском гороскопе Бобер символизирует упорство, практичность и строительство. Люди, рожденные под этим знаком, обладают стойкостью и трудолюбием. Они часто выделяются своей способностью к систематизации и умением доводить начатое дело до конца. Бобры обычно обладают практичным мышлением и четким взглядом на жизнь. Они способны видеть цель и находить эффективные способы ее достижения. Их организованность и умение планировать позволяют им успешно реализовывать свои идеи. Эти люди часто стремятся к созданию устойчивого и комфортного окружения для себя и своих близких. Они готовы вкладывать усилия в развитие своего дома и семьи, чтобы обеспечить им безопасность и уют. Однако иногда Бобрам не хватает гибкости и способности к адаптации к переменам. Их склонность к консервативности и устоявшимся привычкам иногда может мешать им открыться новым возможностям. Важно для Бобров научиться принимать изменения и гибко реагировать на них, чтобы не упустить шансы для роста и развития. Также важно помнить, что их упорство и практичность могут стать источником вдохновения для других, помогая им достигать своих целей и строить успешную жизнь.",
        image: bober,
    },
    turtle: {
        ru: "Черепаха",
        en: "turtle",
        description:
            "В зороастрийском гороскопе Черепаха символизирует стойкость, мудрость и долголетие. Люди, рожденные под этим знаком, обладают терпением и способностью к долгосрочному планированию. Они часто выделяются своей мудростью и спокойствием, способными принимать жизненные испытания с достоинством. Черепахи обычно обладают уравновешенным характером и умением сохранять спокойствие в любых ситуациях. Они способны адаптироваться к изменениям и преодолевать трудности с терпением и выдержкой. Их умение сохранять гармонию в отношениях помогает им обеспечивать стабильность и уют в своей жизни. Эти люди часто являются хранителями традиций и культуры. Они ценят прошлое и стремятся сохранить его ценности для будущих поколений. Их мудрость и опыт делают их ценными советниками и наставниками для окружающих. Однако иногда Черепахам не хватает инициативности и решительности, чтобы двигаться вперед и достигать новых высот. Их склонность к консервативности иногда может мешать им адаптироваться к переменам и использовать новые возможности. Важно для Черепах научиться проявлять больше инициативы и готовности к риску, чтобы раскрыть свой потенциал и достичь большего в жизни. Также важно помнить, что их стойкость и мудрость могут стать источником вдохновения для других, помогая им преодолевать трудности и искать гармонию в своей жизни.",
        image: cherepaha,
    },
    magpie: {
        ru: "Сорока",
        en: "magpie",
        description:
            "В зороастрийском гороскопе Сорока символизирует сообразительность, общительность и проницательность. Люди, рожденные под этим знаком, обладают острым умом и быстрым темпом мышления. Они часто выделяются своей социальностью и легкостью в общении, способными находить общий язык с разными людьми. Сороки обычно обладают ярким характером и чувством юмора. Они способны привносить радость и веселье в окружающую атмосферу и создавать положительное настроение в любой компании. Их сообразительность и остроумие позволяют им быстро находить выход из любой ситуации. Эти люди часто являются общественными лидерами и организаторами. Они способны объединять людей вокруг общих целей и вдохновлять их на достижение успеха. Их проницательность и интуиция делают их непревзойденными наблюдателями и аналитиками. Однако иногда Сорокам не хватает терпения и стойкости, чтобы довести начатое дело до конца. Их склонность к поверхностности иногда может мешать им достичь глубоких результатов в своей деятельности. Важно для Сорок научиться фокусироваться на главных целях и не отвлекаться на мелочи, чтобы добиться большего успеха в своих начинаниях. Также важно помнить, что их сообразительность и общительность могут стать источником вдохновения для других, помогая им преодолевать трудности и достигать своих целей.",
        image: soroka,
    },
    squirrel: {
        ru: "Белка",
        en: "squirrel",
        description:
            "В зороастрийском гороскопе Белка символизирует ловкость, находчивость и активность. Люди, рожденные под этим знаком, обладают энергией и живостью ума. Они часто выделяются своей ловкостью и умением находить нестандартные решения для решения задач. Белки обычно обладают высоким уровнем активности и мобильности. Они любят движение и постоянно стремятся к достижению новых целей. Их находчивость и настойчивость помогают им преодолевать препятствия и добиваться успеха в своих начинаниях. Эти люди часто являются мастерами в области организации и планирования. Они способны эффективно управлять своим временем и ресурсами, чтобы достичь максимальных результатов. Их активность и предприимчивость делают их незаменимыми в любой команде или коллективе. Однако иногда Белкам не хватает терпения и стойкости, чтобы довести начатое дело до конца. Их склонность к риску иногда может приводить к необдуманным решениям и ошибкам. Важно для Белок научиться управлять своей энергией и фокусироваться на главных целях, чтобы добиться большего успеха в своей деятельности. Также важно помнить, что их ловкость и находчивость могут стать источником вдохновения для других, помогая им преодолевать трудности и достигать своих целей.",
        image: belka,
    },
    crow: {
        ru: "Ворон",
        en: "crow",
        description:
            "В зороастрийском гороскопе Ворон символизирует интеллект, обостренное чутье и стремление к знаниям. Люди, рожденные под этим знаком, обладают острым умом и аналитическим мышлением. Они часто выделяются своей интуицией и способностью видеть глубокие связи в окружающем мире. Вороны обычно обладают уникальным способом восприятия окружающей реальности. Они способны обнаруживать скрытые аспекты ситуаций и предсказывать будущее с удивительной точностью. Их стремление к знаниям и познанию нового делает их постоянными искателями истины. Эти люди часто являются независимыми мыслителями и изобретателями. Они способны видеть мир по-новому и приносить свежие идеи в различные области жизни. Их креативность и интеллект делают их ценными членами общества, способными вносить вклад в развитие человечества. Однако иногда Воронам не хватает практичности и реализма, чтобы применить свои идеи на практике. Их склонность к абстрактному мышлению иногда может мешать им достигать конкретных результатов. Важно для Воронов научиться применять свой интеллект в практических сферах жизни и реализовывать свои идеи. Также важно помнить, что их стремление к знаниям и интеллектуальная острота могут стать источником вдохновения для других, помогая им развиваться и расти.",
        image: voron,
    },
    rooster: {
        ru: "Петух",
        en: "rooster",
        description:
            "В зороастрийском гороскопе Петух символизирует смелость, уверенность и стремление к лидерству. Люди, рожденные под этим знаком, обладают сильным характером и решимостью. Они часто выделяются своей энергией и способностью вдохновлять окружающих на действия. Петухи обычно обладают харизмой и обаянием. Они способны легко завоевывать доверие окружающих и влиять на них своим примером. Их смелость и решительность помогают им преодолевать препятствия и добиваться поставленных целей. Эти люди часто являются натуральными лидерами и организаторами. Они способны вести за собой других и вдохновлять их на совместные достижения. Их умение принимать решения в сложных ситуациях делает их ценными в любой команде или коллективе. Однако иногда Петухам не хватает терпения и тактичности, чтобы успешно взаимодействовать с окружающими. Их склонность к доминированию иногда может создавать напряженные отношения с другими людьми. Важно для Петухов научиться проявлять больше толерантности и уважения к мнению других, чтобы создать гармоничные отношения в своей жизни. Также важно помнить, что их смелость и уверенность могут стать источником вдохновения для других, помогая им преодолевать трудности и достигать своих целей.",
        image: petuh,
    },
};
