<script setup>

</script>

<template>
    <div class="container">
        <section class="head_title">
            <h1>Зодиакальный, восточный и другие <span>гороскопы</span></h1>
            <h2>Гороскоп на каждый день: узнай, что приготовили для тебя звёзды</h2>
        </section>

        <section class="flex-container">
            <nuxt-link to="/horoscope/zodiac/" class="block first">
                <div class="head">
                    <h3>Зодиакальный гороскоп</h3>
                    <p>Это система астрологии, рассчитывающая прогнозы и характеристики исходя из знака зодиака, в
                        котором находилось Солнце в момент рождения человека.</p>
                </div>
                <span><p>Читать</p>  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_2005_293)"><path
                        d="M10 19C9.76635 19.0005 9.53992 18.9191 9.36 18.77C9.25875 18.6861 9.17504 18.583 9.11369 18.4666C9.05234 18.3503 9.01454 18.223 9.00247 18.092C8.99039 17.961 9.00427 17.8289 9.04332 17.7033C9.08236 17.5777 9.1458 17.4611 9.23 17.36L13.71 12L9.39001 6.63C9.30694 6.52771 9.24491 6.41002 9.20748 6.28368C9.17004 6.15734 9.15795 6.02485 9.17189 5.89382C9.18583 5.76279 9.22553 5.63581 9.2887 5.52017C9.35187 5.40454 9.43728 5.30252 9.54001 5.22C9.64347 5.12897 9.76464 5.0603 9.8959 5.01831C10.0272 4.97632 10.1657 4.96192 10.3028 4.976C10.4399 4.99009 10.5726 5.03236 10.6926 5.10016C10.8125 5.16796 10.9172 5.25983 11 5.37L15.83 11.37C15.9771 11.5489 16.0575 11.7734 16.0575 12.005C16.0575 12.2366 15.9771 12.4611 15.83 12.64L10.83 18.64C10.7297 18.761 10.6023 18.8567 10.458 18.9192C10.3138 18.9818 10.1569 19.0095 10 19Z"
                        fill="#E8E8E9"/></g>
                    <defs>
                        <clipPath id="clip0_2005_293">
                            <rect width="24" height="24" fill="white"/>
                        </clipPath>
                    </defs>
                </svg></span>
                <img class="bg" src="@/assets/images/planet.svg" alt="background-img">
            </nuxt-link>
            <nuxt-link to="/horoscope/chinese/" class="block second">
                <div class="head">
                    <h3>Китайский гороскоп</h3>
                    <p>Система астрологии, основанная на круговом календаре, с 12 знаками-животными, каждый из которых
                        соответствует году рождения.</p>
                </div>
                <span><p>Читать</p>  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_2005_293)"><path
                        d="M10 19C9.76635 19.0005 9.53992 18.9191 9.36 18.77C9.25875 18.6861 9.17504 18.583 9.11369 18.4666C9.05234 18.3503 9.01454 18.223 9.00247 18.092C8.99039 17.961 9.00427 17.8289 9.04332 17.7033C9.08236 17.5777 9.1458 17.4611 9.23 17.36L13.71 12L9.39001 6.63C9.30694 6.52771 9.24491 6.41002 9.20748 6.28368C9.17004 6.15734 9.15795 6.02485 9.17189 5.89382C9.18583 5.76279 9.22553 5.63581 9.2887 5.52017C9.35187 5.40454 9.43728 5.30252 9.54001 5.22C9.64347 5.12897 9.76464 5.0603 9.8959 5.01831C10.0272 4.97632 10.1657 4.96192 10.3028 4.976C10.4399 4.99009 10.5726 5.03236 10.6926 5.10016C10.8125 5.16796 10.9172 5.25983 11 5.37L15.83 11.37C15.9771 11.5489 16.0575 11.7734 16.0575 12.005C16.0575 12.2366 15.9771 12.4611 15.83 12.64L10.83 18.64C10.7297 18.761 10.6023 18.8567 10.458 18.9192C10.3138 18.9818 10.1569 19.0095 10 19Z"
                        fill="#E8E8E9"/></g>
                    <defs>
                        <clipPath id="clip0_2005_293">
                            <rect width="24" height="24" fill="white"/>
                        </clipPath>
                    </defs>
                </svg></span>
            </nuxt-link>
            <nuxt-link to="/horoscope/zoroastrian/" class="block third">
                <div class="head">
                    <h3>Зороастрийский гороскоп</h3>
                    <p>Древняя система астрологии, основанная на учениях пророка Заратуштры, учитывающая влияние планет
                        на духовную эволюцию человека и принципы морали.</p>
                </div>
                <span><p>Читать</p>  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_2005_293)"><path
                        d="M10 19C9.76635 19.0005 9.53992 18.9191 9.36 18.77C9.25875 18.6861 9.17504 18.583 9.11369 18.4666C9.05234 18.3503 9.01454 18.223 9.00247 18.092C8.99039 17.961 9.00427 17.8289 9.04332 17.7033C9.08236 17.5777 9.1458 17.4611 9.23 17.36L13.71 12L9.39001 6.63C9.30694 6.52771 9.24491 6.41002 9.20748 6.28368C9.17004 6.15734 9.15795 6.02485 9.17189 5.89382C9.18583 5.76279 9.22553 5.63581 9.2887 5.52017C9.35187 5.40454 9.43728 5.30252 9.54001 5.22C9.64347 5.12897 9.76464 5.0603 9.8959 5.01831C10.0272 4.97632 10.1657 4.96192 10.3028 4.976C10.4399 4.99009 10.5726 5.03236 10.6926 5.10016C10.8125 5.16796 10.9172 5.25983 11 5.37L15.83 11.37C15.9771 11.5489 16.0575 11.7734 16.0575 12.005C16.0575 12.2366 15.9771 12.4611 15.83 12.64L10.83 18.64C10.7297 18.761 10.6023 18.8567 10.458 18.9192C10.3138 18.9818 10.1569 19.0095 10 19Z"
                        fill="#E8E8E9"/></g>
                    <defs>
                        <clipPath id="clip0_2005_293">
                            <rect width="24" height="24" fill="white"/>
                        </clipPath>
                    </defs>
                </svg></span>
            </nuxt-link>
            <nuxt-link to="/horoscope/japanese/" class="block third">
                <div class="head">
                    <h3>Японский гороскоп</h3>
                    <p>Система астрологии, основанная на древних японских верованиях, которая отражает характер через 12
                        знаков животных, соответствующих году рождения.</p>
                </div>
                <span><p>Читать</p>  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_2005_293)"><path
                        d="M10 19C9.76635 19.0005 9.53992 18.9191 9.36 18.77C9.25875 18.6861 9.17504 18.583 9.11369 18.4666C9.05234 18.3503 9.01454 18.223 9.00247 18.092C8.99039 17.961 9.00427 17.8289 9.04332 17.7033C9.08236 17.5777 9.1458 17.4611 9.23 17.36L13.71 12L9.39001 6.63C9.30694 6.52771 9.24491 6.41002 9.20748 6.28368C9.17004 6.15734 9.15795 6.02485 9.17189 5.89382C9.18583 5.76279 9.22553 5.63581 9.2887 5.52017C9.35187 5.40454 9.43728 5.30252 9.54001 5.22C9.64347 5.12897 9.76464 5.0603 9.8959 5.01831C10.0272 4.97632 10.1657 4.96192 10.3028 4.976C10.4399 4.99009 10.5726 5.03236 10.6926 5.10016C10.8125 5.16796 10.9172 5.25983 11 5.37L15.83 11.37C15.9771 11.5489 16.0575 11.7734 16.0575 12.005C16.0575 12.2366 15.9771 12.4611 15.83 12.64L10.83 18.64C10.7297 18.761 10.6023 18.8567 10.458 18.9192C10.3138 18.9818 10.1569 19.0095 10 19Z"
                        fill="#E8E8E9"/></g>
                    <defs>
                        <clipPath id="clip0_2005_293">
                            <rect width="24" height="24" fill="white"/>
                        </clipPath>
                    </defs>
                </svg></span>
            </nuxt-link>
            <nuxt-link to="/horoscope/floral/" class="block second">
                <div class="head">
                    <h3>Цветочный гороскоп</h3>
                    <p>Система астрологии, опирающаяся на ассоциации между цветами и личностными характеристиками.</p>
                </div>
                <span><p>Читать</p>  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_2005_293)"><path
                        d="M10 19C9.76635 19.0005 9.53992 18.9191 9.36 18.77C9.25875 18.6861 9.17504 18.583 9.11369 18.4666C9.05234 18.3503 9.01454 18.223 9.00247 18.092C8.99039 17.961 9.00427 17.8289 9.04332 17.7033C9.08236 17.5777 9.1458 17.4611 9.23 17.36L13.71 12L9.39001 6.63C9.30694 6.52771 9.24491 6.41002 9.20748 6.28368C9.17004 6.15734 9.15795 6.02485 9.17189 5.89382C9.18583 5.76279 9.22553 5.63581 9.2887 5.52017C9.35187 5.40454 9.43728 5.30252 9.54001 5.22C9.64347 5.12897 9.76464 5.0603 9.8959 5.01831C10.0272 4.97632 10.1657 4.96192 10.3028 4.976C10.4399 4.99009 10.5726 5.03236 10.6926 5.10016C10.8125 5.16796 10.9172 5.25983 11 5.37L15.83 11.37C15.9771 11.5489 16.0575 11.7734 16.0575 12.005C16.0575 12.2366 15.9771 12.4611 15.83 12.64L10.83 18.64C10.7297 18.761 10.6023 18.8567 10.458 18.9192C10.3138 18.9818 10.1569 19.0095 10 19Z"
                        fill="#E8E8E9"/></g>
                    <defs>
                        <clipPath id="clip0_2005_293">
                            <rect width="24" height="24" fill="white"/>
                        </clipPath>
                    </defs>
                </svg></span>
            </nuxt-link>
            <nuxt-link to="/horoscope/maya/" class="block second maya">
                <div class="head">
                    <h3>Гороскоп Майя</h3>
                    <p>Это система астрологии, которая определяет характеристики личности и судьбу на основе года
                        рождения в соответствии</p>
                </div>
                <span><p>Читать</p>  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_2005_293)"><path
                        d="M10 19C9.76635 19.0005 9.53992 18.9191 9.36 18.77C9.25875 18.6861 9.17504 18.583 9.11369 18.4666C9.05234 18.3503 9.01454 18.223 9.00247 18.092C8.99039 17.961 9.00427 17.8289 9.04332 17.7033C9.08236 17.5777 9.1458 17.4611 9.23 17.36L13.71 12L9.39001 6.63C9.30694 6.52771 9.24491 6.41002 9.20748 6.28368C9.17004 6.15734 9.15795 6.02485 9.17189 5.89382C9.18583 5.76279 9.22553 5.63581 9.2887 5.52017C9.35187 5.40454 9.43728 5.30252 9.54001 5.22C9.64347 5.12897 9.76464 5.0603 9.8959 5.01831C10.0272 4.97632 10.1657 4.96192 10.3028 4.976C10.4399 4.99009 10.5726 5.03236 10.6926 5.10016C10.8125 5.16796 10.9172 5.25983 11 5.37L15.83 11.37C15.9771 11.5489 16.0575 11.7734 16.0575 12.005C16.0575 12.2366 15.9771 12.4611 15.83 12.64L10.83 18.64C10.7297 18.761 10.6023 18.8567 10.458 18.9192C10.3138 18.9818 10.1569 19.0095 10 19Z"
                        fill="#E8E8E9"/></g>
                    <defs>
                        <clipPath id="clip0_2005_293">
                            <rect width="24" height="24" fill="white"/>
                        </clipPath>
                    </defs>
                </svg></span>
            </nuxt-link>
            <nuxt-link to="/horoscope/druids/" class="block third">
                <div class="head">
                    <h3>Гороскоп Друидов</h3>
                    <p>Древняя кельтская система астрологии, основанная на наблюдениях за природой и циклическом ходе
                        времени. Отличается уникальной символикой, связанной с природными явлениями и животными.</p>
                </div>
                <span><p>Читать</p>  <svg
                    width="24"
                    height="24"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_2005_293)"><path
                        d="M10 19C9.76635 19.0005 9.53992 18.9191 9.36 18.77C9.25875 18.6861 9.17504 18.583 9.11369 18.4666C9.05234 18.3503 9.01454 18.223 9.00247 18.092C8.99039 17.961 9.00427 17.8289 9.04332 17.7033C9.08236 17.5777 9.1458 17.4611 9.23 17.36L13.71 12L9.39001 6.63C9.30694 6.52771 9.24491 6.41002 9.20748 6.28368C9.17004 6.15734 9.15795 6.02485 9.17189 5.89382C9.18583 5.76279 9.22553 5.63581 9.2887 5.52017C9.35187 5.40454 9.43728 5.30252 9.54001 5.22C9.64347 5.12897 9.76464 5.0603 9.8959 5.01831C10.0272 4.97632 10.1657 4.96192 10.3028 4.976C10.4399 4.99009 10.5726 5.03236 10.6926 5.10016C10.8125 5.16796 10.9172 5.25983 11 5.37L15.83 11.37C15.9771 11.5489 16.0575 11.7734 16.0575 12.005C16.0575 12.2366 15.9771 12.4611 15.83 12.64L10.83 18.64C10.7297 18.761 10.6023 18.8567 10.458 18.9192C10.3138 18.9818 10.1569 19.0095 10 19Z"
                        fill="#E8E8E9"/></g>
                    <defs>
                        <clipPath id="clip0_2005_293">
                            <rect width="24" height="24" fill="white"/>
                        </clipPath>
                    </defs>
                </svg></span>
            </nuxt-link>
        </section>
    </div>
</template>

<style scoped>
.third {
    max-width: 418px;
    width: 100%;

    .head {
        h3 {
            width: 200px;
        }

        p {
            font-size: 15px !important;
            line-height: 160% !important;
        }
    }
}

.third:last-child {
    max-width: 505px;

}

.second {
    max-width: 612px;
    width: 100%;

    .head {
        h3 {
            width: 160px;
        }

        p {
            width: 430px;
        }
    }
}

.maya {
    max-width: 525px;
}

.first {
    height: 320px;
    width: 100%;
    position: relative;
    overflow: hidden;

    .bg {
        position: absolute;
        right: -150px;
        height: 130%;
    }
}

.flex-container {
    display: flex;
    flex-wrap: wrap;
    row-gap: 32px;
    column-gap: 24px;

    .block {
        padding: 48px;
        display: flex;
        flex-direction: column;
        justify-content: space-between;
        border-radius: 24px;
        background: var(--dark-select);
        height: 316px;

        span {
            display: flex;
            gap: 4px;
            align-items: center;

            p {
                font-weight: 500;
                font-size: 17px;
                line-height: 165%;
                color: var(--white);
            }
        }

        .head {
            display: flex;
            flex-direction: column;
            gap: 12px;
            max-width: 530px;

            h3 {
                font-weight: 900;
                font-size: 32px;
                line-height: 112%;
                color: var(--dark-select-10);
            }

            p {
                font-weight: 400;
                font-size: 17px;
                line-height: 165%;
                color: var(--dark-select-20);
            }
        }
    }

    .block:hover {
        span p {
            color: var(--yellow);
        }
    }
}

.head_title {
    display: flex;
    flex-direction: column;
    gap: 24px;
    max-width: 800px;
    margin: auto;
    margin-bottom: 96px;

    h1 {
        font-weight: 900;
        font-size: 56px;
        line-height: 107%;
        text-align: center;
        color: var(--dark-select-10);

        span {
            color: var(--yellow);
            font-weight: 900;
            font-size: 56px;
            line-height: 107%;
            text-align: center;
        }
    }

    h2 {
        font-weight: 400;
        font-size: 24px;
        line-height: 133%;
        text-align: center;
        color: var(--dark-select-10);
    }
}

@media (max-width: 1100px) {
    .first {
        height: 100%;
        padding: 24px 24px 133px 24px !important;
        width: 100%;
        position: relative;
        overflow: hidden;

        .bg {
            position: absolute;
            right: -130px;
            height: 110%;
        }

        .head {
            margin-bottom: 24px;
            position: relative;
            z-index: 5;
        }

        span {
            display: flex;
            gap: 4px;
            position: relative !important;
            z-index: 5;
            width: 100%;
            left: 0;


            p {
                font-weight: 500;
                font-size: 17px;
                line-height: 165%;
                color: var(--white);
                display: block !important;
            }
        }
    }

    .flex-container {
        row-gap: 24px;

        .block {
            padding: 24px;
            border-radius: 16px;
            height: 100%;
            width: 100%;
            max-width: 100% !important;
            position: relative;
            justify-content: start;

            span {
                position: absolute;
                right: 24px;
                top: 24px;

                p {
                    display: none;
                }
            }

            .head {
                display: flex;
                flex-direction: column;
                gap: 12px;
                max-width: 530px;

                h3 {
                    font-size: 20px;
                    line-height: 120%;
                    width: 100%;
                    max-width: 85%;
                }

                p {
                    font-size: 15px;
                    line-height: 160%;
                    color: var(--dark-select-20);
                    width: 100%;
                }
            }
        }
    }

    .head_title {
        gap: 8px;
        margin-bottom: 32px;

        h1 {
            font-size: 32px;
            line-height: 119%;

            span {
                font-size: 32px;
                line-height: 119%;
            }
        }

        h2 {
            font-size: 17px;
            line-height: 153%;
        }
    }

}
</style>
