<script setup>
import HowDoHoroscope from "~/components/horoscope/zodiacs/zodiacComponents/HowDoHoroscope.vue";
import SeoMeta from "~/components/meta/seo-meta.vue";


</script>

<template>
    <div class="container">
        <h1>О проекте</h1>
        <div class="main_wrapper">
            <div class="block">
                <h2>Цель проекта</h2>
                <h3>
                    Добро пожаловать на наш астрологический сервис! Мы создали его для того, чтобы с помощью
                    астрологических знаний делиться уникальным опытом, направленным на саморазвитие, самопознание и
                    духовный рост. Мы верим, что каждый человек уникален, заслуживает понимания, уважения и, конечно,
                    того, к чему мы все осознанно или подсознательно стремимся – полноценной и счастливой жизни. Мы
                    разработали этот сервис, чтобы, раскрыв ваш потенциал, вы научились жить более осознанно и
                    гармонично. Спасибо, что вы с нами на этом пути! <br> <br>
                    1) Обеспечение доступа к астрологическим знаниям <br>
                    Мы хотим сделать тайны звезд понятными и доступными каждому. Наша команда астрологов подготовила для
                    вас статьи, материалы и бесплатные персональные разборы, которые будут понятны даже новичку. Они
                    разработаны таким образом, чтобы любой человек, независимо от уровня подготовки, мог легко в них
                    разобраться и применить на практике.<br> <br>
                    2) Помощь в саморазвитии <br>
                    На наш взгляд, обязательный и неотъемлемый этап самосовершенствования – это самопознание. Тот, кто
                    хорошо себя знает, берет управление своей жизнью в свои руки, уверенно и спокойно движется по
                    жизненной траектории, которую сам себе нарисовал, не обращая внимания на внешнее. Наша цель — помочь
                    вам лучше понимать себя и дать услышать ваш внутренний голос.<br> <br>
                    3) Создание астрологического комьюнити <br>
                    Мы стремимся создать основанное на взаимном уважении и стремлении к личному развитию сообщество
                    единомышленников, где люди могут обмениваться опытом, знаниями и поддержкой. С помощью нашего сайта
                    вы сможете найти принимающее и вдохновляющее окружение, которое поддержит вас в ваших ценностях и
                    разделит ваши интересы.

                </h3>
            </div>
            <div class="block">
                <h2>Наши ценности</h2>
                <h3>
                    Мы убеждены, что с помощью астрологии можно научиться лучше понимать себя, свои истинные желания,
                    жизненные циклы и стратегию гармоничного взаимодействия с окружающим миром. Мы стремимся сделать
                    астрологию доступной и понятной каждому, кто ищет путь к самопознанию и личностному росту.
                </h3>
                <div class="cards">
                    <div class="card">
                        <h4>1) Зрелость</h4>
                        <h5>
                            Для людей, далеких от эзотерики, слова «зрелость» и «астрология» могут казаться
                            противоположными по смыслу. Но мы-то знаем, что не во всем виноват Ретроградный Меркурий, и
                            признаем, что астрология — это мощный инструмент, помогающий улучшить жизнь, только при
                            зрелом подходе и умении брать ответственность за себя и свои решения.
                        </h5>
                    </div>
                    <div class="card">
                        <h4>2) Осознанность</h4>
                        <h5>
                            Мы верим в силу настоящего момента. Наш сервис учит фокусироваться на том, что по-настоящему
                            важно, распознавать свои эмоции, принимать текущий момент и свои жизненные обстоятельства.
                            Осознанность помогает принимать более взвешенные решения, жить полноценной и счастливой
                            жизнью. Наша цель – помочь развить это важное качество и научить видеть в каждом моменте
                            возможность для роста.
                        </h5>
                    </div>
                    <div class="card">
                        <h4>3) Постоянное развитие</h4>
                        <h5>
                            Мы ценим саморазвитие и духовный рост, сами стараемся постоянно становиться лучше и
                            стремимся помогать в этом остальным. Задача нашего сервиса — сопровождать вас в путешествии
                            к вашему истинному «Я» и лучшему пониманию себя в этом мире. Мы рады стать проводником на
                            вашем пути духовного совершенствования!
                        </h5>
                    </div>
                </div>
            </div>
            <div class="block">
                <h2>Миссия проекта</h2>
                <h3>
                    Мы верим, что астрология – это мощный инструмент самопознания и личностного роста, который помогает людям понять себя и окружающий мир глубже и полнее. В современном мире, где человек часто сталкивается с информационным перегрузом и стрессом, астрология предлагает замедлиться, остановиться, оглянуться на свою жизнь и увидеть её с новой перспективы. Наш сервис создан для того, чтобы предоставить эту возможность всем желающим.
                    <br>
                    Мы убеждены, что астрология может быть полезна каждому человеку независимо от возраста, профессии или жизненного опыта. Мы искренне верим, что астрология может изменить жизнь людей к лучшему, и мы делаем все возможное, чтобы вы могли ощутить эти позитивные изменения.
                    <br>Наша миссия – помочь вам на пути к самопознанию, гармонии и личностному росту. Мы уверены, что через понимание себя вы сможете сделать свою жизнь более осмысленной и полноценной. Каждый день мы работаем для того, чтобы древние астрологические знания были доступны и понятны каждому, кто стремится к духовной трансформации и личностному росту.
                    <br>В наших планах создать пространство, где люди могут исследовать и развивать свою духовность, преодолевать барьеры, искать свое предназначение, раскрывать потенциал, проходить через жизненные кризисы, находить пути достижения целей и улучшения качества жизни.
                    <br> Мы поддерживаем людей в их духовном пути и стремимся улучшить ваше благополучие с помощью астрологии, помогая найти баланс, гармонию и внутреннее удовлетворение.
                    <br> Наш проект стремится популяризировать астрологию и разрушить стереотипы и мифы, связанные с ней, демонстрируя ее практическую ценность в повседневной жизни.

                </h3>
            </div>
        </div>
    </div>
    <HowDoHoroscope></HowDoHoroscope>
    <div class="container">
        <section class="creators">
            <div class="row">
                <p>Над проектом работали</p>
                <span>Люди разных культурных и религиозных взглядов</span>
            </div>
            <div class="creators_list">
                <p>Эльвира<br>Ахмедова</p>
                <p>Артур<br>Габриелян</p>
                <p>Александр<br>Елютин </p>
                <p>Александра<br>Костенко</p>
            </div>
            <div class="creators_list">
                <p>Алексей<br>Монархов</p>
                <p>Артём<br>Пряников</p>
                <p>Александр<br>Сафовский</p>
            </div>
        </section>
    </div>
    <div class="container">
        <div class="pop_wrapper">
            <section class="pop_block">
                <p class="head_text">Мы будем рады общественной помощи и рекомендациям</p>
                <p class="desc_text">Ваши пожелания и советы вы можете отправить на почту: <span>info@xcards.ru</span>
                </p>
            </section>
        </div>
    </div>
    <seo-meta></seo-meta>
</template>

<style scoped>
.pop_wrapper {
    border-radius: 40px;
    box-shadow: 0 8px 24px 0 #000;
    backdrop-filter: blur(3px);
    background: rgba(232, 232, 233, 0.06);
}

.pop_block {
    background-image: url("@/assets/images/telegram_bg.svg");
    background-repeat: no-repeat;
    background-position: top -50px right -70px;
    border-radius: 40px;
    padding: 32px 48px;
    display: flex;
    flex-direction: column;
    gap: 6px;

    .head_text {
        font-weight: 700;
        font-size: 24px;
        line-height: 117%;
        color: var(--white);
    }

    .desc_text {
        font-weight: 400;
        font-size: 17px;
        line-height: 165%;
        color: var(--dark-select-20);

        span {
            color: var(--yellow);
        }
    }
}

.creators {
    max-width: 960px;
    margin: 0 auto;
    margin-bottom: 64px;

    .creators_list {
        display: flex;
        flex-wrap: nowrap;
        gap: 24px;
        margin-bottom: 24px;

        p {
            width: 100%;
            border: 1px solid var(--dark-main-80);
            border-radius: 16px;
            padding: 32px;
            font-weight: 500;
            font-size: 19px;
            line-height: 147%;
            text-align: center;
            color: var(--dark-select-20);
        }
    }

    .row {
        margin-bottom: 48px;
        display: flex;
        flex-direction: column;
        gap: 16px;

        p {
            font-weight: 900;
            font-size: 40px;
            line-height: 110%;
            text-align: center;
            color: var(--dark-select-10);
        }

        span {
            font-weight: 400;
            font-size: 19px;
            line-height: 147%;
            text-align: center;
            color: var(--dark-select-20);
        }
    }
}

.cards {
    display: flex;
    flex-direction: column;
    gap: 16px;
}

.card {
    border-radius: 24px;
    padding: 32px;
    background: var(--dark-select);
    display: flex;
    flex-direction: column;
    gap: 4px;
    background-image: url("@/assets/images/planet.svg");
    background-position: right 25px center;
    background-repeat: no-repeat;
    background-size: 230px 175px;

    h4 {
        font-weight: 700;
        font-size: 20px;
        line-height: 120%;
        color: var(--dark-select-10);
        max-width: 380px;
    }

    h5 {
        font-weight: 400;
        font-size: 17px;
        line-height: 165%;
        color: var(--dark-select-20);
        max-width: 380px;
    }
}

.main_wrapper {
    max-width: 720px;
    margin: 0 auto;
    margin-bottom: 96px;
    display: flex;
    flex-direction: column;
    gap: 64px;
}

.block {
    display: flex;
    flex-direction: column;
    gap: 32px;


    h2 {
        font-weight: 900;
        font-size: 40px;
        line-height: 110%;
        color: var(--dark-select-10);
    }

    h3 {
        font-weight: 400;
        font-size: 19px;
        line-height: 147%;
        color: var(--dark-select-20);
    }
}

h1 {
    font-weight: 900;
    font-size: 80px;
    line-height: 107%;
    color: var(--dark-select-10);
    padding: 50px 0;
    max-width: 720px;
    margin: 0 auto;
}
</style>
