<script setup>
import YellowButton from "~/components/UI/yellowButton.vue";
import {useRouter} from 'vue-router';

const router = useRouter();
const handleYellowButtonClick = () => {
    const path = `/natal-chart/xc2kfknwi9823`;
    router.push(path);
};
</script>

<template>
    <section class="natal-charts-links">
        <div class="container">
            <div class="wrapper">

                <nuxt-link to="/natal-chart/love/" class="block">
                    <div class="info">
                        <h3>Любовь и отношения</h3>
                        <h4>Узнайте с помощью натальной карты, где искать любовь, какие ограничения мешают вам построить
                            гармоничные и счастливые отношения, а также какими качествами должен обладать Ваш идеальный
                            партнер.</h4>
                    </div>
                    <div class="link">
                        <p>Читать</p>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_4121_9068)">
                                <path
                                    d="M9.99981 19C9.76615 19.0005 9.53972 18.9191 9.35981 18.77C9.25855 18.6861 9.17485 18.583 9.11349 18.4666C9.05214 18.3503 9.01435 18.223 9.00227 18.092C8.99019 17.961 9.00408 17.8289 9.04312 17.7033C9.08217 17.5777 9.1456 17.4611 9.22981 17.36L13.7098 12L9.38981 6.63C9.30674 6.52771 9.24471 6.41002 9.20728 6.28368C9.16985 6.15734 9.15775 6.02485 9.17169 5.89382C9.18563 5.76279 9.22533 5.63581 9.2885 5.52017C9.35168 5.40454 9.43708 5.30252 9.53981 5.22C9.64327 5.12897 9.76444 5.0603 9.8957 5.01831C10.027 4.97632 10.1655 4.96192 10.3026 4.976C10.4397 4.99009 10.5724 5.03236 10.6924 5.10016C10.8123 5.16796 10.917 5.25983 10.9998 5.37L15.8298 11.37C15.9769 11.5489 16.0573 11.7734 16.0573 12.005C16.0573 12.2366 15.9769 12.4611 15.8298 12.64L10.8298 18.64C10.7295 18.761 10.6021 18.8567 10.4578 18.9192C10.3136 18.9818 10.1567 19.0095 9.99981 19Z"
                                    fill="#E8E8E9"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_4121_9068">
                                    <rect width="24" height="24" fill="white"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                </nuxt-link>

                <nuxt-link to="/natal-chart/prof/" class="block">
                    <div class="info">
                        <h3>Профессия, которая вам подходит</h3>
                        <h4>Звезды подскажут, в какой сфере Вас ждёт наибольший успех, и помогут найти профессии, которые отвечают вашим компетенциям и талантам.</h4>
                    </div>
                    <div class="link">
                        <p>Читать</p>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_4121_9068)">
                                <path
                                    d="M9.99981 19C9.76615 19.0005 9.53972 18.9191 9.35981 18.77C9.25855 18.6861 9.17485 18.583 9.11349 18.4666C9.05214 18.3503 9.01435 18.223 9.00227 18.092C8.99019 17.961 9.00408 17.8289 9.04312 17.7033C9.08217 17.5777 9.1456 17.4611 9.22981 17.36L13.7098 12L9.38981 6.63C9.30674 6.52771 9.24471 6.41002 9.20728 6.28368C9.16985 6.15734 9.15775 6.02485 9.17169 5.89382C9.18563 5.76279 9.22533 5.63581 9.2885 5.52017C9.35168 5.40454 9.43708 5.30252 9.53981 5.22C9.64327 5.12897 9.76444 5.0603 9.8957 5.01831C10.027 4.97632 10.1655 4.96192 10.3026 4.976C10.4397 4.99009 10.5724 5.03236 10.6924 5.10016C10.8123 5.16796 10.917 5.25983 10.9998 5.37L15.8298 11.37C15.9769 11.5489 16.0573 11.7734 16.0573 12.005C16.0573 12.2366 15.9769 12.4611 15.8298 12.64L10.8298 18.64C10.7295 18.761 10.6021 18.8567 10.4578 18.9192C10.3136 18.9818 10.1567 19.0095 9.99981 19Z"
                                    fill="#E8E8E9"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_4121_9068">
                                    <rect width="24" height="24" fill="white"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                </nuxt-link>

                <div class="personal">
                    <div class="info">
                        <h3>Закажите персональный разбор личности у астролога</h3>
                        <h4>Персональный разбор личности в астрологии — уникальная возможность лучше познакомиться с
                            собственной индивидуальностью, раскрыть потенциал для личностного роста и саморазвития</h4>
                    </div>
                    <yellow-button :natal="true" @click="handleYellowButtonClick">Получить разбор</yellow-button>
                </div>

                <nuxt-link to="/natal-chart/finance/" class="block">
                    <div class="info">
                        <h3>Финансы</h3>
                        <h4>С помощью астрологии можно наладить отношения с деньгами, узнать возможности в материальной сфере и определить, как управлять финансами для стабильного денежного потока.</h4>
                    </div>
                    <div class="link">
                        <p>Читать</p>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_4121_9068)">
                                <path
                                    d="M9.99981 19C9.76615 19.0005 9.53972 18.9191 9.35981 18.77C9.25855 18.6861 9.17485 18.583 9.11349 18.4666C9.05214 18.3503 9.01435 18.223 9.00227 18.092C8.99019 17.961 9.00408 17.8289 9.04312 17.7033C9.08217 17.5777 9.1456 17.4611 9.22981 17.36L13.7098 12L9.38981 6.63C9.30674 6.52771 9.24471 6.41002 9.20728 6.28368C9.16985 6.15734 9.15775 6.02485 9.17169 5.89382C9.18563 5.76279 9.22533 5.63581 9.2885 5.52017C9.35168 5.40454 9.43708 5.30252 9.53981 5.22C9.64327 5.12897 9.76444 5.0603 9.8957 5.01831C10.027 4.97632 10.1655 4.96192 10.3026 4.976C10.4397 4.99009 10.5724 5.03236 10.6924 5.10016C10.8123 5.16796 10.917 5.25983 10.9998 5.37L15.8298 11.37C15.9769 11.5489 16.0573 11.7734 16.0573 12.005C16.0573 12.2366 15.9769 12.4611 15.8298 12.64L10.8298 18.64C10.7295 18.761 10.6021 18.8567 10.4578 18.9192C10.3136 18.9818 10.1567 19.0095 9.99981 19Z"
                                    fill="#E8E8E9"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_4121_9068">
                                    <rect width="24" height="24" fill="white"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                </nuxt-link>

                <nuxt-link to="/natal-chart/carma/" class="block">
                    <div class="info">
                        <h3>Карма и предназначение</h3>
                        <h4>В натальной карте заложена информация о карме и прошлом опыте души, о том, какие кармические темы и ситуации могут проявляться в жизни и какое у человека предназначение.
                        </h4>
                    </div>
                    <div class="link">
                        <p>Читать</p>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_4121_9068)">
                                <path
                                    d="M9.99981 19C9.76615 19.0005 9.53972 18.9191 9.35981 18.77C9.25855 18.6861 9.17485 18.583 9.11349 18.4666C9.05214 18.3503 9.01435 18.223 9.00227 18.092C8.99019 17.961 9.00408 17.8289 9.04312 17.7033C9.08217 17.5777 9.1456 17.4611 9.22981 17.36L13.7098 12L9.38981 6.63C9.30674 6.52771 9.24471 6.41002 9.20728 6.28368C9.16985 6.15734 9.15775 6.02485 9.17169 5.89382C9.18563 5.76279 9.22533 5.63581 9.2885 5.52017C9.35168 5.40454 9.43708 5.30252 9.53981 5.22C9.64327 5.12897 9.76444 5.0603 9.8957 5.01831C10.027 4.97632 10.1655 4.96192 10.3026 4.976C10.4397 4.99009 10.5724 5.03236 10.6924 5.10016C10.8123 5.16796 10.917 5.25983 10.9998 5.37L15.8298 11.37C15.9769 11.5489 16.0573 11.7734 16.0573 12.005C16.0573 12.2366 15.9769 12.4611 15.8298 12.64L10.8298 18.64C10.7295 18.761 10.6021 18.8567 10.4578 18.9192C10.3136 18.9818 10.1567 19.0095 9.99981 19Z"
                                    fill="#E8E8E9"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_4121_9068">
                                    <rect width="24" height="24" fill="white"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                </nuxt-link>
                <nuxt-link to="/natal-chart/energy/" class="block">
                    <div class="info">
                        <h3>Энергия и вдохновение</h3>
                        <h4>Как правильно расслабляться и отдыхать так, чтобы наполняться ресурсами, откуда черпать энергию и в чем источник сил и вдохновения — обо всем расскажут аспекты Ваших Луны и Марса.
                        </h4>
                    </div>
                    <div class="link">
                        <p>Читать</p>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_4121_9068)">
                                <path
                                    d="M9.99981 19C9.76615 19.0005 9.53972 18.9191 9.35981 18.77C9.25855 18.6861 9.17485 18.583 9.11349 18.4666C9.05214 18.3503 9.01435 18.223 9.00227 18.092C8.99019 17.961 9.00408 17.8289 9.04312 17.7033C9.08217 17.5777 9.1456 17.4611 9.22981 17.36L13.7098 12L9.38981 6.63C9.30674 6.52771 9.24471 6.41002 9.20728 6.28368C9.16985 6.15734 9.15775 6.02485 9.17169 5.89382C9.18563 5.76279 9.22533 5.63581 9.2885 5.52017C9.35168 5.40454 9.43708 5.30252 9.53981 5.22C9.64327 5.12897 9.76444 5.0603 9.8957 5.01831C10.027 4.97632 10.1655 4.96192 10.3026 4.976C10.4397 4.99009 10.5724 5.03236 10.6924 5.10016C10.8123 5.16796 10.917 5.25983 10.9998 5.37L15.8298 11.37C15.9769 11.5489 16.0573 11.7734 16.0573 12.005C16.0573 12.2366 15.9769 12.4611 15.8298 12.64L10.8298 18.64C10.7295 18.761 10.6021 18.8567 10.4578 18.9192C10.3136 18.9818 10.1567 19.0095 9.99981 19Z"
                                    fill="#E8E8E9"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_4121_9068">
                                    <rect width="24" height="24" fill="white"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                </nuxt-link>
                <nuxt-link to="/natal-chart/style/" class="block">
                    <div class="info">
                        <h3>Стиль по натальной карте</h3>
                        <h4>Как одеваться так, чтобы привлекать взгляды окружающих, нравиться людям и производить самое приятное первое впечатление? Давайте узнаем у Асцендента и Венеры в Вашей натальной карте.
                        </h4>
                    </div>
                    <div class="link">
                        <p>Читать</p>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_4121_9068)">
                                <path
                                    d="M9.99981 19C9.76615 19.0005 9.53972 18.9191 9.35981 18.77C9.25855 18.6861 9.17485 18.583 9.11349 18.4666C9.05214 18.3503 9.01435 18.223 9.00227 18.092C8.99019 17.961 9.00408 17.8289 9.04312 17.7033C9.08217 17.5777 9.1456 17.4611 9.22981 17.36L13.7098 12L9.38981 6.63C9.30674 6.52771 9.24471 6.41002 9.20728 6.28368C9.16985 6.15734 9.15775 6.02485 9.17169 5.89382C9.18563 5.76279 9.22533 5.63581 9.2885 5.52017C9.35168 5.40454 9.43708 5.30252 9.53981 5.22C9.64327 5.12897 9.76444 5.0603 9.8957 5.01831C10.027 4.97632 10.1655 4.96192 10.3026 4.976C10.4397 4.99009 10.5724 5.03236 10.6924 5.10016C10.8123 5.16796 10.917 5.25983 10.9998 5.37L15.8298 11.37C15.9769 11.5489 16.0573 11.7734 16.0573 12.005C16.0573 12.2366 15.9769 12.4611 15.8298 12.64L10.8298 18.64C10.7295 18.761 10.6021 18.8567 10.4578 18.9192C10.3136 18.9818 10.1567 19.0095 9.99981 19Z"
                                    fill="#E8E8E9"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_4121_9068">
                                    <rect width="24" height="24" fill="white"/>
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                </nuxt-link>

            </div>
        </div>
    </section>
</template>

<style scoped>
.personal {
    position: relative;
    border: 1px solid var(--dark-select-80);
    border-radius: 24px;
    padding: 48px;
    gap: 32px;
    display: flex;
    flex-direction: column;
    width: 100%;
    overflow: hidden;
    background-image: url("@/assets/images/natals/natal-main-personal-bg.svg");

    .info {
        max-width: 603px;
    }

    img {
        position: absolute;
        right: 0;
        bottom: 0;
        z-index: -1;
    }
}

.wrapper {
    display: flex;
    flex-direction: row;
    flex-wrap: wrap;
    column-gap: 24px;
    row-gap: 32px;
}

.block {
    border-radius: 24px;
    padding: 48px;
    background: var(--dark-select);
    gap: 24px;
    display: flex;
    flex-direction: column;
    justify-content: space-between;
    max-width: 515px;
    width: 100%;
}

.info {
    display: flex;
    flex-direction: column;
    gap: 12px;

    h3 {
        font-weight: 900;
        font-size: 32px;
        line-height: 112%;
        color: var(--dark-select-10);
    }

    h4 {
        font-weight: 400;
        font-size: 17px;
        line-height: 165%;
        color: var(--dark-select-20);
    }
}

.link {
    display: flex;
    gap: 4px;
    align-items: center;
    p {
        font-weight: 500;
        font-size: 17px;
        line-height: 165%;
        color: #f6f6f6;
    }
}
.block:hover {
    .link {
        p {
           color: #ffeb61;
        }
    }
}

@media (max-width: 1100px) {
    .block:nth-child(2) {
        order: 3;
    }
    .wrapper {
        display: flex;
        flex-direction: column;
        row-gap: 32px;
    }
    .block {
        width: 100%;
        max-width: 100%;
        border-radius: 16px;
        padding: 24px;
        position: relative;
    }
    .link {
        position: absolute;
        right: 24px;
        top: 24px;
        p {
            display: none;
        }
    }

    .personal {
        gap: 150px;
        border-radius: 16px;
        padding: 24px;
        background-position: right center;
        background-repeat: no-repeat;
        background-size: cover;

        .link {
            display: none;
        }
    }

    .info {
        h3 {
            font-weight: 900;
            font-size: 20px;
            line-height: 120%;
            color: var(--dark-select-10);
            max-width: 80%;
            text-wrap: balance;
            display: flex;
            justify-content: space-between;
        }

        h4 {
            font-weight: 400;
            font-size: 15px;
            line-height: 160%;
            color: var(--dark-select-20);
            max-width: 610px;
        }
    }
}

@media (max-width: 580px) {
    .personal {
        background-image: url("@/assets/images/natals/natal-main-personal-bg-main.svg");
        background-position: calc(50% - 20px) center;
        background-repeat: no-repeat;
        background-size: cover;

    }
}
</style>
