<template>
    <div class="head_title">
        <h1>Политика конфиденциальности и обработка персональных данных</h1>
        <h2>Общество с ограниченной ответственностью «Цифровая Артель»</h2>
    </div>
    <div class="blocks">
        <div class="block">
            <div class="inner_text">
                <p>Настоящая Политика конфиденциальности персональных данных (далее — «Политика конфиденциальности»,
                    «Политика») устанавливает правила использования персональной информации, получаемой от Пользователей
                    сайта (далее — «Пользователь») Администратором сайта <a
                        href="https://xcards.ru/">https://xcards.ru/</a>
                    (далее — «Администратор сайта»).
                    Настоящая Политика конфиденциальности применяется ко всем Пользователям Сайта.</p>
            </div>
        </div>
        <div class="block">
            <p class="head_">Основные понятия</p>
            <div class="inner_text">
                <p>Администратор сайта — Общество с ограниченной ответственностью «Цифровая Артель», организуют и (или)
                    осуществляет обработку персональных данных, а также определяет цели обработки персональных данных,
                    состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными
                    данными.</p>
                <p>Сайт — https://xcards.ru/</p>
                <p>Пользователь — субъект персональных данных, любое лицо имеющее доступ к Сайту, посредством сети
                    Интернет и использующее Сайт https://xcards.ru/ для ознакомления с контентом Сайта с целью либо без
                    цели отправки Заявки.</p>
                <p>Персональные данные — любая информация, относящаяся к прямо или косвенно определенному или
                    определяемому физическому лицу (субъекту персональных данных).</p>
                <p>Обработка персональных данных — любое действие (операция) или совокупность действий (операций),
                    совершаемых с использованием средств автоматизации или без использования таких средств с
                    персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение
                    (обновление, изменение), извлечение, использование, передачу (распространение, предоставление,
                    доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</p>
                <p>Согласие на обработку персональных данных (далее также - “Согласие”) — принятие Пользователем
                    настоящей Политики конфиденциальности и условий обработки персональных данных посредством заполнения
                    форм на Сайте.</p>
                <p>Конфиденциальность персональных данных — обязательное для соблюдения Администратором сайта или иным
                    получившим доступ к персональным данным лицом требование не допускать их распространения без
                    согласия субъекта персональных данных или наличия иного законного основания.</p>
                <p>Услуги — информационные, консультационные, рекламные услуги, представленные на Сайте.</p>
                <p>Заявка — должным образом оформленный запрос Пользователя на предварительную Консультацию Специалиста
                    Администратора.</p>
                <p>Cookies — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере
                    пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе
                    при попытке открыть страницу соответствующего сайта.</p>
                <p>IP-адрес — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.</p>

            </div>
        </div>

        <div class="block">
            <p class="head_">1. Общие положения</p>
            <div class="inner_text">
                <p>1.1. Использование Пользователем сайта https://xcards.ru/ означает согласие с настоящей Политикой
                    конфиденциальности и условиями обработки персональных данных Пользователя.</p>
                <p>1.2. В случае несогласия с условиями Политики конфиденциальности Пользователь обязан немедленно
                    прекратить использование сервиса и покинуть сайт https://xcards.ru/</p>
                <p>1.3. Администратор сайта не проверяет достоверность персональных данных, предоставляемых
                    Пользователем
                    сайта https://xcards.ru/</p>
                <p>1.4. Сообщая Администратору Сайта свои персональные данные: фамилию, имя, отчество, электронный адрес
                    (e-mail) и номер телефона, Пользователь тем самым:</p>
                <ul>
                    <li><p>Подтверждает, что все указанные им данные принадлежат лично ему;</p></li>
                    <li><p>Подтверждает и признает, что полностью и безоговорочно принимает условия настоящей Политики
                        конфиденциальности, при этом текст Политики конфиденциальности и условия обработки персональных
                        данных
                        ему понятны;</p></li>
                    <li><p>Выражает Согласие на обработку персональных данных без оговорок и ограничений;</p></li>
                    <li><p>Подтверждает, что, давая Согласие, он действует свободно, своей волей и в своем интересе.</p>
                    </li>
                </ul>
                <p>1.5. Согласие Пользователя на обработку персональных данных является конкретным, информированным и
                    сознательным, признается исполненным в простой письменной форме.</p>

            </div>
        </div>

        <div class="block">
            <p class="head_">2. Предмет политики конфиденциальности</p>
            <div class="inner_text">
                <p>2.1. Настоящая Политика конфиденциальности устанавливает обязательства Администратора сайта по
                    неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые
                    Пользователь
                    предоставляет при отправке Заявки на Сайте.</p>
                <p>2.2. Персональные данные Пользователя обрабатывается в соответствии с ФЗ «О персональных данных» №
                    152-ФЗ.</p>
                <p>2.3. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности,
                    предоставляются Пользователем посредством заполнения Заявки на Сайте и могут включать в себя
                    следующую
                    информацию:</p>
                <ul>
                    <li>
                        <p>Фамилия, имя, отчество Пользователя;</p>
                    </li>
                    <li>
                        <p>Контактный телефон Пользователя;</p>
                    </li>
                    <li>
                        <p>Адрес электронной почты (e-mail).</p>
                    </li>
                </ul>
                <p>2.4. Техническая информация не является персональными данными. Администрация сайта использует файлы
                    cookies, которые позволяют идентифицировать Пользователя. Файлы cookies – это текстовые файлы,
                    доступные
                    Администрации сайта, для обработки информации об активности Пользователя, включая информацию о том,
                    какие страницы посещал Пользователь и о времени, которое Пользователь провел на странице. Файлы
                    cookies
                    не содержат личных данных, поэтому их использование не нарушает конфиденциальность. Пользователь
                    может
                    отключить возможность использования файлов cookies в настройках браузера.</p>
                <p>2.5. Также под технической информацией понимается информация, которая автоматически передается
                    Администрации сайта в процессе использования Сайта с помощью установленного на устройстве
                    Пользователя
                    программного обеспечения.</p>
            </div>
        </div>

        <div class="block">
            <p class="head_">3. Цели сбора персональной информации Пользователя</p>
            <div class="inner_text">
                <p>3.1. Целью сбора персональной информации Пользователя является предоставление информационных,
                    консультационных и рекламных услуг Пользователям. Пользователи соглашаются с тем, что Администратор
                    сайта также может использовать их персональные данные для:
                    Идентификация стороны в рамках предоставляемых услуг;</p>
                <ul>
                    <li>
                        <p>Предоставления услуг и клиентской поддержки по запросу Пользователей;</p>
                    </li>
                    <li>
                        <p>Улучшение качества услуг, удобства их использования, разработка и развитие Сайта, устранения
                            технических неполадок или проблем с безопасностью;</p>
                    </li>
                    <li>
                        <p>Информирования Пользователей об услугах, целевом маркетинге, обновлении услуг и рекламных
                            предложениях на основании информационных предпочтений Пользователей;</p>
                    </li>
                    <li>
                        <p>Таргетирование рекламных материалов; рассылки индивидуальных маркетинговых сообщений
                            посредством электронной почты, звонков и SMS;</p>
                    </li>
                    <li>
                        <p>Проведение статистических и иных исследований на основе обезличенных данных;</p>
                    </li>
                </ul>
                <p>3.2. Администрация сайта использует техническую информацию обезличено в целях, указанных в пункте
                    3.1.</p>
            </div>
        </div>

        <div class="block">
            <p class="head_">4. Условия и способы обработки персональной информации Пользователей и ее передачи третьим
                лицам</p>
            <div class="inner_text">
                <p>4.1. Пользователь дает согласие на обработку своих персональных данных посредством отправки Заявки,
                    при
                    этом моментом принятия Согласия является маркировка соответствующего поля в форме Заявки и нажатие
                    на
                    кнопку отправки формы Заявки на Сайте, расположенной по адресу https://xcards.ru/ , а также принятие
                    от
                    Пользователя Заявки по одному из телефонов Администратора, указанных на страницах контактов
                    Сайта;</p>
                <p>4.2. Обработка персональных данных Пользователя означает сбор, запись, систематизацию, накопление,
                    хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение,
                    предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных
                    Пользователя.</p>
                <p>4.3. В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме
                    случаев
                    добровольного предоставления Пользователем информации о себе для общего доступа неограниченному
                    кругу
                    лиц.</p>
                <p>4.4. Администратор сайта вправе передать персональную информацию Пользователя третьим лицам в
                    следующих
                    случаях:</p>
                <ul>
                    <li>
                        <p>Пользователь выразил согласие на такие действия;</p>
                    </li>
                    <li>
                        <p>Передача необходима для использования Пользователем определенной услуги Сайта либо для
                            исполнения
                            определенного договора или соглашения с Пользователем;</p>
                    </li>
                    <li>
                        <p>Передача уполномоченным органам государственной власти Российской Федерации по основаниям и в
                            порядке,
                            установленным законодательством Российской Федерации;</p>
                    </li>
                    <li>
                        <p>В результате обработки персональной информации Пользователя путем ее обезличивания получены
                            обезличенные
                            статистические данные, которые передаются третьему лицу для проведения исследований,
                            выполнения работ
                            или оказания услуг по поручению Администрацией сайта.</p>
                    </li>
                </ul>
                <p>4.5. Администратор сайта имеет право отправлять информационные, в том числе рекламные сообщения, на
                    указанную электронную почту и мобильный телефон Пользователя с его согласия, выраженного посредством
                    совершения им действий, однозначно идентифицирующих этого абонента и позволяющих достоверно
                    передавать
                    ему сообщения.</p>
                <p>4.6. Пользователь вправе в любое время отказаться от получения рекламной и другой информации без
                    объяснения причин отказа путем направления соответствующего сообщения в свободной форме.</p>
                <p>4.7. Получить разъяснения по вопросам обработки персональных данных Пользователя, можно обратившись
                    лично по адресу: 127566, Россия, Москва г, ул. Римского-Корсакова, д. 4.</p>
                <p>либо направив официальный запрос по Почте по адресу: 127566, Россия, Москва г, ул.
                    Римского-Корсакова,
                    д. 4.</p>


            </div>
        </div>

        <div class="block">
            <p class="head_">5. Меры, применяемые для защиты персональной информации Пользователя</p>
            <div class="inner_text">
                <p>5.1. Администратор сайта принимает необходимые и достаточные правовые, организационные и технические
                    меры для защиты персональной информации Пользователя от неправомерного или случайного доступа,
                    уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных
                    действий с ней третьих лиц.</p>
            </div>
        </div>

        <div class="block">
            <p class="head_">6. Срок действия Согласия</p>
            <div class="inner_text">
                <p>6.1. Согласие Пользователя на обработку персональных данных действует бессрочно с момента
                    предоставления
                    данных и может быть отозвано Пользователем путем подачи письменного заявления Администратору сайта с
                    указанием данных, определенных статьей 14 Федерального закона №152-ФЗ «О персональных данных» по
                    адресу:
                    127566, Россия, Москва г, ул. Римского-Корсакова, д. 4.</p>
                <p>6.2. В случае отзыва Пользователем Согласия на обработку персональных данных Администратор сайта
                    вправе
                    продолжить обработку персональных данных без согласия Пользователя при наличии оснований, указанных
                    в
                    пунктах 2-11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального закона №152-ФЗ «О
                    персональных данных».</p>
            </div>
        </div>

        <div class="block">
            <p class="head_">7. Дополнительные условия</p>
            <div class="inner_text">
                <p>7.1. Администратор сайта вправе вносить изменения в настоящую Политику конфиденциальности без
                    согласия Пользователя.</p>
                <p>7.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения, если иное не
                    предусмотрено новой редакцией Политики конфиденциальности. Продолжение использования Сайта после
                    внесения таких изменений подтверждает согласие Пользователя с такими изменениями.</p>
                <p>7.3. Все термины и определения, встречающиеся в тексте Политики конфиденциальности толкуются в
                    соответствии с действующим законодательством РФ (в частности, ФЗ «О персональных данных».) Признание
                    отдельных положений недействительными или не имеющими юридической силы не отменяет действие
                    остальных
                    положений настоящей Политики конфиденциальности.</p>
                <p>7.4. Настоящая Политика конфиденциальности применима исключительно к Сайту, указанному в настоящей
                    Политике. Администратор сайта не несет ответственности за сайты (ресурсы, сервисы) третьих лиц, на
                    которые Пользователь может перейти по ссылкам, доступным на сайтах, указанных в настоящей
                    Политике.</p>
                <p>7.5. Сайт и предоставляемые сервисы могут временно частично или полностью недоступны по причине
                    проведения профилактических или иных работ или по любым другим причинам технического характера.</p>
                <p>7.6. Все возможные споры, вытекающие из отношений, регулируемых настоящей Политикой, разрешаются в
                    порядке, установленном действующим законодательством Российской Федерации, по нормам российского
                    права.</p>
                <p>7.7. Соблюдение досудебного (претензионного) порядка урегулирования споров является обязательным.</p>
            </div>
        </div>

        <div class="block">
            <p class="head_">8. Реквизиты Администратора</p>
            <div class="inner_text">
                <p>Общество с ограниченной ответственностью «Цифровая Артель»<br> Адрес: 127566, Россия, Москва г, ул.
                    Римского-Корсакова, д. 4.<br> ОГРН 1237700778985<br> ИНН 9715465762<br> КПП 771501001</p>

            </div>
        </div>
    </div>
</template>

<style scoped>
ul {
    margin-left: 30px;

    li {
        list-style-type: disc;
    }
}

.blocks {
    display: flex;
    flex-direction: column;
    gap: 48px;
    margin-bottom: 80px;

    .block {
        display: flex;
        flex-direction: column;
        gap: 24px;
        text-align: start;
    }

    .head_ {
        font-weight: 700;
        font-size: 20px;
        line-height: 120%;
        color: var(--dark-select-10);
    }

    .inner_text {
        display: flex;
        flex-direction: column;
        gap: 20px;

        p {
            font-weight: 400;
            font-size: 19px;
            line-height: 147%;
            color: var(--dark-select-10);

            a {
                text-decoration: underline;
                text-decoration-skip-ink: none;
                color: var(--yellow);
            }
        }
    }
}

.head_title {
    margin-bottom: 48px;

    h1 {
        font-weight: 900;
        font-size: 40px;
        line-height: 110%;
        color: var(--dark-select-10);
        margin-bottom: 24px;
        text-align: start;
    }

    h2 {
        font-weight: 700;
        font-size: 20px;
        line-height: 120%;
        color: var(--dark-select-10);
        text-align: start;
    }
}

@media (max-width: 1100px) {
    .blocks {
        display: flex;
        flex-direction: column;
        gap: 24px;

        .block {
            display: flex;
            flex-direction: column;
            gap: 16px;
            text-align: start;
        }

        .head_ {
            font-weight: 700;
            font-size: 16px;
            line-height: 125%;
            color: var(--dark-select-10);
        }

        .inner_text {
            gap: 16px;

            p {
                font-weight: 400;
                font-size: 15px;
                line-height: 160%;
                color: var(--dark-select-10);

                a {
                    text-decoration: underline;
                    text-decoration-skip-ink: none;
                    color: var(--yellow);
                }
            }
        }
    }

    .head_title {
        margin-bottom: 24px;

        h1 {
            font-weight: 900;
            font-size: 24px;
            line-height: 117%;
            color: var(--dark-select-10);
            margin-bottom: 16px;
        }

        h2 {
            font-weight: 700;
            font-size: 16px;
            line-height: 125%;
            color: var(--dark-select-10);
        }
    }
}
</style>
<script setup lang="ts">
</script>
