<template>
    <div class="head_title">
        <h1>Согласие на обработку персональных данных</h1>
        <h2>Общество с ограниченной ответственностью «Цифровая Артель»</h2>
    </div>
    <div class="blocks">
        <div class="block">
            <div class="inner_text">
                <p>Пользователь сайта https://xcards.ru/ (далее «Субъект персональных данных») дает согласие ООО
                    «Цифровая Артель» (ИНН: 9715465762) далее «Оператор», на обработку персональных данных, приведенных
                    в пункте 2 настоящего согласия на следующих условиях:</p>
                <ul>
                    <li>
                        <p>
                            В соответствии со статьей 9 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных
                            данных»
                            субъект персональных данных дает согласие на обработку Оператором своих персональных данных,
                            с
                            целью исполнения гражданско-правового договора.</p>
                    </li>
                    <li>
                        <p>Перечень персональных данных, на обработку которых дается согласие:</p>
                        <ul>
                            <li>
                                <p>фамилия, имя и отчество (при наличии);</p>
                            </li>
                            <li>
                                <p>пол;</p>
                            </li>
                            <li>
                                <p>дата и место рождения;</p>
                            </li>
                            <li>
                                <p>контактная информация (номер телефона, электронная почта);</p>
                            </li>
                        </ul>
                    </li>
                    <li>
                        <p>Оператор вправе осуществлять следующие действия с указанными выше персональными данными путем
                            автоматизированной обработки и обработки без использования средств автоматизации: сбор;
                            систематизацию; накопление; хранение; уточнение (обновление, изменение); использование;
                            распространение/передачу; обезличивание; блокирование; уничтожение.</p>
                    </li>
                    <li>
                        <p>Субъект проинформирован(а), что Оператор гарантирует обработку моих персональных данных в
                            соответствии с действующим законодательством Российской Федерации как неавтоматизированным,
                            так и автоматизированным способами.</p>
                    </li>
                    <li>
                        <p>Субъект подтверждает, что, подписывая настоящее согласие, Субъект действует по собственной
                            воле и в своих интересах.
                        </p>
                    </li>
                    <li>
                        <p>Субъект подтверждает получение им согласия третьих лиц на передачу их персональных данных на
                            обработку.</p>
                    </li>
                    <li>
                        <p>Субъект персональных данных имеет право на доступ к его персональным данным в порядке,
                            определенном статьей 14 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных
                            данных».</p>
                    </li>
                    <li>
                        <p>Субъект ознакомлен, что данное согласие является бессрочным и может быть отозвано
                            посредством направления Субъектом уведомления на электронный адрес, указанный на сайте
                            https://xcards.ru/ в разделе «Контакты». В случае отзыва Согласия на обработку персональных
                            данных Организация в праве продолжить обработку персональных данных без согласия Субъекта
                            при наличии оснований, указанных в пунктах 2.11. части 1 статьи 6, части 2 статьи 10 и части
                            2 статьи 11 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных».</p>
                    </li>
                    <li>
                        <p>Сведения об информационных ресурсах Оператора, посредством которых будет осуществляться
                            предоставление доступа неограниченному кругу лиц и иные действия с персональными данными
                            субъекта персональных данных: информационная система сайта https://xcards.ru/.</p>
                    </li>
                    <li>
                        <p>Согласие может быть отозвано мною в любое время на основании моего письменного заявления.</p>
                    </li>
                </ul>
            </div>

        </div>

        <div class="block">
            <p class="head_">Данные об операторе персональных данных:</p>
            <div class="inner_text">
                <p>Общество с ограниченной ответственностью «Цифровая Артель» <br>
                ОГРН 1237700778985<br>
                ИНН 9715465762<br>
               КПП 771501001</p>
            </div>
        </div>
    </div>
</template>

<style scoped>
ul {
    margin-left: 30px;

    li {
        list-style-type: decimal;
        margin-bottom: 15px;

        ul {
            li {
                list-style-type: disc;
            }
        }
    }
}

.blocks {
    display: flex;
    flex-direction: column;
    gap: 48px;
    margin-bottom: 80px;

    .block {
        display: flex;
        flex-direction: column;
        gap: 24px;
        text-align: start;
    }

    .head_ {
        font-weight: 700;
        font-size: 20px;
        line-height: 120%;
        color: var(--dark-select-10);
    }

    .inner_text {
        display: flex;
        flex-direction: column;
        gap: 20px;

        p {
            font-weight: 400;
            font-size: 19px;
            line-height: 147%;
            color: var(--dark-select-10);

            a {
                text-decoration: underline;
                text-decoration-skip-ink: none;
                color: var(--yellow);
            }
        }
    }
}

.head_title {
    margin-bottom: 48px;

    h1 {
        font-weight: 900;
        font-size: 40px;
        line-height: 110%;
        color: var(--dark-select-10);
        margin-bottom: 24px;
        text-align: start;
    }

    h2 {
        font-weight: 700;
        font-size: 20px;
        line-height: 120%;
        color: var(--dark-select-10);
        text-align: start;
    }
}

@media (max-width: 1100px) {
    .blocks {
        display: flex;
        flex-direction: column;
        gap: 24px;

        .block {
            display: flex;
            flex-direction: column;
            gap: 16px;
            text-align: start;
        }

        .head_ {
            font-weight: 700;
            font-size: 16px;
            line-height: 125%;
            color: var(--dark-select-10);
        }

        .inner_text {
            gap: 16px;

            p {
                font-weight: 400;
                font-size: 15px;
                line-height: 160%;
                color: var(--dark-select-10);

                a {
                    text-decoration: underline;
                    text-decoration-skip-ink: none;
                    color: var(--yellow);
                }
            }
        }
    }

    .head_title {
        margin-bottom: 24px;

        h1 {
            font-weight: 900;
            font-size: 24px;
            line-height: 117%;
            color: var(--dark-select-10);
            margin-bottom: 16px;
        }

        h2 {
            font-weight: 700;
            font-size: 16px;
            line-height: 125%;
            color: var(--dark-select-10);
        }
    }
}
</style>
<script setup lang="ts">
</script>
