<template>
    <div class="head_title">
        <h1>Договор публичной оферты на оказание услуг по составлению гороскопов и натальных карт</h1>
        <h2>Общество с ограниченной ответственностью «Цифровая Артель»</h2>
    </div>
    <div class="blocks">
        <div class="block">
            <p class="head_">1. Общие положения </p>
            <div class="inner_text">
                <p>1.1. Настоящее предложение (далее – Оферта) является официальным предложением Исполнителя о
                    заключении Договора на оказание услуг по составлению гороскопов и натальных карт (далее –
                    Услуги). </p>
                <p>1.2. В соответствии со статьей 437 Гражданского кодекса Российской Федерации (далее – ГК РФ)
                    настоящая Оферта является публичным документом и после принятия условий приобретает силу договора на
                    условиях, изложенных в ней. </p>
                <p>1.3. Предоставление персональных данных Заказчиком в целях оказания Услуг является добровольным и
                    осуществляется в соответствии с Политикой конфиденциальности. </p>
            </div>
        </div>

        <div class="block">
            <p class="head_">2.	Предмет оферты </p>
            <div class="inner_text">
                <p>2.1. Исполнитель обязуется предоставить Заказчику следующие Услуги: </p>
                <ul>
                    <li><p>Составление гороскопа по запросу Заказчика; </p></li>
                    <li><p>Составление натальной карты по запросу Заказчика. </p></li>
                </ul>
                <p>2.2. Заказчик обязуется оплатить и принять оплаченные Услуги.</p>
            </div>
        </div>

        <div class="block">
            <p class="head_">3.	Условия оказания услуг</p>
            <div class="inner_text">
                <p>3.1. Для получения Услуг Заказчик оставляет заявку на сайте Исполнителя, указав необходимые данные для составления гороскопа или натальной карты. </p>
                <p>3.2. Сроки выполнения Услуг согласовываются индивидуально с каждым Заказчиком. </p>
                <p>3.3. Стоимость Услуг указывается на сайте Исполнителя и зависит от объема и сложности заказываемых гороскопов и натальных карт. </p>
            </div>
        </div>

        <div class="block">
            <p class="head_">4. Момент заключения и срок действия Договора</p>
            <div class="inner_text">
                <p>4.1. Полным и безоговорочным принятием условий Договора (далее «Акцепт») является факт осуществления Заказчиком оплаты (составление Заказчиком заявкина сайте Исполнителя).</p>
                <p>4.2. Акцепт Оферты означает, что Заказчик согласен со всеми положениями настоящей Оферты, и равносилен заключению Договора между Заказчиком и Исполнителем.</p>
                <p>4.3. Настоящий Договор прекращает свое действие после выполнения двусторонних обязательств Исполнителем и Заказчиком.</p>
            </div>
        </div>

        <div class="block">
            <p class="head_">5.	Ответственность сторон</p>
            <div class="inner_text">
                <p>5.1. Стороны несут ответственность за неисполнение или ненадлежащее исполнение своих обязательств по настоящей Оферте в соответствии с действующим законодательством РФ.</p>
                <p>5.2. Исполнитель гарантирует конфиденциальность и анонимность предоставляемой ему личной информации до и после оказания услуги, если на иное не было дано устное или письменное разрешение самого Заказчика.</p>
                <p>5.3. Исполнитель не несет прямой личной ответственности за дальнейшее использование (или неиспользование) Заказчиком полученной информации (гороскопа и натальной карты).</p>
                <p>5.4. Исполнитель не несет ответственности за несоответствие оказанных Услуг ожиданиям Заказчика или за его субъективную оценку гороскопа и/или натальной карты, т. к. данные причины не являются основанием считать Услуги оказанными не качественно или не в согласованном объеме.</p>
                <p>5.5. Исполнитель не несет ответственности за ненадлежащее оказание Услуг, если оно явилось следствием недостоверности или недостаточности предоставленных Заказчиком сведений.</p>
                <p>5.6. Исполнитель имеет право не пояснять Заказчику методы и тайны своих расчетов, на основании которых Исполнитель выносит суждение.</p>
                <p>5.7. Заказчик обязуется до момента оплаты Услуг Исполнителя ознакомиться с содержанием и условиями настоящего Договора.</p>
                <p>5.8. Заказчик несет ответственность за предоставление достоверных данных при оформлении заявки на получение Услуг. </p>
                <p>5.9. Заказчик берет на себя ответственность за использование или не использование информации, полученной в результате оказания Услуг.</p>
                <p>5.10. Стороны не несут ответственности за полное или частичное неисполнение своих обязательств, если это явилось следствием наступления форс-мажорных обстоятельств.  В случае возникновения форс-мажорных обстоятельств срок исполнения обязательств по Договору обеими Сторонами отодвигается на срок, в течение которого продолжается действие этих обстоятельств и их последствий.</p>
                <p>5.11. Заказчик согласен с тем, что оказываемые Услуги ограничиваются исключительно предоставлением информации (гороскопа и натальной карты), полученной астрологическими методами, помимо этого, что Исполнитель не несет ответственности за дальнейшее использование этой информации Заказчиком.</p>
            </div>
        </div>

        <div class="block">
            <p class="head_">6.	Разрешение споров </p>
            <div class="inner_text">
                <p>6.1. Все споры и разногласия, возникающие между сторонами по поводу исполнения настоящей Оферты, разрешаются путем переговоров. </p>
            </div>
        </div>

        <div class="block">
            <p class="head_">7.	Прочие условия </p>
            <div class="inner_text">
                <p>7.1. Если настоящий Договор расторгается Исполнителем в одностороннем порядке до непосредственного оказания Услуг, то оплата возвращается Заказчику в размере 100% от произведенной суммы предоплаты.</p>
                <p>7.2. Если настоящий Договор расторгается Заказчиком в одностороннем порядке до непосредственно оказания Услуг, то оплата Исполнителем не возвращается.</p>
                <p>7.3. Если Заказчик по своей вине не может воспользоваться предоставленными им услугами Исполнителя, Исполнитель не возвращает средства, перечисленные Заказчиком в счёт оплаты Услуги.</p>
                <p>7.4. Настоящая Оферта вступает в силу с момента ее опубликования на сайте Исполнителя и действует до момента ее отзыва. </p>
                <p>7.5. Исполнитель оставляет за собой право вносить изменения в настоящую Оферту без предварительного уведомления Заказчика. </p>
            </div>
        </div>

        <div class="block">
            <p class="head_">8.	Контактная информация </p>
            <div class="inner_text">
                <p>Исполнитель: ООО «Цифровая Артель»,</p>
                <p>Юридический адрес: 127566, Россия, Москва г, ул. Римского-Корсакова, 4</p>
                <p>ОГРН 1237700778985</p>
                <p>ИНН 9715465762</p>
                <p>КПП 771501001</p>
            </div>
        </div>
    </div>
</template>

<style scoped>
ul {
    margin-left: 30px;

    li {
        list-style-type: disc;
    }
}

.blocks {
    display: flex;
    flex-direction: column;
    gap: 48px;
    margin-bottom: 80px;

    .block {
        display: flex;
        flex-direction: column;
        gap: 24px;
        text-align: start;
    }

    .head_ {
        font-weight: 700;
        font-size: 20px;
        line-height: 120%;
        color: var(--dark-select-10);
    }

    .inner_text {
        display: flex;
        flex-direction: column;
        gap: 20px;

        p {
            font-weight: 400;
            font-size: 19px;
            line-height: 147%;
            color: var(--dark-select-10);

            a {
                text-decoration: underline;
                text-decoration-skip-ink: none;
                color: var(--yellow);
            }
        }
    }
}

.head_title {
    margin-bottom: 48px;

    h1 {
        font-weight: 900;
        font-size: 40px;
        line-height: 110%;
        color: var(--dark-select-10);
        margin-bottom: 24px;
        text-align: start;
    }

    h2 {
        font-weight: 700;
        font-size: 20px;
        line-height: 120%;
        color: var(--dark-select-10);
        text-align: start;
    }
}

@media (max-width: 1100px) {
    .blocks {
        display: flex;
        flex-direction: column;
        gap: 24px;

        .block {
            display: flex;
            flex-direction: column;
            gap: 16px;
            text-align: start;
        }

        .head_ {
            font-weight: 700;
            font-size: 16px;
            line-height: 125%;
            color: var(--dark-select-10);
        }

        .inner_text {
            gap: 16px;

            p {
                font-weight: 400;
                font-size: 15px;
                line-height: 160%;
                color: var(--dark-select-10);

                a {
                    text-decoration: underline;
                    text-decoration-skip-ink: none;
                    color: var(--yellow);
                }
            }
        }
    }

    .head_title {
        margin-bottom: 24px;

        h1 {
            font-weight: 900;
            font-size: 24px;
            line-height: 117%;
            color: var(--dark-select-10);
            margin-bottom: 16px;
        }

        h2 {
            font-weight: 700;
            font-size: 16px;
            line-height: 125%;
            color: var(--dark-select-10);
        }
    }
}
</style>
<script setup lang="ts">
</script>
