<template>
    <div class="head_title">
        <h1>ПОЛОЖЕНИЕ
            об обработке и защите персональных данных клиентов
            Общества с ограниченной ответственностью «Цифровая Артель»</h1>

    </div>
    <div class="blocks">
        <div class="block">
            <p class="head_">1. ОБЩИЕ ПОЛОЖЕНИЯ, ОСНОВНЫЕ ПОНЯТИЯ, ТЕРМИНЫ</p>
            <div class="inner_text">
                <p>1.1. Настоящее положение об обработке и защите персональных данных клиентов (далее «Положение»)
                    Обществом с ограниченной ответственностью «Цифровая Артель» (далее по тексту так же – «Общество» и
                    «Оператор», соответственно) является локальным нормативным актом, принятым с учетом требований, в
                    частности Федерального закона от 27.07.2006 №152 – ФЗ «О персональных данных» (далее – «Закон о
                    персональных данных»).</p>
                <p>1.2. В Положении используются термины и определения в соответствии с их значениями, определенными в
                    Законе о персональных данных. Основные понятия, используемые в Положении:</p>
                <p>1.2.1. Оператор – ООО «Цифровая Артель» (ИНН: 9715465762, ОГРН: 1237700778985)</p>
                <p>1.2.2. Клиент – физическое лицо (представитель юридического лица), потребитель услуг, предоставляемых
                    Обществом, субъект персональных данных.</p>
                <p>1.2.3. Услуги – действия Оператора, обусловленные условиями заключенного с клиентом договора об
                    оказании услуг.</p>
                <p>1.2.4. Персональные данные – информация, сохраненная в любом формате, относящаяся к определенному или
                    определяемому на основании такой информации физическому лицу (субъекту персональных данных), которая
                    сама по себе или в сочетании с другой информацией, имеющейся в распоряжении Оператора, позволяет
                    идентифицировать личность Клиента и/или Сотрудника (Соискателя, Уволенного сотрудника).</p>
                <p>1.2.5. Информационная система персональных данных – информационная система, представляющая собой
                    совокупность персональных данных, содержащихся в базе данных, а также информационных технологий и
                    технических средств, позволяющих осуществлять обработку таких персональных данных с использованием
                    средств автоматизации или без использования таких средств.</p>
                <p>1.2.6. Обработка персональных данных – действия (операции) с персональными данными, включая сбор,
                    систематизацию, накопление, хранение, уточнение (обновление, изменение), использование,
                    распространение, передачу, обезличивание, блокирование, уничтожение персональных данных.</p>
                <p>1.2.7. Передача персональных данных – действия, направленные на передачу персональных данных
                    определенному кругу лиц.</p>
                <p>1.2.8. Распространение персональных данных – действия, направленные на ознакомление с персональными
                    данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах
                    массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление
                    доступа к персональным данным каким-либо иным способом.</p>
                <p>1.2.9. Использование персональных данных – действия (операции) с персональными данными, совершаемые
                    оператором в целях принятия решений или совершения иных действий, порождающих юридические
                    последствия в отношении субъекта персональных данных или других лиц либо иным образом затрагивающих
                    права и свободы субъекта персональных данных или других лиц.</p>
                <p>1.2.10. Конфиденциальность персональных данных – обязательное для соблюдения оператором или иным
                    получившим доступ к персональным данным лицом требование не допускать их распространение без
                    согласия субъекта персональных данных или наличия иного законного основания.</p>
                <p>1.2.11. Защита персональных данных – комплекс мер технического, организационного и
                    организационно-технического, правового характера, направленных на защиту сведений, относящихся к
                    определенному или определяемому на основании такой информации физическому лицу (субъекту
                    персональных данных).</p>
                <p>1.2.12. Уничтожение персональных данных – действия, в результате которых становится невозможным
                    восстановить содержание персональных данных в информационной системе персональных данных
                    работникови (или) врезультате которых уничтожаются материальные носители персональных данных.</p>
                <p>1.2.13. Обезличивание персональных данных – действия, в результате которых становится невозможным без
                    использования дополнительной информации определить принадлежность персональных данных конкретному
                    субъекту персональных данных.</p>
                <p>1.2.14. Информация – сведения (сообщения, данные), независимо от формы их представления.</p>
                <p>1.2.15. Документированная информация – зафиксированная на материальном носителе путем
                    документирования информация с реквизитами, позволяющими определить такую информацию или ее
                    материальный носитель.</p>
                <p>1.2.16. Персональные данные работника – информация, необходимая работодателю в связи с трудовыми
                    отношениями и касающаяся конкретного работника.d</p>
                <p>1.3. Основной целью Положения является защита персональных данных работников и клиентов Общества от
                    несанкционированного доступа, неправомерного их использования или утраты, а также установление
                    ответственности лиц, имеющих доступ к персональным данным работников, за невыполнение требований
                    норм, регулирующих обработку и защиту персональных данных.</p>
                <p>1.4. Настоящее Положение утверждается руководителем Общества и действует до его отмены приказом или
                    до введения нового Положения.</p>
                <p>1.5. Внесение изменений в Положение производится приказом руководителя Общества. Изменения вступают в
                    силу с момента подписания соответствующего приказа.</p>
            </div>

        </div>
        <div class="block">
            <p class="head_">2. Категории субъектов персональных данных</p>
            <div class="inner_text">
                <p>2.1. К субъектам, персональные данные которых обрабатываются Оператором в соответствии с Положением,
                    относятся:
                    <br> – клиенты/представители клиентов Общества;
                    <br> – иные лица, персональные данные которых Оператор обязан обрабатывать в соответствии с
                    законодательством Российской Федерации.</p>
            </div>
        </div>
        <div class="block">
            <p class="head_">3. Цели обработки персональных данных</p>
            <div class="inner_text">
                <p>3.1. Целями обработки персональных данных Оператором являются:
                    <br> – выполнение требований законодательства по определению порядка обработки и защиты данных
                    физических
                    лиц, являющихся клиентами или контрагентами Оператора, заполнению первичной статистической
                    документации, ведению кадрового и налогового учета;
                    <br> – осуществление прав и законных интересов Оператора в рамках осуществления хозяйственной
                    деятельности;
                    <br> – исполнения обязанностей по договору оказания услуг, одной из сторон которого является субъект
                    персональных данных.</p>
                <p>3.2. Персональные данные Клиентов обрабатываются в целях предоставления Оператором услуг согласно
                    условиям заключенного с клиентом договора возмездного оказании услуг; хранения данных клиентов;
                    предоставления консультаций, иной информации о деятельности и услугах Общества по запросам клиента,
                    исполнения иных договорных обязательств, одной из сторон которых является Клиент. Оператор собирает
                    данные только в объеме, необходимом для достижения названных целей.</p>
                <p>3.3. Персональные данные не могут быть использованы в целях причинения имущественного и морального
                    вреда гражданам, затруднения реализации прав и свобод граждан Российской Федерации.</p>
            </div>
        </div>
        <div class="block">
            <p class="head_">4. Состав и получение персональных данных Клиентов</p>
            <div class="inner_text">
                <p>4.1. Сведения о персональных данных Клиентов являются конфиденциальными.</p>
                <p>4.2. К персональным данным относятся:</p>
                <div class="scroll">
                    <table>
                        <tr>
                            <td><b>Персональные данные клиента</b></td>
                            <td>
                                – фамилия, имя, отчество;<br>
                                – дата и место рождения;<br>
                                – номер контактного телефона;<br>
                                – адрес электронной почты;<br>
                                – адрес места жительства;<br>
                                – биографические сведения;<br>
                                – сведения о семейном положении, детях.
                            </td>
                            <td>
                                Персональные данные Клиентов содержатся в документах информационных системах, включая
                                следующие:<br>
                                – информационная система «1С»;<br>
                                – административная система сайта;<br>
                                – договор возмездного оказания услуг;<br>
                                – приложения к вышеуказанным договорам;<br>
                                – дополнительные соглашения к вышеуказанным договорам;<br>
                                – акты оказанных услуг;<br>
                                – счета на оплату;<br>
                                – электронные письма;<br>
                                – переписка в мессенджере;<br>
                                – доверенности;<br>
                                – нотариально заверенные копии документов;<br>
                                – иные документы, направляемые в адрес Клиента или подписываемые Клиентом.
                            </td>
                        </tr>
                    </table>
                </div>
                <p>4.3. Все персональные данные Клиентов работники Оператора получают непосредственно от субъектов
                    персональных данных – Клиентов.</p>
                <p>4.4. Оператор не осуществляет обработку специальных категорий персональных данных, касающихся
                    расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений,
                    интимной жизни, за исключением случаев, предусмотренных законодательством Российской Федерации.</p>
            </div>
        </div>

        <div class="block">
            <p class="head_">5. Порядок и условия обработки персональных данных</p>
            <div class="inner_text">
                <p>5.1. До начала обработки персональных данных Оператор обязан уведомить Федеральную службу по надзору
                    в сфере связи, информационных технологий и массовых коммуникаций о намерении осуществлять обработку
                    персональных данных.</p>
                <p>5.2. Правовым основанием обработки персональных данных является Федеральный закон от 27.07.2006 №
                    152-ФЗ «О персональных данных».</p>
                <p>5.3. Обработка персональных данных осуществляется с соблюдением принципов и условий, предусмотренных
                    законодательством в области персональных данных и настоящим Положением.</p>
                <p>5.4. Обработка персональных данных Оператором выполняется следующими способами:
                    <br>– неавтоматизированная обработка персональных данных;
                    <br> – автоматизированная обработка персональных данных с передачей полученной информации по
                    информационно-телекоммуникационным сетям или без таковой;
                    <br>– смешанная обработка персональных данных.</p>
                <p>5.5. Обработка персональных данных Оператором осуществляется с согласия субъекта персональных данных
                    на обработку его персональных данных, если иное не предусмотрено законодательством в области
                    персональных данных.</p>
                <p>5.6. Обработка персональных данных, разрешенных субъектом персональных данных для распространения,
                    осуществляется с соблюдением запретов и условий, предусмотренных ст. 10.1 Закона о персональных
                    данных. Согласие на обработку таких персональных данных оформляется отдельно от других согласий на
                    обработку персональных данных.</p>
                <p>5.7. К обработке персональных данных Клиентов, Работников, Соискателей и Уволенных работников могут
                    иметь доступ только работники Оператора, допущенные к работе с персональными данными, ознакомленные
                    под подпись с настоящим Положением и иными локальными актами, регулирующими обработку и защиту
                    персональных данных.</p>
                <p>5.8. Перечень сотрудников, имеющих право доступа к персональным данным (далее – Перечень),
                    определяется приказом Оператора на основании должностных обязанностей сотрудников и производственной
                    необходимости. С указанным Перечнем сотрудники должны быть ознакомлены под подпись.</p>
                <p>5.9. Документы, содержащие персональные данные Клиентов хранятся в административной системе сайта
                    https://xcards.ru/, в условиях, исключающих доступ к ним посторонних лиц.</p>
                <p>5.10. Оператор не осуществляет трансграничную передачу персональных данных.</p>
                <p>5.11. Обработка персональных данных осуществляется путем сбора, записи, систематизации, накопления,
                    хранения, уточнения (обновления, изменения), извлечения, использования, передачи (распространение,
                    предоставление, доступ), обезличивания, блокирования, удаления, уничтожения персональных данных, в
                    том числе с помощью средств вычислительной техники.</p>
                <p>5.12. Сбор, запись, систематизация, хранение, накопление и уточнение (обновление, изменение)
                    персональных данных осуществляются посредством:
                    <br> – получения оригиналов документов либо их копий;
                    <br> – копирования оригиналов документов;
                    <br> – внесения сведений в учетные формы на бумажных и электронных носителях;
                    <br> – создания документов, содержащих персональные данные, на бумажных и электронных носителях;
                    <br> – внесения персональных данных в информационные системы персональных данных.</p>
                <p>5.13. Общество использует следующие информационные системы:
                    <br> – корпоративная электронная почта;
                    <br> – система электронного документооборота;
                    <br> – система нормативно-справочной информации;
                    <br>– информационный портал.</p>
                <p>5.14. Передача (распространение, предоставление, доступ) персональных данных субъектов персональных
                    данных осуществляется в случаях и в порядке, предусмотренных законодательством в области
                    персональных данных и настоящим Положением.</p>
            </div>

        </div>

        <div class="block">
            <p class="head_">6. Защита персональных данных от несанкционированного доступа</p>
            <div class="inner_text">
                <p>6.1. Оператор обязан при обработке персональных данных принимать необходимые организационные и
                    технические меры для защиты персональных данных от несанкционированного или случайного доступа к
                    ним, уничтожения, изменения, блокирования, копирования, распространения персональных данных, а также
                    от иных неправомерных действий.</p>
                <p>6.2. С целью защиты персональных данных соответствующими приказами назначаются:
                    <br> – работник, ответственный за организацию обработки персональных данных;
                    <br> – форма согласия на обработку персональных данных, форма согласия на обработку персональных
                    данных, разрешенных субъектом персональных данных для распространения;
                    <br> – иные локальные нормативные акты, принятые в соответствии с требованиями законодательства в
                    области персональных данных.</p>
                <p>6.3. Работники, которые занимают должности, предусматривающие обработку персональных данных,
                    допускаются к ней после подписания соглашения об их неразглашении.</p>
                <p>6.4. Для эффективной защиты персональных данных Оператором предпринимаются следующие меры:</p>
                <p>6.4.1. Оператор и его сотрудники соблюдают порядок получения, учета и хранения материальных носителей
                    персональных данных;</p>
                <p>6.4.2. Применяются организационные и технические меры по обеспечению безопасности персональных данных
                    при их обработке в информационных системах персональных данных, необходимые для выполнения
                    требований к защите персональных данных;</p>
                <p>6.4.3. Оператором определяются угрозы безопасности персональных данных при их обработке в
                    информационных системах персональных данных;</p>
                <p>6.4.4. Работники Оператора, ответственные за обработку персональных данных, а также сотрудники, чьи
                    обязанности связаны с получением, обработкой и защитой персональных данных должны быть ознакомлены
                    настоящим Положением под подпись. Кроме того, перечисленные сотрудники должны быть ознакомлены с
                    положениями законодательства Российской Федерации о персональных данных, в том числе с требованиями
                    к защите персональных данных, иными локальными актами Оператора в отношении обработки персональных
                    данных, и проходят соответствующий инструктаж и/или обучение;</p>
                <p>6.4.5. Работники, виновные в нарушении норм, регулирующих получение, обработку и защиту персональных
                    данных, привлекаются к дисциплинарной ответственности;</p>
                <p>6.4.6. Допуск к персональным данным Клиентов работника Оператора, не прошедшего инструктаж,
                    запрещается.</p>
                <p>6.4.7. Документы, содержащие персональные данные на бумажном носителе, хранятся в помещении офиса
                    Оператора по адресу: 127566, Россия, Москва г, ул. Римского-Корсакова, д. 4, где обеспечивается
                    защита от несанкционированного доступа к ним.</p>
                <p>6.5. Защита доступа к электронным базам данных, содержащим персональные данные Клиентов и Работников,
                    обеспечивается:
                    <br> – использованием антивирусного программного обеспечения;
                    <br> – использованием лицензионных программных продуктов, предотвращающих несанкционированный доступ
                    третьих лиц к персональным данным;
                    <br> – использованием информационных систем, имеющих дополнительную систему защиты данных;
                    <br> – доступ к персональной информации, содержащейся в информационных системах Оператора,
                    осуществляется
                    по индивидуальным паролям. Предоставление доступа к учетной записи иным лицам не допускается;
                    <br> – передачей данных по защищенным каналам связи;
                    <br> – ведением учета материальных носителей информации;
                    <br> – выявлением фактов несанкционированного доступа к персональным данным и принятием
                    соответствующих
                    мер;
                    <br> – разработкой и установлением правил доступа к персональным данным, обрабатываемым в
                    информационных
                    системах персональных данных, а также обеспечением регистрации и учета всех действий, совершаемых с
                    персональными данными в информационных системах персональных данных;
                    <br> – установлением физической охраны информационных систем (технических средств и носителей
                    информации),
                    предусматривающей контроль доступа в помещения информационных систем посторонних лиц, наличием
                    надежных препятствий для несанкционированного проникновения в помещения информационных систем и
                    хранилище носителей информации:
                    <br> – работники Оператора, обрабатывающие персональные данные, периодически проходят обучение
                    требованиям
                    законодательства в области персональных данных;
                    <br> – в должностные инструкции работников Оператора, обрабатывающих персональные данные,
                    включаются, в
                    частности, положения о необходимости сообщать о любых случаях несанкционированного доступа к
                    персональным данным.</p>
                <p>6.6. Копировать и делать выписки персональных данных разрешается исключительно в служебных целях.</p>
                <p>6.7. Работникам Оператора запрещается выносить вышеуказанную информацию за пределы рабочего места на
                    бумажных, машиночитаемых и иных носителях за исключением случаев, когда это необходимо в силу
                    производственной необходимости для выполнения работников своих должностных обязанностей.</p>
                <p>6.8. При работе с персональными данными работникам Оператора следует соблюдать меры, предупреждающие
                    и ограничивающие доступ к указанной информации не уполномоченных на ее получение лиц. В том числе:
                    <br> – не передавать свой пароль от входа в информационную систему третьим лицам;
                    <br> – не допускать хранения в открытом доступе документов, содержащих конфиденциальную информацию;
                    <br> – осуществлять хранение архивов документов в помещениях с ограниченным доступом, в
                    закрывающихся на
                    ключ шкафах/сейфах в течение установленного нормативно-правовыми актами Российской Федерации срока;
                    <br> – после истечения, установленного нормативно-правовыми актами Российской Федерации, срока
                    хранения
                    документы уничтожаются вручную, либо с использование специального оборудования, о чем составляется
                    соответствующий акт.</p>
                <p>6.9. Нарушение данных обязанностей считается совершенным, когда сведения, содержащие персональные
                    данные и другую конфиденциальную информацию, стали известны лицам, которые не должны располагать
                    такой информацией.</p>
                <p>6.10. По разрешению Оператора раскрытие конфиденциальной информации (персональных данных) третьим
                    лицам возможно в случае привлечения их к деятельности, требующей знания такой информации, и только в
                    том объеме, который необходим для реализации целей и задач, а также при условии принятия ими на себя
                    обязательства не разглашать полученные сведения.</p>
                <p>6.11. В случаях, установленных законодательством Российской Федерации, раскрытие конфиденциальной
                    информации возможно сотрудникам правоохранительных органов, при наличии законных оснований и
                    надлежащим образом оформленных документов,подтверждающих такие основания.</p>
            </div>
            <div class="block">
                <p class="head_">7. Сроки обработки и хранения персональных данных</p>
                <div class="inner_text">
                    <p>7.1. Обработка персональных данных прекращается Оператором в следующих случаях:
                        <br> – при выявлении факта неправомерной обработки персональных данных. Срок прекращения
                        обработки – в течение 3 (трех) рабочих дней с даты выявления такого факта;
                        <br> – при достижении целей их обработки;
                        <br> – истечении срока действия или при отзыве субъектом персональных данных согласия на
                        обработку его персональных данных, если в соответствии с Законом о персональных данных их
                        обработка допускается только с согласия;
                        <br> – при обращении субъекта персональных данных к Оператору с требованием о прекращении
                        обработки персональных данных.</p>
                    <p>Срок прекращения обработки – не более 10 (десяти) рабочих дней с даты получения требования (с
                        возможностью продления не более чем на 5 (пять) рабочих дней, если направлено уведомление о
                        причинах продления).</p>
                    <p>7.2. Персональные данные хранятся в форме, позволяющей определить субъекта персональных данных,
                        не дольше, чем этого требуют цели их обработки.</p>
                    <p>7.3. Персональные данные на бумажных носителях хранятся в течение сроков хранения документов, для
                        которых эти сроки предусмотрены Федеральным законом от 22.10.2004 № 125-ФЗ «Об архивном деле в
                        Российской Федерации».</p>
                    <p>7.4. Срок хранения персональных данных, обрабатываемых в информационных системах персональных
                        данных, соответствует сроку хранения персональных данных на бумажных носителях.</p>
                </div>
            </div>

            <div class="block">
                <p class="head_">8. Порядок блокирования и уничтожения персональных данных</p>
                <div class="inner_text">
                    <p>8.1. Оператор блокирует персональные данные в порядке и на условиях, предусмотренных
                        законодательством Российской Федерации в области персональных данных.</p>
                    <p>8.2. При достижении целей обработки персональных данных или в случае утраты необходимости в
                        достижении этих целей персональные данные уничтожаются либо обезличиваются.</p>
                    <p>8.3. Незаконно полученные персональные данные или те, которые не являются необходимыми для цели
                        обработки, уничтожаются в течение 7 (семи) рабочих дней со дня представления субъектом
                        персональных данных (его представителем) подтверждающих сведений.</p>
                    <p>8.4. Персональные данные, обработка которых прекращена из-за ее неправомерности и правомерность
                        обработки которых невозможно обеспечить, уничтожаются в течение 10 (десяти) рабочих дней с даты
                        выявления неправомерной обработки.</p>
                    <p>8.5. Персональные данные уничтожаются в течение 30 (тридцати) календарных дней с даты достижения
                        цели обработки, если иное не предусмотрено договором, стороной которого (выгодоприобретателем
                        или поручителем по которому) является субъект персональных данных, иным соглашением между ним и
                        Оператором либо если Оператор не вправе обрабатывать персональные данные без согласия субъекта
                        персональных данных на основаниях, предусмотренных федеральными законами.</p>
                    <p>8.6. При достижении максимальных сроков хранения документов, содержащих персональные данные,
                        персональные данные уничтожаются в течение 30 календарных дней.</p>
                    <p>8.7. Персональные данные уничтожаются (если их сохранение не требуется для целей обработки
                        персональных данных) в течение 30 (тридцати) календарных дней с даты поступления отзыва
                        субъектом персональных данных согласия на их обработку. Иное может предусматривать договор,
                        стороной которого является субъект персональных данных, иное соглашение между ним и Оператором.
                        Отбор материальных носителей (документы, жесткие диски, флеш-накопители и т.п.) и (или) сведений
                        в информационных системах, содержащих персональные данные, которые подлежат уничтожению,
                        осуществляют подразделения Оператора, обрабатывающие персональные данные.</p>
                    <p>8.8. Уничтожение персональных данных осуществляет лицо, ответственное за обработку персональных
                        данных в соответствии с Приказом о назначении лица, ответственного за обработку персональных
                        данных.</p>
                    <p>8.9. Лицо, ответственное за обработку персональных данных, составляет акт с указанием документов,
                        иных материальных носителей и (или) сведений в информационных системах, содержащих персональные
                        данные, которые подлежат уничтожению.</p>
                    <p>8.10. Персональные данные на бумажных носителях уничтожаются с использованием шредера.</p>
                    <p>8.11. Персональные данные на электронных носителях уничтожаются путем механического нарушения
                        целостности носителя, не позволяющего считать или восстановить персональные данные, а также
                        путем удаления данных с электронных носителей методами и средствами гарантированного удаления
                        остаточной информации.</p>
                    <p>8.12. Непосредственно после уничтожения персональных данных оформляется акт об их
                        уничтожении.</p>
                </div>
            </div>

            <div class="block">
                <p class="head_">9. Процедура, направленная на выявление и предотвраще ниенарушений законодательства в
                    сфере персональных данных</p>
                <div class="inner_text">
                    <p>9.1. К процедурам, направленным на выявление и предотвращение нарушений законодательства в сфере
                        персональных данных и устранение таких последствий, относятся:
                        <br> – реализация мер, направленных на обеспечение выполнения Оператором своих обязанностей;
                        <br> – выполнение предусмотренных законодательством обязанностей, возложенных на Оператора;
                        <br> – обеспечение личной ответственности сотрудников, осуществляющих обработку либо доступ к
                        персональным данным;
                        <br> – организация рассмотрения запросов субъектов персональных данных или их представителей и
                        ответов
                        на такие запросы;
                        <br> – организация внутреннего контроля соответствия обработки персональных данных требованиям к
                        защите, установленным действующим законодательством и локальными актами;
                        <br> – сокращение объема обрабатываемых данных;
                        <br> – стандартизация операций, осуществляемых с персональными данными;
                        <br> – определение порядка доступа сотрудников в помещения, в которых ведется обработка
                        персональных
                        данных;
                        <br> – проведение необходимых мероприятий по обеспечению безопасности персональных данных и
                        носителей
                        персональных данных;
                        <br> – проведение периодических проверок условий обработки персональных данных;
                        <br> – повышение осведомленности сотрудников, имеющих доступ к персональным данным, путем
                        ознакомления
                        с положениями законодательства Российской Федерации, локальными актами и организации обучения;
                        <br> – блокирование, внесение изменений и уничтожение персональных данных в предусмотренных
                        действующим законодательством случаях;
                        <br> – оповещение субъектов персональных данных в предусмотренных действующим законодательством
                        случаях;
                        <br> – разъяснение прав субъектам персональных данных в вопросах обработки и обеспечения
                        безопасности
                        персональных данных;
                        <br> – публикация и обеспечение доступа неограниченному кругу лиц документов, определяющих
                        политику в
                        отношении обработки персональных данных.</p>
                    <p>Указанный перечень процедур может дополняться.</p>
                </div>
            </div>

            <div class="block">
                <p class="head_">10. Внутренний контроль соблюдения требований Положения</p>
                <div class="inner_text">
                    <p>10.1. Оператором проводятся внутренние расследования в следующих ситуациях:
                        <br> – при неправомерной или случайной передаче (предоставлении, распространении, доступе)
                        персональных данных, повлекшей нарушение прав субъектов персональных данных;
                        <br> – в иных случаях, предусмотренных законодательством в области персональных данных.</p>
                    <p>10.2. Работник, ответственный за организацию обработки персональных данных, осуществляет
                        внутренний контроль:
                        <br> – за соблюдением работниками, уполномоченными на обработку персональных данных, требований
                        законодательства в области персональных данных, локальных нормативных актов;
                        <br> – соответствием указанных актов, требованиям законодательства в области персональных
                        данных.</p>
                    <p>10.3. Внутренний контроль проходит в виде внутренних проверок.</p>
                    <p>10.3.1. Внутренние плановые проверки осуществляются на основании приказа руководителя Общества не
                        реже 1 раза в год.</p>
                    <p>10.3.2. Внутренние внеплановые проверки осуществляются по решению работника, ответственного за
                        организацию обработки персональных данных. Основанием для них служит информация о нарушении
                        законодательства в области персональных данных, поступившая в устном или письменном виде.</p>
                    <p>10.3.3. По итогам внутренней проверки оформляется докладная записка. В случае выявления нарушений
                        в документе приводятся перечень мероприятий по их устранению и соответствующие сроки.</p>
                    <p>10.3.4. Внутреннее расследование проводится, если выявлен факт неправомерной или случайной
                        передачи (предоставления, распространения, доступа) персональных данных, повлекшей нарушение
                        прав субъектов персональных данных (далее - инцидент).</p>
                    <p>10.3.5. В случае инцидента Оператор в течение 24 часов уведомляет Федеральную службу по надзору в
                        сфере связи, информационных технологий и массовых коммуникаций (Роскомнадзор):
                        <br> – об инциденте;
                        <br> – его предполагаемых причинах и вреде, причиненном правам субъекта (нескольким субъектам)
                        персональных данных;
                        <br> – принятых мерах по устранению последствий инцидента;
                        <br> – представителе Оператора, который уполномочен взаимодействовать с Роскомнадзором по
                        вопросам,
                        связанным с инцидентом.</p>
                    <p>10.3.6. В течение 72 часов Оператор обязан:
                        <br> – уведомить Роскомнадзор о результатах внутреннего расследования;
                        <br> – предоставить сведения о лицах, действия которых стали причиной инцидента (при наличии).
                    </p>
                    <p>10.4. В случае предоставления субъектом персональных данных (его представителем) подтвержденной
                        информации о том, что персональные данные являются неполными, неточными или неактуальными, в них
                        вносятся изменения в течение семи рабочих дней. Оператор уведомляет в письменном виде субъекта
                        персональных данных (его представителя) о внесенных изменениях и сообщает (по электронной почте)
                        о них третьим лицам, которым были переданы персональные данные.</p>
                    <p>10.5. Оператор уведомляет субъекта персональных данных (его представителя) об устранении
                        нарушений в части неправомерной обработки персональных данных.</p>
                    <p>10.6. В случае уничтожения персональных данных, незаконно полученных или не являющихся
                        необходимыми для заявленной цели обработки, Оператор уведомляет субъекта персональных данных
                        (его представителя) о принятых мерах в письменном виде. Оператор уведомляет по электронной почте
                        также третьих лиц, которым были переданы такие персональные данные.</p>
                </div>
            </div>

            <div class="block">
                <p class="head_">11. Доступ к персональным данным</p>
                <div class="inner_text">
                    <p>11.1. Право доступа к персональным данным имеют:
                        <br> – руководители отделов;
                        <br> – сотрудники отдела продаж;
                        <br> – сотрудники административного отдела.</p>
                    <p>11.2. Доступ специалистов других отделов к персональным данным осуществляется на основании
                        письменного разрешения Оператора.</p>
                    <p>11.3. Субъект персональных данных имеет право:</p>
                    <p>11.3.1. Получать доступ к своим персональным данным и ознакомление с ними, включая право на
                        безвозмездное получение копий любой записи, содержащей персональные данные клиента.</p>
                    <p>11.3.2. Требовать от Оператора уточнения, исключения или исправления неполных, неверных,
                        устаревших, недостоверных, незаконно полученных или не являющих необходимыми для клиента
                        персональных данных.</p>
                    <p>11.3.3. Получать от Оператора:
                        <br> – перечень обрабатываемых персональных данных и источник их получения;
                        <br> – сроки обработки персональных данных, в том числе сроки их хранения;
                        <br> – сведения о том, какие юридические последствия для субъекта персональных данных может
                        повлечь за собой обработка его персональных данных.</p>
                    <p>11.4. Передача информации третьей стороне возможна только при письменном согласия субъекта
                        персональных данных.</p>
                </div>
            </div>
            <div class="block">
                <p class="head_">12. Ответственность за нарушение норм, регулирующих обработку персональных данных</p>
                <div class="inner_text">
                    <p>12.1. Лица, виновные в нарушении положений законодательства Российской Федерации в области
                        персональных данных при обработке персональных данных, привлекаются к дисциплинарной и
                        материальной ответственности в порядке, установленном Трудовым кодексом Российской Федерации и
                        иными федеральными законами. Кроме того, они привлекаются к административной,
                        гражданско-правовой или уголовной ответственности в порядке, установленном федеральными
                        законами.</p>
                    <p>12.2. Моральный вред, причиненный субъекту персональных данных вследствие нарушения его прав,
                        нарушения правил обработки персональных данных, а также несоблюдения требований к их защите,
                        установленных Законом о персональных данных, подлежит возмещению в соответствии с
                        законодательством Российской Федерации. Возмещение морального вреда осуществляется независимо от
                        возмещения имущественного вреда и понесенных субъектом персональных данных убытков.</p>
                </div>
            </div>

            <div class="block">
                <p class="head_">Приложения:</p>
                <div class="inner_text">
                   <p>– Приложение № 1 «Согласие на обработку персональных данных»;</p>
                </div>
            </div>
        </div>
    </div>
</template>

<style scoped>

table {
    border-collapse: collapse;
    border: white 1px solid;
    min-width: 500px;
    max-width: 720px;
}

td {
    padding: 10px;
    vertical-align: top;
    border: white 1px solid;
}

b {
    font-weight: 700;
}

ul {
    margin-left: 30px;

    li {
        list-style-type: decimal;
        margin-bottom: 15px;

        ul {
            li {
                list-style-type: disc;
            }
        }
    }
}

.blocks {
    display: flex;
    flex-direction: column;
    gap: 48px;
    margin-bottom: 80px;

    .block {
        display: flex;
        flex-direction: column;
        gap: 24px;
        text-align: start;
    }

    .head_ {
        font-weight: 700;
        font-size: 20px;
        line-height: 120%;
        color: var(--dark-select-10);
    }

    .inner_text {
        display: flex;
        flex-direction: column;
        gap: 20px;

        p {
            font-weight: 400;
            font-size: 19px;
            line-height: 147%;
            color: var(--dark-select-10);

            a {
                text-decoration: underline;
                text-decoration-skip-ink: none;
                color: var(--yellow);
            }
        }
    }
}

.head_title {
    margin-bottom: 48px;

    h1 {
        font-weight: 900;
        font-size: 40px;
        line-height: 110%;
        color: var(--dark-select-10);
        margin-bottom: 24px;
        text-align: start;
    }

    h2 {
        font-weight: 700;
        font-size: 20px;
        line-height: 120%;
        color: var(--dark-select-10);
        text-align: start;
    }
}

@media (max-width: 1100px) {
    .scroll {
        overflow-x: scroll;
        padding-bottom: 20px;
    }
    .blocks {
        display: flex;
        flex-direction: column;
        gap: 24px;

        .block {
            display: flex;
            flex-direction: column;
            gap: 16px;
            text-align: start;
        }

        .head_ {
            font-weight: 700;
            font-size: 16px;
            line-height: 125%;
            color: var(--dark-select-10);
        }

        .inner_text {
            gap: 16px;

            p {
                font-weight: 400;
                font-size: 15px;
                line-height: 160%;
                color: var(--dark-select-10);

                a {
                    text-decoration: underline;
                    text-decoration-skip-ink: none;
                    color: var(--yellow);
                }
            }
        }
    }

    .head_title {
        margin-bottom: 24px;

        h1 {
            font-weight: 900;
            font-size: 24px;
            line-height: 117%;
            color: var(--dark-select-10);
            margin-bottom: 16px;
        }

        h2 {
            font-weight: 700;
            font-size: 16px;
            line-height: 125%;
            color: var(--dark-select-10);
        }
    }
}
</style>
<script setup lang="ts">
</script>
